{"id":2269,"date":"2018-11-07T14:24:00","date_gmt":"2018-11-07T02:24:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2269"},"modified":"2020-01-01T18:58:25","modified_gmt":"2020-01-01T06:58:25","slug":"6-it-virus-and-cyber-security-threats","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/6-it-virus-and-cyber-security-threats\/","title":{"rendered":"6 IT Virus and Cyber Security Threats to Your Business"},"content":{"rendered":"\n<p>Virus threats and <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a> are almost a daily occurrence in the life of those in IT. But for those who feel pretty far removed from such a reality, it can be a very scary situation when it does happen to you and your business.<\/p>\n\n\n\n<p>It can, and does happen, and with online threats a very real issue it is imperative that your <a href=\"https:\/\/it360.co.nz\/blog\/is-your-business-data-backed-up-correctly\/\">business’s data is&nbsp;secure and always backed-up correctly<\/a>.<\/p>\n\n\n\n<p>Sure, some threats are merely irritating, but some cause real damage&nbsp;to an organisation; from losing data to requiring an expensive repair, as well as <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">hit to the businesses reputation<\/a> (particularly if private details are compromised).<\/p>\n\n\n\n<p><strong>Read more:&nbsp;<\/strong><a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-insurance\/\">What is cyber security insurance and should you get it?<\/a><\/p>\n\n\n\n<p>So what do you need to know about IT virus and cyber security threats?&nbsp;Here are the most common ones out there today.<\/p>\n\n\n\n<h2>6 Most Common Virus Threats to Your Business<\/h2>\n\n\n\n<h3>1. Crypto-Ransomware<\/h3>\n\n\n\n<p>Perhaps one of most confronting cyber threats right now is crypto-ransomware (also called cryptolocker, cryptowall, and CTB-locker). A form of malware, files on a PC or network storage are encrypted with code so they are unaccessible to the user, who then has to pay money for them to be ‘unlocked’.<\/p>\n\n\n\n<h3>2. Shadow IT<\/h3>\n\n\n\n<p>Shadow IT is the use of unauthorised software and applications by employees, and it is a problem. Aside from overloading network resources and impacting on data compliance, there is also the real threat of <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">security breaches<\/a> from unapproved and un-monitored apps.<\/p>\n\n\n\n<p><strong>This blog post is a condensed version of an article in our latest eBook.&nbsp;Keen on further knowledge on how to manage IT in your business? Download:&nbsp;<\/strong><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><strong>An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/strong><\/a><\/p>\n\n\n\n<h3>3. Trojan horse<\/h3>\n\n\n\n<p>A Trojan horse is a program that appears to be legitimate but actually contains another program or block of undesired malicious, destructive code, disguised and hidden in a block of desirable code. Trojans can be used to infect a computer with a virus.<\/p>\n\n\n\n<p>A back-door Trojan is a program that allows a remote user or hacker to bypass the normal access controls of a computer and gain unauthorised control over it. Typically a virus is used to place the back-door Trojan onto a computer, and once the computer is online, the person who sent the Trojan can run programs on the infected computer, access personal files, and modify and upload files.<\/p>\n\n\n\n<h3>4. Worms<\/h3>\n\n\n\n<p>Viruses and worms spread across computers and networks by making copies of themselves, usually without the knowledge of the computer user.<\/p>\n\n\n\n<h3>5. Botnets<\/h3>\n\n\n\n<p>A botnet is a group of infected, remotely-controlled computers.<\/p>\n\n\n\n<p>The hacker sends out a virus, Trojan or worm to&nbsp;ordinary computers. The virus, Trojan or worm gains access to the computer, usually through some malicious application that they are carrying. This in turn allows the hacker to gain full control of the now-infected computers. These computers can then be used to launch denial-of service attacks, distribute spam emails and commit click fraud, identity theft and thefts of log-in details and credit card numbers.<\/p>\n\n\n\n<p>Botnets are very difficult to prevent by the use of software tools alone, it is important that users follow best practice guidance with regards to emails and website usage. See our guide on how to introduce an internet and email policy. It is important that you ensure that all software and anti-virus tools are up-to-date, to prevent malicious code from exploiting security holes in software and making your system vulnerable.<\/p>\n\n\n\n<h3>6. Spyware<\/h3>\n\n\n\n<p>Spyware is installed on a users computer or network, without their knowledge, and collects private information like passwords, keystrokes, internet interaction and other valuable data. Often hidden in freeware or shareware that&nbsp;is downloaded from the internet, some are actually for very legitimate purposes, but most of the time it is related to&nbsp;malicious actions.<\/p>\n\n\n\n<p><strong>Keen on further knowledge on how to manage IT in your business? Download:&nbsp;<\/strong><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><strong>An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/strong><\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/An-essential-guide-CTA-1024x512.png\" alt=\"Download the Essential Guide to IT for SME Businesses\" class=\"wp-image-6699\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Virus threats and cyber security are almost a daily occurrence in the life of those in IT. But for those who feel pretty far removed from such a reality, it can be a very scary situation when it does happen to you and your business. It can, and does happen, and with online threats a [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2520,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,32,45],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2269"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2269"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2269\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2520"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2269"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2269"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2269"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}