{"id":2276,"date":"2018-10-16T12:45:10","date_gmt":"2018-10-16T00:45:10","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2276"},"modified":"2019-12-21T19:59:36","modified_gmt":"2019-12-21T07:59:36","slug":"cyber-security-insurance","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/cyber-security-insurance\/","title":{"rendered":"What Is Cyber Security Insurance, and Should You Get It?"},"content":{"rendered":"\n<p>Remember the large scale <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a> breach at Sony at the end of 2014? The media may have slightly over-hyped the situation, but there was certainly a ripple of panic sent through businesses and organisations worldwide.<\/p>\n\n\n\n<p>The thing is, online security and threats are no longer reserved for Hollywood action movies (or those who make them). They exist right here in New Zealand, and is something that needs attention today from business management and owners.<\/p>\n\n\n\n<p><strong>Read more:&nbsp;<\/strong><a href=\"https:\/\/it360.co.nz\/blog\/how-to-set-up-risk-management\/\" target=\"_blank\" rel=\"noopener noreferrer\">How to: Set up risk management for IT<\/a><\/p>\n\n\n\n<h2>What Is Cyber Security Insurance<\/h2>\n\n\n\n<p>Insurance is about peace-of-mind, and protecting yourself from the ‘what-ifs’ and no business would hesitate to protect themselves against theft, fire, natural disasters and other more ‘common’ risks. However the thought of a threat to our businesses coming via a computer, over the internet, is still seen by many as a futuristic issue.<\/p>\n\n\n\n<p>In-fact, those businesses taking out cyber security insurance is on the up, and there are plenty of organisations who are already making the move to cover themselves should the unexpected (and undesirable) occur. So the question is, should your business have it?<\/p>\n\n\n\n<p>It would certainly be proactive for any business leader responsible for IT to look into the possibility of cyber security&nbsp;insurance. Like anything, it’s best that you gather as much knowledge as possible around the subject before embarking on a decision-making process. And when it comes to insurance, no policy is the same, so it is imperative to understand what will actually be covered should you take out insurance.<\/p>\n\n\n\n<h2>What to Look for in a Cyber Security Insurance<\/h2>\n\n\n\n<p>According to this breakdown from Crombie Lockwood, cyber security insurance typically provides resources or cover for:<\/p>\n\n\n\n<ul><li><strong>Defence costs and damages<\/strong> relating to third party claims for breaches of privacy etc<\/li><li>The <strong>reconstruction of data and the loss of income<\/strong> following a cyber attack on your network<\/li><li>Costs and expenses for advice and support in repairing <strong>reputational damage and loss of customer confidence<\/strong><\/li><\/ul>\n\n\n\n<p>You also need to know what exclusions limitations apply to the policy, and this could range anywhere from&nbsp;un-encrypted data to cloud and mobile data, first party notification and data restoration.<\/p>\n\n\n\n<p>Before getting bogged down in the technical side of things, it is best to do a risk assessment of your business&nbsp;to work out what kind of cover or protection you actually need. For example, if you don’t collect customer’s credit card details, then you may not need to have credit monitoring services in your policy.<\/p>\n\n\n\n<p>In September 2014, the Insurance Council of New Zealand joined forces with the Government on a cyber security initiative, and what came from this was Connect Smart. Feel free to&nbsp;<a href=\"https:\/\/www.connectsmart.govt.nz\/about\/governments-cyber-security-strategy\/\" target=\"_blank\" rel=\"noopener noreferrer\">check this out<\/a>, or contact us if you have any further questions around whether your business needs to consider more protection around cyber security.<\/p>\n\n\n\n<p>&#8212;&#8212;<\/p>\n\n\n\n<p>This blog post is a condensed version of an article in our latest eBook. Keen on further knowledge on how to manage IT in your business? Download:<a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"> <strong>An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/strong><\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/An-essential-guide-CTA-1024x512.png\" alt=\"Download the Essential Guide to IT for SME Businesses\" class=\"wp-image-6699\" title=\"\"><\/a><\/figure>\n\n\n\n<p><em>The information provided in this article is purely a general introduction on the subject of cyber security insurance – it should not be used as specific advice for your business. A decision to buy insurance should be discussed with an expert.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Remember the large scale cyber security breach at Sony at the end of 2014? The media may have slightly over-hyped the situation, but there was certainly a ripple of panic sent through businesses and organisations worldwide. The thing is, online security and threats are no longer reserved for Hollywood action movies (or those who make [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2759,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,46],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2276"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2276"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2276\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2759"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2276"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2276"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2276"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}