{"id":2280,"date":"2018-09-27T16:23:51","date_gmt":"2018-09-27T04:23:51","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2280"},"modified":"2022-06-12T11:36:08","modified_gmt":"2022-06-11T23:36:08","slug":"how-to-set-up-risk-management","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/how-to-set-up-risk-management\/","title":{"rendered":"How To: Set Up Risk Management for IT"},"content":{"rendered":"\n<p><span id=\"alttext-container\"><span id=\"alttext\">Is IT in your business set up to be risk free?&nbsp;<\/span><\/span>Do you have a risk management process set up? If no, this is something that requires your urgent attention. If you do are you sure it is fool-proof?<\/p>\n\n\n\n<p>To capture the subject in its entirety, ISACA describes risk management for IT as “the process of identifying vulnerabilities and threats to the information resources used by an organization in achieving business objectives, and deciding what countermeasures, if any, to take in reducing risk to an acceptable level, based on the value of the information resource to the organization.”<\/p>\n\n\n\n<p><strong>This blog post is a condensed version of an article in our latest eBook.&nbsp;Keen on further knowledge on how to manage IT in your business? Download:&nbsp;<a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\">An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/a><\/strong><\/p>\n\n\n\n<p>Here’s how to set up a process for IT risk management (ITRM).<\/p>\n\n\n\n<h2>6 Questions to Ask When Setting Up IT Risk Management<\/h2>\n\n\n\n<h3>1. Who<\/h3>\n\n\n\n<p>Who is going to implement the ITRM strategy? Who is going to action it when\/if it is required? These need to be clearly set out in order for all personnel to understand what they have responsibility for – and this will ensure the procedures set out are effectively actioned when required.<\/p>\n\n\n\n<p>There also needs to be the appropriate level of authorisation given to those in charge of risk management, so they are able to carry out decision-making for situations where there isn’t a defined path for resolution.<\/p>\n\n\n\n<h3>2. What<\/h3>\n\n\n\n<p>What are the risks you face as an organisation? Think about all possible internal and external threats, and then set guidelines around what level of risk they pose to your business – as well as tolerance benchmarks to identify what course of action to take to rectify the issue&nbsp;that has occurred.<\/p>\n\n\n\n<h3>3. Where<\/h3>\n\n\n\n<p>Every business and organisation needs to have a plan for ITRM, and it needs to be kept visible for all of those involved in its development and implementation. It is important to have alignment throughout the company, and for the ITRM to be worked alongside with other business policies and procedures.<\/p>\n\n\n\n<h3>4. When<\/h3>\n\n\n\n<p>Timings are critical for risk management response – so set up deadlines for when identified courses of action should be taken. And again, this can be separated out into each level of risk – to determine when a resolution should take effect, or when it needs to be escalated to a higher authority.<\/p>\n\n\n\n<h3>5. Why<\/h3>\n\n\n\n<p>As well as knowing what IT risks you f ace as a business, you should also be able to understand why they are an issue for your organisation. This can help with putting processes in place as to your course of action following risk infiltration.&nbsp;&nbsp;For example, ‘Why would it matter that our data was compromised?’ Because it would mean private details of customers would be exposed.<\/p>\n\n\n\n<h3>6. How<\/h3>\n\n\n\n<p>So following on from the above, how do you mitigate that risk? Whether it is by enhancing security, or putting other protection processes in place.<\/p>\n\n\n\n<p>&#8212;&#8212;-<\/p>\n\n\n\n<p><strong>This blog post is a condensed version of an article in our latest eBook. Keen on further knowledge on how to manage IT in your business? Download: <a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\">An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/a><\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/online-security-CTA-1024x512.png\" alt=\"Download the Online Security for New Zealand Businesses eBook\" class=\"wp-image-6707\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Is IT in your business set up to be risk free?&nbsp;Do you have a risk management process set up? If no, this is something that requires your urgent attention. If you do are you sure it is fool-proof? To capture the subject in its entirety, ISACA describes risk management for IT as “the process of [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2788,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[86,28],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2280"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2280"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2280\/revisions"}],"predecessor-version":[{"id":9201,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2280\/revisions\/9201"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2788"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2280"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2280"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2280"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}