{"id":2308,"date":"2018-05-22T12:15:12","date_gmt":"2018-05-22T00:15:12","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2308"},"modified":"2019-12-20T00:41:00","modified_gmt":"2019-12-19T12:41:00","slug":"8-questions-to-ask-when-choosing-a-new-it-provider","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/8-questions-to-ask-when-choosing-a-new-it-provider\/","title":{"rendered":"8 Questions to Ask When Choosing a New IT Provider"},"content":{"rendered":"\n<p>Choosing a new IT provider can feel akin to stumbling around in the dark. How can you tell which providers will deliver the best service for the best price? Sometimes, the only way to find out is to ask.<\/p>\n\n\n\n<p>Below are 8 questions to ask potential IT providers before you engage in a partnership. Be sure to pose these questions to several different providers so you can compare their responses.<\/p>\n\n\n\n<h2>8 Questions to Ask IT Providers<\/h2>\n\n\n\n<h3>1. How long have you been in business?<\/h3>\n\n\n\n<p>This is a great question to lead with as it’s specific and straight-to-the-point, yet it also invites the IT provider to give you a little bit of background about their history.<\/p>\n\n\n\n<p>Most providers will likely launch into a brief explanation about how they got to be where they are today, and you’ll be able to glean some interesting facts about their business.<\/p>\n\n\n\n<p><strong>Read more:&nbsp;<\/strong><a href=\"https:\/\/it360.co.nz\/blog\/5-ways-to-get-the-right-it-partner-for-your-business\/\" target=\"_blank\" rel=\"noopener noreferrer\">5 ways to get the right IT partner for your business<\/a><\/p>\n\n\n\n<h3>2. What’s your company culture like?<\/h3>\n\n\n\n<p>The way a business defines their company culture tells you a lot about what they’re like to work with.<\/p>\n\n\n\n<p>Do they like to have fun or are they more serious types? Are they great communicators or are they very introverted?<\/p>\n\n\n\n<p>Try to look for an IT partner who shares similar values to you; this will make working together all the more enjoyable.<\/p>\n\n\n\n<h3>3. Do you have experience working with businesses in my industry?<\/h3>\n\n\n\n<p>Give them an opportunity to deliver a sales pitch about their past experience and why this makes them a good fit for your IT needs. Ask for specific examples and request to see references or testimonials.<\/p>\n\n\n\n<h3>4. What is your approach to customer service?<\/h3>\n\n\n\n<p>Put their customer service skills to the test by asking them this important question. Those that are confident in their communication abilities will likely give you a great answer.<\/p>\n\n\n\n<h3>5. What is your protocol for dealing with software malfunctions or security threats?<\/h3>\n\n\n\n<p>Every now and then, something will go wrong – that’s an inevitable reality of IT! The key question is: how will your IT provider react in a crisis?<\/p>\n\n\n\n<p>Ask them to explain their process.<\/p>\n\n\n\n<p>Ideally, their answer will leave you feeling reassured about their level of expertise and readiness to handle any challenge that comes their way.<\/p>\n\n\n\n<h3>6. What are your rates and are there any hidden costs I should be aware of?<\/h3>\n\n\n\n<p>It’s impossible to budget for IT needs if you don’t know what you’re up for. Ask your potential IT provider to outline their fees and let you know about any hidden costs.<\/p>\n\n\n\n<p>Clarify how they charge for their services. For example, do they charge per hour or on a subscription basis?<\/p>\n\n\n\n<h3>7. Here’s a basic overview of my current IT set-up. What would you change and why?<\/h3>\n\n\n\n<p>This question is a bit of a tricky one.<\/p>\n\n\n\n<p>Give them a rundown of your current IT infrastructure and ask them to come up with some ideas for improvement. This tests whether they are proactive and keen to help you do your best, or whether they are too busy to go the extra mile.<\/p>\n\n\n\n<h3>8. When can you start?<\/h3>\n\n\n\n<p>Last but not least, find out when they can get started and check whether or not they have a waiting list or a lengthy onboarding time. This closing question also gives them a chance to make a final sales pitch and show you how keen they are for your business.<\/p>\n\n\n\n<p><strong>Keen to understand what trends are big in business IT this year? Download: <\/strong><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><strong>An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/strong><\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/An-essential-guide-CTA-1024x512.png\" alt=\"Download the Essential Guide to IT for SME Businesses\" class=\"wp-image-6699\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Choosing a new IT provider can feel akin to stumbling around in the dark. How can you tell which providers will deliver the best service for the best price? Sometimes, the only way to find out is to ask. Below are 8 questions to ask potential IT providers before you engage in a partnership. Be [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2839,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[12],"tags":[],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2308"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2308"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2308\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2839"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2308"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2308"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2308"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}