{"id":2321,"date":"2018-08-09T12:26:17","date_gmt":"2018-08-09T00:26:17","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2321"},"modified":"2022-06-12T11:36:10","modified_gmt":"2022-06-11T23:36:10","slug":"company-culture-threatening-your-cyber-security","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/company-culture-threatening-your-cyber-security\/","title":{"rendered":"Company Culture Threatening Your Cyber Security?"},"content":{"rendered":"\n<p>A flexible company culture can do wonders for productivity, creativity and team morale. But without proper precautions in place, it could also pose a threat to cyber security.<\/p>\n\n\n\n<p>Despite huge advancements in <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a> technology,&nbsp;<a href=\"https:\/\/www.zdnet.com\/article\/training-what-training-workers-lack-of-cybersecurity-awareness-is-putting-the-business-at-risk\/\" target=\"_blank\" rel=\"noopener\">human error is still a leading cause of serious security breaches<\/a>.<\/p>\n\n\n\n<p>Remote working, document sharing, the use of personal devices at work – these are all hallmarks of a flexible company culture, designed to foster collaboration and innovation in the workplace.<\/p>\n\n\n\n<h3>Flexibility vs Vulnerability<\/h3>\n\n\n\n<p>However, there’s a fine line between flexibility and vulnerability. It’s important to ensure that your company culture doesn’t expose any weaknesses in your cyber security strategy. The sharing of company data across multiple devices could put your intellectual property at risk.<\/p>\n\n\n\n<p>According to&nbsp;<a href=\"https:\/\/www.axelos.com\/Corporate\/media\/Files\/cyber-awareness.pdf\" target=\"_blank\" rel=\"noopener\">research by AXELOS<\/a>, an education management organisation committed to identifying global best practice in IT service management and cyber resilience, “organisations need to recognise the importance of the ‘human factor’ in protecting their most precious information assets and systems”.<\/p>\n\n\n\n<p>The research paper, titled ‘Are your people playing an effective role in your cyber resilience?’, argues that employees are both an organisation’s “most effective security control” and “potentially, their greatest vulnerability to attack”.<\/p>\n\n\n\n<p>So how can you foster a flexible company culture based on open collaboration, while also protecting sensitive information?<\/p>\n\n\n\n<p>By creating a culture of awareness, education, trust, and accountability. Many people are simply unaware that their actions could be putting security at risk. It’s therefore up to you to educate them about their cyber security responsibilities within the workplace.<\/p>\n\n\n\n<h3>Cultural Shifts Need to Happen<\/h3>\n\n\n\n<p>A good place to start is by creating a <a href=\"https:\/\/it360.co.nz\/blog\/how-to-create-an-it-policy\/\">cyber security information policy<\/a> and include it in employee contracts and handbooks. This policy should clearly state your organisation’s rules surrounding cyber security, and be regularly updated to accommodate industry advancements.<\/p>\n\n\n\n<p>However, a written policy will not be enough to change your company culture. To create a cultural shift, you will need to <strong>talk to employees about cyber security on a regular basis<\/strong>, in both one-on-one situations and wider team meetings, as well as digitally (for example, via email or staff intranet). Cyber security is not a ‘set and forget’ strategy; it must continually be revisited and discussed so that it says at the forefront of everyone’s mind.<\/p>\n\n\n\n<p>AXELOS advises that organisations take this one step further, and roll out customised employee training programmes, so that no one is learning about rules that don’t relate to their position, and vice versa.<\/p>\n\n\n\n<p>“Your training and awareness learning might be telling staff to do things that are not relevant and not part of their working life. The learning needs to be directly related to what they do.”<\/p>\n\n\n\n<p>It’s also essential to <strong>foster a culture of trust, as opposed to surveillance<\/strong>. If employees feel they are operating in a ‘Big Brother’ environment, this may negatively impact other facets of your company culture, such as collaboration and innovation. The best way to foster trust is to encourage regular, open conversations and feedback. Cyber security communication should always be a two-way street.<\/p>\n\n\n\n<p>Once everyone in your organisation understands the importance of cyber security, it will be much easier for you to implement security techniques and technology, such as firewalls and mobile device management (MDM). People are far more likely to follow rules if they understand the reasoning behind them; aim for awareness first, implementation second<\/p>\n\n\n\n<p><strong>Keen to understand more about Online Security Protection for New Zealand businesses? <a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\">Download our latest eBook &#8211; it&#8217;s FREE<\/a>!<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/online-security-CTA-1024x512.png\" alt=\"Download the Online Security for New Zealand Businesses eBook\" class=\"wp-image-6707\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>A flexible company culture can do wonders for productivity, creativity and team morale. But without proper precautions in place, it could also pose a threat to cyber security. Despite huge advancements in cyber security technology,&nbsp;human error is still a leading cause of serious security breaches. Remote working, document sharing, the use of personal devices at [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2800,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[31,86,32],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2321"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2321"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2321\/revisions"}],"predecessor-version":[{"id":9206,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2321\/revisions\/9206"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2800"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2321"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2321"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2321"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}