{"id":2329,"date":"2018-03-10T13:12:39","date_gmt":"2018-03-10T00:12:39","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2329"},"modified":"2019-12-29T17:16:42","modified_gmt":"2019-12-29T05:16:42","slug":"does-your-it-company-speak-a-language-you-can-understand","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/does-your-it-company-speak-a-language-you-can-understand\/","title":{"rendered":"Does Your IT Company Speak a Language You Can Understand?"},"content":{"rendered":"\n<p>If you’re not technologically-savvy, the thought of communicating with an IT expert might fill you with dread. It’s a well-known stereotype that many IT professionals seem to speak a language of their own – usually something that sounds like English, only it’s peppered with programme-specific jargon and fancy-sounding acronyms.<\/p>\n\n\n\n<p>Unless you speak ‘tech’, you probably don’t enjoy it when such IT types aren’t able to provide you with information that’s easy to understand. This is why it’s essential to work with an IT company which prides itself on having excellent communication skills.<\/p>\n\n\n\n<p><strong>Read more:&nbsp;<\/strong><a href=\"https:\/\/it360.co.nz\/blog\/why-you-should-set-kpis-for-your-it-company\/\" target=\"_blank\" rel=\"noopener noreferrer\">Why you should set KPIs for your IT company<\/a><\/p>\n\n\n\n<p>Ideally, your IT company will be able to educate you about all of the <a href=\"https:\/\/it360.co.nz\/blog\/how-to-keep-up-to-date-with-technological-changes-affecting-a-business\/\">new technologies<\/a> you’re looking to implement in your business, so you can make well-informed decisions. They’ll act as an advisor and guide you in the right direction, but they’ll also make sure you understand exactly what’s going on each step of the way – after all, it’s your business!<\/p>\n\n\n\n<p>Although it may seem easier to ‘just let the IT guys do their thing’, it’s important to have a strong understanding of why you’re <a href=\"https:\/\/it360.co.nz\/blog\/4-emerging-security-monitoring-technologies\/\">investing in certain technologies<\/a>, as this will enable you to be a better leader.<\/p>\n\n\n\n<p>Speaking of leadership, not every IT professional will understand the importance of good communication from the get-go; you might have to lead the way, and demonstrate what you need from them in order for the relationship to work.<\/p>\n\n\n\n<p>Instead of leaving good communication to chance, it’s recommended that you put some <strong>basic guidelines<\/strong> in place before you sign the contract. In doing this, you can weed out any companies that do not have the capacity to meet your communication requirements.<\/p>\n\n\n\n<p>Here are some key things to check before selecting an IT company:<\/p>\n\n\n\n<h2>3 Key Areas to Check Before Choosing an IT Partner<\/h2>\n\n\n\n<h3>1. Communication KPIs<\/h3>\n\n\n\n<p>See if your IT company is willing to agree on some <a href=\"https:\/\/it360.co.nz\/blog\/why-you-should-set-kpis-for-your-it-company\/\">KPIs regarding communication<\/a>. For example, you could set a KPI to measure ‘response time’; how quickly they get back to you when you’ve reached out for help.<\/p>\n\n\n\n<p>Whatever you decide on, put these KPIs in writing so you have something to refer to in the future if there is a communication breakdown.<\/p>\n\n\n\n<h3>2. Face-to-face meetings and phone calls<\/h3>\n\n\n\n<p>Some IT professionals like to hide behind their computers and rarely engage in face-to-face or telephone contact. While emails are perfectly adequate most of the time, there are situations where you’ll require verbal explanations to avoid things getting ‘lost in translation’.<\/p>\n\n\n\n<p>What might take hours to explain via email could be resolved in a matter of minutes by picking up the phone. Make sure your chosen IT company has the capacity to accommodate these kinds of meetings on a regular basis.<\/p>\n\n\n\n<h3>3. Willingness to teach<\/h3>\n\n\n\n<p>When you first start working with an IT company, you might go through a steep learning curve as you process new information. This will be a lot easier if the IT professionals show a willingness to teach you about technologies you don’t understand. While this may involve a time commitment in the beginning, in the long-run, it will allow for a more cohesive, productive relationship for both parties.<\/p>\n\n\n\n<p>By conveying your communication expectations to your IT company in the beginning, you will set yourself up for a win, and avoid those dreaded ‘tech-heavy’ conversations later down the track.<\/p>\n\n\n\n<p><strong>Want&nbsp;to know&nbsp;what&#8217;s big for IT this year?&nbsp;Download:&nbsp;<\/strong><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><strong>An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/strong><\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/An-essential-guide-CTA-1024x512.png\" alt=\"Download the Essential Guide to IT for SME Businesses\" class=\"wp-image-6699\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>If you’re not technologically-savvy, the thought of communicating with an IT expert might fill you with dread. It’s a well-known stereotype that many IT professionals seem to speak a language of their own – usually something that sounds like English, only it’s peppered with programme-specific jargon and fancy-sounding acronyms. Unless you speak ‘tech’, you probably [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2921,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[12],"tags":[13],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2329"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2329"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2329\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2921"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2329"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2329"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2329"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}