{"id":2361,"date":"2018-01-11T18:20:45","date_gmt":"2018-01-11T06:20:45","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2361"},"modified":"2020-01-05T00:35:48","modified_gmt":"2020-01-04T12:35:48","slug":"no-cyber-security-policy","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/no-cyber-security-policy\/","title":{"rendered":"No Cyber Security Policy? Your Business Could Be at Risk"},"content":{"rendered":"\n<p>If you don’t have a workplace <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a> policy in place, highly sensitive commercial information could be <strong>unknowingly leaked<\/strong> by your employees. Would you put your business in the hands of your most junior staff  member? <\/p>\n\n\n\n<p>The answer to this question is probably no – unless you have a  truly exceptional junior employee, in which case they probably deserve a  promotion! It may surprise you to hear that if you don’t have a workplace <a href=\"https:\/\/it360.co.nz\/blog\/how-to-create-an-it-policy\/\">cyber security policy<\/a> in place, you might as well be relinquishing control over sensitive company data to your employees. <\/p>\n\n\n\n<p>One wrong click on a malicious website by an unsuspecting staff member and your entire organisation could be vulnerable to hackers and other cyber security breaches. <\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>A workplace cyber security policy exists to educate and \ninform employees about cyber security best practices, so they are less \nlikely to make critical errors or use company technology in an \nunprofessional manner.<\/p><\/blockquote>\n\n\n\n<p> While a cyber security policy does not guarantee cyber safety, it does provide your employees with a set of rules surrounding workplace technology. It’s a way to prevent misuse and cultivate a positive&nbsp;cyber security culture within your organisation. If you’re yet to implement such a policy, don’t delay; the longer you go without, the higher the risk that one of your staff members will inadvertently (or worse, advertently) misuse company technology. Don&#8217;t let these <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">15 cyber security myths<\/a> hurt your business. <\/p>\n\n\n\n<h2>3 Risks of Not Having a Cyber Security Policy<\/h2>\n\n\n\n<p>\nThese are just some of the problems not having a policy can cause:\n<\/p>\n\n\n\n<h3>1. Leaked information<\/h3>\n\n\n\n<p>What if your competitors got hold of important company information? For example about your rates, your client list, or your five-year plan? Without a policy, competitors could access your information through anything from a lost USB to a former employee. <\/p>\n\n\n\n<p>A policy will outline steps to minimise the risk of this happening. <\/p>\n\n\n\n<h3>2. Malware<\/h3>\n\n\n\n<p>A&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/\">virus<\/a>&nbsp;can wreak havoc on your business systems and may even cause you to permanently lose important company data, especially if you haven’t backed it up (take this as a reminder to always <a href=\"https:\/\/it360.co.nz\/blog\/backing-up-company-data-simple-as-3-2-1\/\">back up your data<\/a>).  Employees who do not understand cyber security may be <a href=\"https:\/\/it360.co.nz\/blog\/protect-yourself-online-by-focusing-on-these-two-things\/\">more likely to click on malicious links<\/a>. <\/p>\n\n\n\n<h3>3. Phishing<\/h3>\n\n\n\n<p>A phishing scam is when a hacker sends an email posing as an authoritative organisation, such as a bank or insurance company, and requests private details such as passwords, bank account numbers, or other sensitive information. If your staff are not aware of phishing scams, they may provide this information and therefore put your business at risk. <\/p>\n\n\n\n<p>You can learn more about how you and your employees can <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">protect yourselves online here<\/a>. <\/p>\n\n\n\n<p>Most employees don’t mean to cause harm. Often they do so by accident,  as a result of a lack of education or understanding. <\/p>\n\n\n\n<p>A cyber security policy is your chance to provide this education and awareness, so they know exactly what risks to be aware of and how their actions impact the organisation’s cyber security protection as a whole. <\/p>\n\n\n\n<div class=\"toc\">\n<strong>Read more:<\/strong><br>\n<a href=\"https:\/\/it360.co.nz\/blog\/risks-of-using-wireless-technology-in-business\/\">How employee use of mobile technology puts your network security at risk<\/a><\/div>\n\n\n\n<p>Antivirus software will only get you so far; it must be accompanied by a  detailed policy outlining cyber security best practice. It’s not enough to trust that your employees “just know what to do”; the only way to protect your organisation is to create a clear policy and hold your staff members accountable to it, so there’s no room for misinterpretation. <\/p>\n\n\n\n<p>Business leaders need to realise that cyber&nbsp;security is a big <strong>deal.&nbsp;It affects&nbsp;reputation, internal communication and even company  culture.&nbsp;Keen to understand more about Cyber Security in the Workplace? <a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\">Download our latest eBook &#8211; it&#8217;s FREE<\/a>!<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/cyber-security-CTA-1024x512.png\" alt=\"Download the Guide to Cyber Security in the Workplace eBook\" class=\"wp-image-6708\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>If you don’t have a workplace cyber security policy in place, highly sensitive commercial information could be unknowingly leaked by your employees. Would you put your business in the hands of your most junior staff member? The answer to this question is probably no – unless you have a truly exceptional junior employee, in which [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2892,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,22],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2361"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2361"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2361\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2892"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}