{"id":2370,"date":"2018-05-30T12:02:13","date_gmt":"2018-05-30T00:02:13","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2370"},"modified":"2019-12-23T22:45:18","modified_gmt":"2019-12-23T10:45:18","slug":"risks-of-using-wireless-technology-in-business","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/risks-of-using-wireless-technology-in-business\/","title":{"rendered":"Risks of Using Wireless Technology in Business"},"content":{"rendered":"\n<p>Chances are you have already used Wi‐Fi today. It’s become a <a href=\"https:\/\/it360.co.nz\/blog\/mounting-security-complexity\/\">fundamental part of being connected<\/a>, both literally and figuratively. It’s essential for the family around home, getting work done at the office, and deciding where to have your coffee break.<\/p>\n\n\n\n<p>If you want to get work done away from the office, public Wi‐Fi networks have become essential and many will choose a café with Wi‐Fi over one that doesn’t.<\/p>\n\n\n\n<p>Unfortunately, many people don’t fully understand the risks of using wireless technology in business.&nbsp;<\/p>\n\n\n\n<p><strong>Related post<\/strong>: <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">15 Myths You Should Stop Believing in 2019<\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">Don&#8217;t want to get hacked, follow these 21 cyber security tips<\/a>. Here are two main threats to watch out for.&nbsp;<\/p>\n\n\n\n<h3>Top 2 Threats to Using Wi-Fi<\/h3>\n\n\n\n<h3>1. The Evil Twin<\/h3>\n\n\n\n<p>Simply, it’s a network that looks just like the regular Wi‐Fi network at your favourite café. Only once you’re connected, the hacker who created the network is able to monitor every move you make. <\/p>\n\n\n\n<p>They’ll be looking out for sensitive information like login details, bank accounts, and credit card information.<\/p>\n\n\n\n<p><strong>Read more:&nbsp;<\/strong><a href=\"https:\/\/it360.co.nz\/blog\/developing-online-security-and-mobile-risk-awareness-in-your-organisation\/\" target=\"_blank\" rel=\"noreferrer noopener\">Developing online security and mobile risk awareness in your business<\/a><\/p>\n\n\n\n<h3>2. The ‘War Driver’<\/h3>\n\n\n\n<p>The issue with common WiFi networks is that anyone can log on. You dont know who you’re sharing a connection with. A hacker can search for devices connected to the same network and intercept data being exchanged across it.<\/p>\n\n\n\n<p>If your business has an open Wi‐Fi network, it’s possible for someone to get within range and intercept company emails. They might also be able to connect to your local network and search through your computers for business documents.<\/p>\n\n\n\n<p>These aren’t theoretical issues. While sitting in a coffee shop in 2014, a couple logged onto the public network and transferred a six‐figure sum into a term deposit account. A ‘war driver’ found their account details, and an email with a signed employment contract attached. Using both, the hacker impersonated them and cleaned out the account.<\/p>\n\n\n\n<p>In this case, the Banking Ombudsman found the bank’s online security was also lacking, and ordered them to repay the couple, but you may not be so lucky.<\/p>\n\n\n\n<p>You don’t have to give up on public Wi‐Fi altogether. There are <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">measures you can take to protect yourself and your company data<\/a>. <\/p>\n\n\n\n<h2>Two Tips to Use Wireless Technology Safely<\/h2>\n\n\n\n<h3>Tip #1: Use a VPN<\/h3>\n\n\n\n<p>The easiest solution is a VPN or virtual private network. A VPN can be used on any device to form a secure connection between it and the internet, encrypting all transferred information. If you accidentally connect to an ‘Evil Twin,’ the encryption prevents the hacker from accessing your data.<\/p>\n\n\n\n<p>It’s important to research VPN providers before signing up. All your data is being transferred through them, so they could steal all your information as easily as any hacker. Trust and reputation is important.<\/p>\n\n\n\n<h3>Tip #2: Use a Wi-Fi Password and Change It Regularly<\/h3>\n\n\n\n<p>Put a password on your office Wi‐Fi network and change it regularly. It might be annoying for you and your team, but it’s far less annoying than all of your sensitive files ending up in public. <\/p>\n\n\n\n<p>It’s also worth looking at a firewall to monitor incoming and outgoing traffic through your network. A firewall will let you know if someone is trying to force their way in, and if you need to boost security even further.<\/p>\n\n\n\n<p>There are risks with any online activity, but a VPN and firewall can help protect you and your business while browsing in public.<\/p>\n\n\n\n<p><strong>Keen to understand more about Cyber Security in the Workplace? <a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\">Download our latest eBook &#8211; it&#8217;s FREE<\/a>!<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/cyber-security-CTA-1024x512.png\" alt=\"Download the Guide to Cyber Security in the Workplace eBook\" class=\"wp-image-6708\" title=\"\"><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Chances are you have already used Wi‐Fi today. It’s become a fundamental part of being connected, both literally and figuratively. It’s essential for the family around home, getting work done at the office, and deciding where to have your coffee break. If you want to get work done away from the office, public Wi‐Fi networks [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2835,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[18],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2370"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2370"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2370\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2835"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2370"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2370"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2370"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}