{"id":2372,"date":"2018-05-24T21:02:41","date_gmt":"2018-05-24T09:02:41","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2372"},"modified":"2019-12-21T20:22:06","modified_gmt":"2019-12-21T08:22:06","slug":"safety-and-online-security-in-the-internet-of-things-iot","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/safety-and-online-security-in-the-internet-of-things-iot\/","title":{"rendered":"Safety and Online Security in the Internet of Things (IoT)"},"content":{"rendered":"\n<p>The Internet of Things is emerging all around us. This machine-­to-­machine communication is no longer a plotline from The Jetsons but one built on cloud technology and a network of data-gathering sensors.<\/p>\n\n\n\n<p>From our TV, fridge, car and electricity meter, more technology is connecting online. The IoT allows multiple objects to communicate instantly and gather data, essentially giving the machine a brain that holds information and uses it efficiently to fulfil a function.<\/p>\n\n\n\n<p>For example, some Australian tollbooths are now cashless and unmanned. A sensor in your car communicates with the tollbooth, calculates your fare, subtracts the sum from a nominated account and emails you a receipt.<\/p>\n\n\n\n<p>Another example of IoT is the rise of the Fitbit. A watch that measuring heartbeats and movement to calculate how many steps you have taken, and sends your progress to your smartphone and an online account. The IoT can allow your watch to communicate with other devices making it easy to track your fitness and compare activity levels over time.<\/p>\n\n\n\n<p>The rise of this “Smart” technology, with the potential to send an infinite amount of data brings its own very real <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">online security risks<\/a>.<\/p>\n\n\n\n<p>The Internet of Things essentially functions on it’s own. Harmless in Fitbits, and making life easier by speeding up traffic through toll roads. Collecting personal information licence plates and locations without the driver’s consent seems trivial until we consider the possibility of this technology being manipulated by those with the power, knowledge and access to do so. It poses the potential, as with all cloud networks containing data, the ability to be hacked.<\/p>\n\n\n\n<p>It’s predicted a quarter of a billion vehicles will be connected to the internet by 2020, which is great for providing Wi­Fi hotspots, connecting SatNavs and entertainment features. It also allows people anywhere in the world to find your car’s IP address,&nbsp;<a href=\"https:\/\/www.wired.com\/2015\/07\/hackers-remotely-kill-jeep-highway\/\" target=\"_blank\" rel=\"noopener\">remotely hack your car<\/a>&nbsp;and take complete control.<\/p>\n\n\n\n<p>As hackers track your car’s GPS, they could shut you down and lock the doors in a remote location, only returning control when money is wired to their account.<\/p>\n\n\n\n<p>The Internet of Things brings many benefits and drawbacks. It increases the efficiency of some machines, minimises human error and has the potential to save lives! The parking sensors on some cars communicate with the brakes and will automatically if a driver gets too close to a stationary object. Like anything connected to the internet, we must consider the potential for this delicate and data­sensitive system to be manipulated, and put extra security in place. We may not live in a world with flying cars and robots that make us breakfast, but even The Jetsons would be impressed by the capabilities of the Internet of Things.<\/p>\n\n\n\n<p>So what does this mean for the business world? Basically more security risks, as outlined in this&nbsp;<a href=\"https:\/\/idealog.co.nz\/tech\/2016\/04\/internet-things-go-bleep-night\" target=\"_blank\" rel=\"noreferrer noopener\">Idealog article<\/a>.<\/p>\n\n\n\n<p>“A few years ago I heard an IBM presentation describing a near future where we wouldn’t need keys, swipe cards, passwords and so forth. Everything; our house, our car, workplace, computer systems, POS terminals and the like, would know who we are and simply make available everything we had access permissions for. I love the idea in theory, but a rather horrifying thought occurred to me even then; wouldn’t that mean it was possible just to ‘switch someone off’, revoking their access to everything?”<\/p>\n\n\n\n<p>And for now we will leave you there, pondering the future possibilities of this technology.<\/p>\n\n\n\n<p><strong>Keen to understand more about Cyber Security in the Workplace? <a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\">Download our latest eBook &#8211; it&#8217;s FREE<\/a>!<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/cyber-security-CTA-1024x512.png\" alt=\"Download the Guide to Cyber Security in the Workplace eBook\" class=\"wp-image-6708\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>The Internet of Things is emerging all around us. This machine-­to-­machine communication is no longer a plotline from The Jetsons but one built on cloud technology and a network of data-gathering sensors. From our TV, fridge, car and electricity meter, more technology is connecting online. The IoT allows multiple objects to communicate instantly and gather [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2840,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,37,33],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2372"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2372"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2372\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2840"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2372"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2372"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2372"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}