{"id":2374,"date":"2018-05-05T21:05:34","date_gmt":"2018-05-05T09:05:34","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2374"},"modified":"2019-12-15T19:28:39","modified_gmt":"2019-12-15T07:28:39","slug":"stop-making-these-5-it-mistakes-in-your-business","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/stop-making-these-5-it-mistakes-in-your-business\/","title":{"rendered":"Stop Making These 5 IT Mistakes in Your Business"},"content":{"rendered":"\n<p>When you have an ever-growing list of things to do for your business, it can be hard to give technology the attention it deserves.  But there are some simple IT mistakes you could be making &#8211; costing your  company more than you realise. <\/p>\n\n\n\n<h2>5 IT Mistakes You Should Avoid<\/h2>\n\n\n\n<h3>1. Lack of knowledge<\/h3>\n\n\n\n<p>In a lot of small-to-medium-sized businesses, IT is often looked after by someone who isn’t necessarily an expert, and this can be challenging for a variety of reasons. Without the right knowledge, dealing with issues is time-consuming and unproductive,  with frustration for both the person responsible for trying to find a solution and the employee who is unable to continue working until the problem is resolved. There is also a risk that further complications may arise from incorrect management of any IT issues. <\/p>\n\n\n\n<p><strong>Read more: <\/strong><a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/it360.co.nz\/blog\/how-do-i-find-the-right-level-of-services-for-my-it-budget\/\" target=\"_blank\">How to find the right level of services for your IT budget<\/a><\/p>\n\n\n\n<h3>2. The wrong ISP\/Internet provider<\/h3>\n\n\n\n<p>Thinking that connecting to an ISP is a simple process, which you ‘set and forget’, is wrong. Like any <a href=\"https:\/\/it360.co.nz\/blog\/what-to-expect-from-outsourced-it-are-you-getting-bang-for-your-buck\/\">outsourced provider<\/a>,  it requires management and review to ensure you are getting the correct service. Many businesses will often just select an ISP thinking that they are all pretty similar in their offering, however that isn’t always the case.  It is important to have the right connection to meet the requirements of your organisation, and getting an understanding of your needs might not be a priority of all ISPs. But if your connection keeps dropping out because the usage on it is too high, then that will have <a href=\"https:\/\/it360.co.nz\/blog\/why-you-must-measure-it-productivity-in-your-business\/\">dire results for the productivity levels<\/a> of your business. And if you are paying for more than your small business comes close to requiring, then that is a cost you could reduce. <\/p>\n\n\n\n<h3>3. Using old\/out-dated software<\/h3>\n\n\n\n<p>There are the <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">obvious risks<\/a> that come with using old\/out-dated software and hardware, which include slow response times, a lag between programmes, and the possibility it will just stop working at any time. But on a different level, it could also put you behind your competitors,  particularly if they are able to provide a better service to customers because of the newer technology they have in place. <\/p>\n\n\n\n<h3>4. Email<\/h3>\n\n\n\n<p>Email is both a blessing and a curse – of course, it allows for <a href=\"https:\/\/it360.co.nz\/blog\/7-reasons-to-use-collaboration-tool-for-your-business\/\">ease of communication<\/a>, but it also has the ability to take over people’s working day, causing interruptions and reducing productivity. However it isn’t about taking away emails (could you imagine?), it is about working smarter, not harder, to have a company-wide policy when it comes to helping employees deal with their inboxes. <\/p>\n\n\n\n<p>The great thing is, there are now plenty of applications that can easily assist with filtering emails and helping you to become more efficient with managing them – and this <a href=\"https:\/\/mashable.com\/2012\/07\/31\/email-overload-tips\/\" target=\"_blank\" rel=\"noopener\">article from Mashable<\/a> has plenty of tips to help you on your journey to becoming less tied down to your inbox. <\/p>\n\n\n\n<h3>5. IT problems causing interruptions<\/h3>\n\n\n\n<p>Here’s an interesting statistic from the University of California – a  study found that while a typical office worker gets only 11 minutes between each interruption, it then takes an average of 25 minutes to return to the original task. So how does this relate to technology? <\/p>\n\n\n\n<p>If there are issues or problems with IT in your business, which continually disrupt your employee’s working day, then you could be losing a lot more than just that initial downtime. And how is not a real, tangible pitfall for your organisation? &#8212;- <strong>Keen to understand more about Cyber Security in the Workplace? <a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\">Download our latest eBook &#8211; it&#8217;s FREE<\/a>!<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/cyber-security-CTA-1024x512.png\" alt=\"Download the Guide to Cyber Security in the Workplace eBook\" class=\"wp-image-6708\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>When you have an ever-growing list of things to do for your business, it can be hard to give technology the attention it deserves. But there are some simple IT mistakes you could be making &#8211; costing your company more than you realise. 5 IT Mistakes You Should Avoid 1. Lack of knowledge In a lot of [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2873,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[38],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2374"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2374"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2374\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2873"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}