{"id":2395,"date":"2018-04-24T21:11:12","date_gmt":"2018-04-24T09:11:12","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2395"},"modified":"2020-01-18T22:10:52","modified_gmt":"2020-01-18T10:10:52","slug":"why-you-should-set-kpis-for-your-it-company","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/why-you-should-set-kpis-for-your-it-company\/","title":{"rendered":"Why You Should Set KPIs for Your IT Company"},"content":{"rendered":"\n<p><a href=\"https:\/\/it360.co.nz\/blog\/why-you-must-measure-it-productivity-in-your-business\/\">Fast, streamlined and efficient IT systems<\/a> underpin most successful, modern businesses. As a result, your IT provider often feels less like an external agency, and more like part of your team.<\/p>\n\n\n\n<p>Chances are you speak to them multiple times a week, if not a day! Therefore it makes sense to put processes in place to manage and nurture this key professional relationship.<\/p>\n\n\n\n<p>It is good business practice to set KPIs you can both agree on, ensuring that expectations are met on both sides. This way, you can measure which processes work well and which ones require some adjustment. As the old saying goes, “if you can’t measure it, you can’t manage it”.<\/p>\n\n\n\n<p><strong>Read more:<\/strong>&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/how-to-recognise-its-time-for-your-business-to-outsource-it\/\" target=\"_blank\" rel=\"noopener noreferrer\">How to recognise it&#8217;s time for your business to outsource IT&nbsp;<\/a><\/p>\n\n\n\n<p>Setting KPIs will help you work together as a team to tackle IT challenges as they arise. It will also go a long way to minimise the risk of confusion or conflict. Problems will be solved swiftly and professionally, creating a harmonious work environment for all involved.<\/p>\n\n\n\n<p>Every business is different, so the KPIs you choose will likely be unique to your requirements and objectives. However, below are three common KPIs which apply to most industries and business types. These are a good place to start.<\/p>\n\n\n\n<p>And if you already have an existing IT provider, you can <a href=\"https:\/\/it360.co.nz\/blog\/what-to-expect-from-outsourced-it-are-you-getting-bang-for-your-buck\/\">perform an audit<\/a> by following these steps.<\/p>\n\n\n\n<h2>3 KPIs You Should Set With Your IT Provider<\/h2>\n\n\n\n<h3>1. Response time and communication<\/h3>\n\n\n\n<p>This is a great KPI as it’s an opportunity for you and your IT provider to set some ground rules for general communication. Together, agree on reasonable response times, so you’ll know how long it will take to receive a reply to requests. This will save you calling every five minutes for an update (which is time-consuming for both parties), and ensure you have realistic expectations.<\/p>\n\n\n\n<p>You might want to set several ‘response time categories’. For example, urgent requests may require a 5-hour response time, while non-urgent requests may be handled within two days.<\/p>\n\n\n\n<p>While on the topic of communication, you should also check with your IT provider as to the best way to contact them when there’s a problem. For example, do they prefer a phone call, an email or that you lodge a ticket via a software system?<\/p>\n\n\n\n<p>By acknowledging their preferred method of communication, you are more likely to get prompt, efficient service.<\/p>\n\n\n\n<h3>2. Average time spent from initial request to final resolution<\/h3>\n\n\n\n<p>This KPI measures the average length of time it takes for your IT provider to resolve your requests. As your requests will most likely vary widely, you will probably need to measure this KPI for several months before you can establish a fair, accurate turnaround time to aim towards.<\/p>\n\n\n\n<p>This is also a good opportunity to agree on how your IT provider should inform you about the resolution process. For example, you could request a time estimate at the outset of every project, or perhaps agree to speak on the phone once a week to monitor progress. Again, it’s all about <a href=\"https:\/\/it360.co.nz\/blog\/8-questions-to-ask-when-choosing-a-new-it-provider\/\">managing expectations and keeping the lines of communication open<\/a>.<\/p>\n\n\n\n<h3>3. Error rate and\/or security incidents<\/h3>\n\n\n\n<p>No IT provider is perfect, and every now and then mistakes do occur. When you’re setting KPIs, discuss the likelihood of errors, security incidents and other slip-ups so you know what to expect. If mistakes do occur, put processes in place to handle these in an effective, professional manner.<\/p>\n\n\n\n<p>By discussing possible ‘worst-case-scenarios’ ahead of time, it means you will be prepared in the event something does go wrong – even if the chances of this happening are slim.<\/p>\n\n\n\n<h3><strong>Remember: Put KPIs in Writing<\/strong><\/h3>\n\n\n\n<p>Don’t forget to formalise these KPIs by putting them in writing and having all involved parties sign. When you sign a contract with an IT company, you should receive a <strong>service level agreement<\/strong> (SLA) which outlines the work they will be providing; this is a good place to add the KPIs.<\/p>\n\n\n\n<p>&#8212;&#8212;<\/p>\n\n\n\n<p><strong>Keen to understand what is big for IT this year?&nbsp;Download:&nbsp;<\/strong><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><strong>An essential guide to IT for SME business &#8211; Risk, Security and Productivity<\/strong><\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/lp\/it-guide-sme-business\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/An-essential-guide-CTA-1024x512.png\" alt=\"Download the Essential Guide to IT for SME Businesses\" class=\"wp-image-6699\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Fast, streamlined and efficient IT systems underpin most successful, modern businesses. As a result, your IT provider often feels less like an external agency, and more like part of your team. Chances are you speak to them multiple times a week, if not a day! Therefore it makes sense to put processes in place to [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2909,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[12],"tags":[39,25],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2395"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2395"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2395\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2909"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2395"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2395"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2395"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}