{"id":2552,"date":"2019-01-29T16:58:53","date_gmt":"2019-01-29T04:58:53","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2552"},"modified":"2022-06-12T11:10:08","modified_gmt":"2022-06-11T23:10:08","slug":"15-cybersecurity-myths-business-owners-should-leave-behind","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/","title":{"rendered":"15 Cyber Security Myths Business Owners Should Leave Behind"},"content":{"rendered":"\n<p><a class=\"rank-math-link\" href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">Cyber security is a topic that is often taken for granted by small- and medium-sized businesses in New Zealand. It’s one of those things that is often put in the back burner along with other “important but not urgent” projects. <\/a><\/p>\n\n\n\n<p>Other business owners seem to shrug this off as a low priority in their never-ending issues to tackle. After all, there are a lot of areas where your time will be of better use. <\/p>\n\n\n\n<p>Who has time to deal with cyber security, right? <\/p>\n\n\n\n<p>Marketing, sales, operations, supply chain, and pitching to investors — all these are areas where you can make a  significant impact. Ever hear yourself saying, “we’re just a small business, no one would hack us”? While all these might be true, most of these are based on some unfounded belief about cyber security. <\/p>\n\n\n\n<p>Let’s take a look at these 15 cyber security myths that you should leave behind this year. <\/p>\n\n\n\n<h2>15 Cybersecurity Myths Business Owners Should Leave Behind<\/h2>\n\n\n\n<h3>1. SMBs aren’t targeted by hackers<\/h3>\n\n\n\n<p>According to a study by the Ponemon Institute,  about 70% small and medium businesses have been targeted a cyber attack. So, while you may think that you won’t be targeted by an attack,  consider this. The <a href=\"https:\/\/www.ncsc.govt.nz\" target=\"_blank\" rel=\"noopener\">National Cyber Security Centre<\/a> defines two types of cyberattacks: direct and indirect threats. <\/p>\n\n\n\n<ol><li><strong>Direct threats<\/strong> have a specific and deliberate target that they are tailored to exploit. For example, a hacker would specifically target a bank in NZ to extract credit card information,  etc.<\/li><li><strong>Indirect threats<\/strong> are indiscriminate and delivered widely. Some call this the “spray and pray” method where automated scripts\/software scan the internet to look for vulnerabilities to exploit. The most common in this group are <a href=\"https:\/\/info.it360.co.nz\/lp\/organisation-phishing-targets\/\">email phishing<\/a> where the hacker will pretend to be someone or from a well-known brand, then asks you to send them money or log in a site (where they now “know” your username\/password).<\/li><\/ol>\n\n\n\n<h3>2. Only certain industries are vulnerable to cyber attacks<\/h3>\n\n\n\n<p>Business owners think that since they do not have an Ecommerce website or not in the tech or finance industry, they won’t be a target. But as mentioned above, most cyber attacks aren’t targeted. <\/p>\n\n\n\n<p><strong>If you use the internet, you’re at risk.<\/strong> <\/p>\n\n\n\n<p>Don’t think that what gets shared on the media is an equal representation of what’s really happening out there. Don’t think that the high profile hacks\/data breaches you see\/hear in the news are all that’s happening. <\/p>\n\n\n\n<p>According to the <a href=\"https:\/\/enterprise.verizon.com\/resources\/reports\/dbir\/\" target=\"_blank\" rel=\"noopener\">2018 Verizon Data Breach Investigations Report<\/a>, <strong>58% of data breach victims are small businesses.  <\/strong><\/p>\n\n\n\n<h3>3. Antivirus \/ anti-malware software is enough \/ software will protect your server<\/h3>\n\n\n\n<p>While antivirus\/anti-malware software can protect you from most attacks, it’s not perfect. <strong>No software is perfect<\/strong>. <\/p>\n\n\n\n<p>These antivirus software rely on a database to check for viruses,  malware, adware, etc. on your devices. So, if a new kind of malicious program isn’t in the database, your software won’t probably notice it. <\/p>\n\n\n\n<p>In addition, if one of your employees downloads and installs — whether that&#8217;s accidentally or not — some malware into your system, your antivirus software won’t be of use. These antivirus and anti-malware software are only the first line of defence of your organization from cyber threats. <\/p>\n\n\n\n<h3>4. Cyber security threats come from the outside<\/h3>\n\n\n\n<p>Cybersecurity threats don’t always come from the outside. In fact, it’s even harder to track those coming from your own organization. <\/p>\n\n\n\n<p>According to a study, around <a href=\"https:\/\/securityintelligence.com\/news\/insider-threats-account-for-nearly-75-percent-of-security-breach-incidents\/\" target=\"_blank\" rel=\"noopener\">75% of security breaches come from internal your organization<\/a>.  <\/p>\n\n\n\n<p>Disgruntled employees, former employees, etc. can have reasons to get back at your organization. There are even some cases where happy employees become the cause of a  data breach. <\/p>\n\n\n\n<p>See myth #7. <\/p>\n\n\n\n<p>This is why an IT policy and proper <a href=\"https:\/\/it360.co.nz\/blog\/5-ways-to-communicate-cyber-security-with-staff\/\">cyber security training<\/a> is important to ensure that passwords are changed when an employee leaves, their access are removed, etc. <\/p>\n\n\n\n<h3>5. Cyber security is IT’s problem\/responsibility<\/h3>\n\n\n\n<p>Most NZ business owners aren’t IT or technical in nature. So, you shouldn’t worry about cyber security and protecting your data, right? <\/p>\n\n\n\n<p>You probably already know the answer here. <\/p>\n\n\n\n<p>In fact, <a href=\"https:\/\/securitybrief.co.nz\/story\/logrhythm-announces-eight-cybersecurity-predictions-for-2019\" target=\"_blank\" rel=\"noopener\">one of the predictions made by LogRhythm for 2019<\/a>  is that the CEO will be held accountable to cyber breaches this year, instead of the CIO or CISO. <\/p>\n\n\n\n<p>In small businesses, the CEO\/President is usually you, the owner. <strong>Cyber security is everyone’s responsibility<\/strong>. <\/p>\n\n\n\n<p>While IT may decide on what hardware\/software to use to protect your data, ultimately, it falls on everybody’s shoulders. No amount of hardware\/software will protect you if your employees themselves continue clicking links from people they don’t know or installing software they just downloaded from the internet. <\/p>\n\n\n\n<h3>6. Our wi-fi has a strong password, so it’s secure<\/h3>\n\n\n\n<p>Wi-fi passwords only limit the number of people\/devices who can use your internet. But once they get in, it still has the same risks as someone who uses the internet. <\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/01\/personal-laptop-1024x683.jpg\" alt=\"personal devices aren&#039;t safe\" title=\"\"><\/figure>\n\n\n\n<h3>7. I don’t need to “secure” my personal devices at work<\/h3>\n\n\n\n<p>Today, because there’s a <a href=\"https:\/\/it360.co.nz\/blog\/blurring-between-social-and-work-life-requires-new-cyber-security-monitoring\/\">blur between our personal and work lives<\/a>, we send\/receive and do work-related stuff on our personal devices. Without a proper IT Policy or a Bring Your Own Device (BYOD) policy, your employees might assume their personal devices are not subject to any of the cyber security restrictions you might (or might not) have. <\/p>\n\n\n\n<p>But this is one of the ways hackers actually get in the business. <\/p>\n\n\n\n<p>Most people don’t think about their personal devices since they wrongly think that the won’t be targeted. What happens is that your employees bring in an infected device and uses it at work — whether that’s their own mobile phones or USB devices.  Then, once they connect it to their computers, the malware spreads.  Business and other consumer data can be obtained by the hacker. <\/p>\n\n\n\n<h3>8. Complete cyber security can be achieved<\/h3>\n\n\n\n<p>With hackers getting more sophisticated, the question you should be asking yourself is not whether you will be attacked or not; rather, you should be thinking about when and what will you do after you get attacked. <\/p>\n\n\n\n<p>What if your website goes down? Do you have a plan to get it back up and running in a few hours, rather than days? <\/p>\n\n\n\n<p>Imagine Amazon’s website crashing. No one can buy, no one can sell. According to Time, Jeff Bezos earns  ~$11.5 million an hour. So, if Amazon gets attacked and they don’t have a  plan to get it up and running in place, they’d be losing a huge amount of money. <\/p>\n\n\n\n<h3>9. Cyber crime is mostly about credit card fraud (or money)<\/h3>\n\n\n\n<p>Cyber security threats aren’t just about money. <\/p>\n\n\n\n<p>Any “data” can be compromised, and therefore, affect the way you run your business. For example, you’re in manufacturing and you also sell directly to the consumer. Imagine your server being compromised and couldn’t access it.  Even if you can produce your products, you won’t be able to deliver them to your customers because the data is inaccessible. <\/p>\n\n\n\n<h3>10. “Cyber risk” is a separate category of risk<\/h3>\n\n\n\n<p>Treating cyber risk as a separate category of risk puts your business at risk. <\/p>\n\n\n\n<p>Treat it exactly as what it is — risk. <\/p>\n\n\n\n<p>If you’re in the food industry, there are lots of risks of food-borne illnesses. That’s why there are controls and standards to avoid these kinds of risks. If you’re using heavy equipment, there are risks of getting injured or cutting your limbs. <\/p>\n\n\n\n<p>That’s why there are safety standards developed for these activities so you can avoid losing your limbs (or your life). In today’s world, technology permeates every aspect of our lives. This is why you should treat cybersecurity the same way you treat other risks, and develop a plan of action to safeguard your organization. <\/p>\n\n\n\n<h3>11. Protecting yourself is good enough<\/h3>\n\n\n\n<p>Businesses rely on other businesses to operate. This means no matter how secure or safe your systems and protocols are, but your vendor isn’t following some sort of standard, you might get hacked as well. <\/p>\n\n\n\n<p>For example, the Facebook-Cambridge Analytica data scandal that blew up last year wasn’t necessarily Facebook’s doing. While it can be argued that Facebook could have done more to protect its users&#8217; data, but ultimately it wasn’t them that collected, shared, and abused the data. Start thinking upstream and downstream your organization’s value chain. <\/p>\n\n\n\n<h3>12. Going back to paper minimizes risk<\/h3>\n\n\n\n<p>Reverting back to offline\/traditional operations might minimize your risk of cyber attacks, but you also lose the ability to monitor everything. <\/p>\n\n\n\n<p>For example, you won’t know if someone has made extra copies or destroyed important documents. In addition, going back to paper increases inefficiency. Just think of how this affects the way you work. No internet! <\/p>\n\n\n\n<h3>13. Cyber security is a form of defence (cost centre)<\/h3>\n\n\n\n<p>Before writing off that cyber security is just another expense you should  cut from your expenses, take a look at these two statistics according  to IBM: <\/p>\n\n\n\n<ol><li>The average cost of a data breach is $3.86 million or 5.75 million NZD.<\/li><li>The average cost fo each lost or stolen record containing sensitive or confidential information is $148 or 220 NZD.<\/li><\/ol>\n\n\n\n<p>As we’ve already debunked earlier, hacking isn’t just about money. <\/p>\n\n\n\n<p>For some, it’s some form of ideology.<\/p>\n\n\n\n<p>Just recently, a <a href=\"https:\/\/it360.co.nz\/blog\/canva-and-pdl-data-breach-2019\/\">data breach of username and passwords<\/a> was just dumped into the internet. If you’re part of that hack, imagine all the accounts you use your email to log into — social media, finance and banking, and many more. <\/p>\n\n\n\n<p>Now, imagine if that’s your work email, think of the problems that hacker can cause your business. They can penetrate your entire system using your admin privileges. They can send an inappropriate email to your suppliers or customers. They can order accounting to wire money to this account. <\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/01\/google-home-speaker-1024x683.jpg\" alt=\"smart home speaker\" title=\"\"><\/figure>\n\n\n\n<h3>14. New features\/updates of IoT devices are enough<\/h3>\n\n\n\n<p>Updating your devices can reduce your chances of getting hacked, but it’s not enough. Remember, that firmware\/software update can only protect you from current exploits. <\/p>\n\n\n\n<p>Fact is, cyber criminals are getting more sophisticated. So, if they develop a new type of malware, your device (and data) might be at risk. <\/p>\n\n\n\n<p>In addition, the <a href=\"https:\/\/venturebeat.com\/2022\/05\/25\/report-average-time-to-detect-and-contain-a-breach-is-287-days\/\" target=\"_blank\" rel=\"noopener\">average time it takes for a business to know there was a breach is 212 days<\/a> — that’s approximately 5 months. This means you might have already been breached but don&#8217;t know about it. <\/p>\n\n\n\n<h3>15. I don’t store sensitive data so I don’t need cybersecurity<\/h3>\n\n\n\n<p>Everyone stores some form of sensitive data on their devices. You may think of these as only credit card data or your bank’s login information. But any type of information can be used against you. <\/p>\n\n\n\n<p>For example, if you’re not prepared nor have any backups, then a ransomware hits your  laptop, you won’t be able to access any file unless you pay the hacker.  This includes your address book, your photos, your emails, eBooks, and  everything on your computer. <\/p>\n\n\n\n<p>Cyber security may seem like a very complicated topic. It doesn&#8217;t have to be. <\/p>\n\n\n\n<p>Leave these myths behind and start protecting yourself, your business, and your data.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cyber security is a topic that is often taken for granted by small- and medium-sized businesses in New Zealand. It’s one of those things that is often put in the back burner along with other “important but not urgent” projects. Other business owners seem to shrug this off as a low priority in their never-ending [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2562,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,43],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2552"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2552"}],"version-history":[{"count":2,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2552\/revisions"}],"predecessor-version":[{"id":9189,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2552\/revisions\/9189"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2562"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2552"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2552"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2552"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}