{"id":2566,"date":"2019-02-05T11:23:01","date_gmt":"2019-02-04T23:23:01","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2566"},"modified":"2020-01-04T14:56:57","modified_gmt":"2020-01-04T02:56:57","slug":"dont-want-to-get-hacked-follow-these-21-cyber-security-tips","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/","title":{"rendered":"Don’t Want to Get Hacked, Follow These 21 Cyber Security Tips"},"content":{"rendered":"\n<p>Let’s take a look at some disturbing facts:<\/p>\n\n\n\n<ul><li>In 2016, <strong>3 billion Yahoo accounts<\/strong> were hacked.<\/li><li>Also in the same year, Uber reported that hackers stop information of over <strong>57 million riders and drivers<\/strong>.<\/li><li>The Equifax Breach in 2017 affected <strong>147.9 million consumers <\/strong><\/li><li>Last year, 2018, Under Armor reported its My Fitness Pal was hacked, affecting <strong>150 million users<\/strong><\/li><li>Two weeks ago, the <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">Collection #1 data breach<\/a> revealed the username and passwords of <strong>770 million unique email addresses<\/strong><\/li><\/ul>\n\n\n\n<p>These are all examples of <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a> breaches from big brands. If these numbers don’t scare you, it should. All of these numbers affect consumers and end-users like you. If you haven’t already, <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">you should change your passwords right now<\/a>.<\/p>\n\n\n\n<div class=\"toc\">\n<h2>Table of Contents<\/h2>\n<ul>\n<li><a href=\"#general\">General Tips<\/a><\/li>\n<li><a href=\"#internet\">When Connecting to the Internet<\/a><\/li>\n<li><a href=\"#travel\">While Traveling<\/a><\/li>\n<li><a href=\"#home\">At Home<\/a><\/li>\n<li><a href=\"#ecommerce\">Online Shopping<\/a><\/li>\n<li><a href=\"#email\">Using Email<\/a><\/li>\n<\/ul>\n<\/div>\n\n\n\n<p>Now that that’s out of the way, here are a couple of tips to protect yourself and avoid getting hacked.<\/p>\n\n\n\n<h2 id=\"general\">General Tips<\/h2>\n\n\n\n<h3>1. Use a password\/passcode on your devices<\/h3>\n\n\n\n<p>Now this might seem obvious, but a lot of people still don’t have passwords on their devices. If you’ve watched <em>You<\/em> on Netflix, you’d realize that Joe won’t be able to stalk Beth and know what she’s doing, where she is, and who she’s talking to if she used a passcode on her phone.<\/p>\n\n\n\n<p>So, if you don’t have a password on your phone or laptop or tablet, go add one now. You’ll avoid a lot of headaches later on if you lose your device.<\/p>\n\n\n\n<h3>2. Don’t use the same password across your accounts<\/h3>\n\n\n\n<p>People have a tendency to forget stuff that doesn’t make sense to them. This is why we use simple passwords in our accounts, because they are easy to remember.<\/p>\n\n\n\n<p>But this is also one of the reasons why you are at great risk of getting hacked. Take a look at this video of people getting interviewed.<\/p>\n\n\n\n<figure><iframe src=\"https:\/\/www.linkedin.com\/embed\/feed\/update\/urn:li:ugcPost:6492404284917977088\" allowfullscreen=\"allowfullscreen\" width=\"504\" height=\"600\" frameborder=\"0\"><\/iframe><\/figure>\n\n\n\n<p>Since we know that we can’t rely on our memory, we use that same password everywhere else. Imagine if someone got hold of your password — which you use in your email, social media accounts, and even your online banking. What would prevent them from using and abusing them?<\/p>\n\n\n\n<p>The easiest way to remember this is to use a password manager like LastPass or 1Password. All your passwords are stored here, so you only <strong>need to remember one strong password<\/strong> — the password to your password manager. Then, to ensure that you add another layer of protection, use two-factor authentication (or multi-factor authentication).<\/p>\n\n\n\n<h3>3. Use multi-factor authentication (MFA) whenever possible<\/h3>\n\n\n\n<p>Wikipedia defines MFA as “a method of computer access control in which a user is only granted access after successfully presenting several separate pieces of evidence to an authentication mechanism – typically at least two of the following categories: knowledge (something they know); possession (something they have), and inherence (something they are).”<\/p>\n\n\n\n<p>MFA is a way to ensure that not anyone can easily access your accounts.<\/p>\n\n\n\n<p>An example of where you’re already using MFA is when you withdraw money from an ATM. You need your card (something you have) and your PIN (something you know).<\/p>\n\n\n\n<p>But, most of the time, when it comes to our accounts online, we often only rely on our passwords (something we know). So, anyone who knows your password can gain access to any or all of your accounts.<\/p>\n\n\n\n<h4>How multi-factor authentication works:<\/h4>\n\n\n\n<p>Whenever you login to your account with MFA enabled, what happens is you go through the normal username\/password routine. Once you enter your correct password, the account will ask for a set of code from you. Depending on how you set this up, you’ll either get an SMS with the code, or you use an app on your phone to get the code. You then have to enter this code within a few seconds; otherwise, you will need to regenerate another set of code. In some instances, you may also use an actual physical device that gives out the code (like what the app does).<\/p>\n\n\n\n<p>When you use an app to get your code, that’s actually 3 layers of protection already.<\/p>\n\n\n\n<ol><li>Password — something you know<\/li><li>Phone — something you have<\/li><li>PIN \/ access to unlock your phone — something you know (or have in the case of fingerprint or facial recognition)<\/li><\/ol>\n\n\n\n<p>This reduces the likelihood of your accounts being accessed by someone else. For example, someone tried to use the username\/password combination that was revealed in the <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">biggest data breach yet<\/a>.<\/p>\n\n\n\n<p>If you didn’t change your password, anyone could have easily gained access to your account. But if you have MFA enabled, you will receive an SMS, and you’d be notified immediately that someone tried to access your account.<\/p>\n\n\n\n<h3>4. Don’t click on any link\/download files from people you don’t trust<\/h3>\n\n\n\n<p>We firmly believe that people are the last line of defense in protecting yourself from cyber criminals. Technology — both software and hardware — can only do so much. After all, ~<a href=\"https:\/\/www.zdnet.com\/article\/want-to-help-stop-cyber-security-breaches-focus-on-human-error\/\" target=\"_blank\" rel=\"noopener\">47% of data breaches are caused by employees<\/a>; while 96% of all data breaches, people have a minor contributor to the breach.<\/p>\n\n\n\n<p>A lot of times, people with bad intentions can get passed the technology designed to keep us safe. The most prevalent case for this in via email. Someone sends you an email with a link to a website or a file to download.<\/p>\n\n\n\n<p>If you do not know the person or company who sent you that email, mark it directly as spam\/junk mail or delete it right away.<\/p>\n\n\n\n<h3>5. Use an antivirus software regardless of your device (Mac users, I’m talking to you)<\/h3>\n\n\n\n<p>As mentioned above, technology is your friend. You don’t have to fear it. And one of the most important software you need to have installed on your devices is an antivirus software. If you’re using Windows, most computers now come with one — Windows Defender.<\/p>\n\n\n\n<p>But if you’re on Linux or Mac, this is usually something you need to install yourself. There are a lot of free ones out there to get you started. So, before moving to the next tip, I suggest you download one to your device and run a full system scan.<\/p>\n\n\n\n<p>Most Mac users still believe that their system is immune to malware, but that can be further from the truth. While Mac devices often don’t get affected directly by viruses, their device can host these malware, which then can spread to other devices.<\/p>\n\n\n\n<p>For example, you connect a USB device on your infected Mac then use that on your work computer (which runs on Windows). You might think you’re safe since your Mac isn’t affected. But that single act could have planted some sort of malware into your work computer and can affect everyone in the organization.<\/p>\n\n\n\n<p><a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">Related article: 15 Cyber Security Myths Business Owners Should Leave Behind in 2018<\/a><\/p>\n\n\n\n<h3>6. Upgrade your software\/firmware when possible<\/h3>\n\n\n\n<p>Most modern devices have software that makes it run. At home, these would be your phones, computers, routers, and other smart devices you might have — speakers like Alexa, Google Home, or the HomePod; bulbs, outlets, thermostat, and even your garage door.<\/p>\n\n\n\n<p>Whenever updates are made available by the manufacturer of your device, it’s best to upgrade your devices as well. Yes, it’s a hassle especially if there are multiple steps you need to do. Most of the time, these are security updates that reduces vulnerabilities in the previous version of the software.<\/p>\n\n\n\n<p>A lot of modern devices have an automatic update feature enabled. Your laptop or your phones might have these enabled. But some of the hardware at your home might not support this. For example, your home router might be one of them.<\/p>\n\n\n\n<h2 id=\"internet\">When connecting to the internet<\/h2>\n\n\n\n<h3>7. Use a VPN<\/h3>\n\n\n\n<p>Using a virtual private network (VPN) provides you a lot of benefits, but the most noteworthy among them are these two: enhanced security and anonymous browsing.<\/p>\n\n\n\n<p>Let’s say you use the internet on your computer. VPNs provide you additional security by encrypting your data before it gets sent to your router. That means no one can see the information — usernames, passwords, emails, documents, etc.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/www.ibvpn.com\/2010\/02\/8-advantages-of-using-vpn\/\" target=\"_blank\" rel=\"noopener\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/01\/Your-connection-with-VPN-767x1024.png\" alt=\"Connection with and without VPN\" title=\"\"><\/a><\/figure>\n\n\n\n<p>Then, what happens is your router connects to your internet service provider (ISP). The second benefit kicks in here since the ISP can’t know what you do. There’s actually a second layer of benefit with anonymous browsing — you can get pass geo-restrictions.<\/p>\n\n\n\n<p>We’ll talk about that some other time. But what that means is, let’s say you watch a lot of Netflix. There are some shows that are not available\/restricted to the location of your ISP. VPNs allow you to use a different IP address so it looks like you’re at, for example London, when you’re really in Auckland.<\/p>\n\n\n\n<h3>8. Always logout of your accounts if you’re sharing your computer\/public computer<\/h3>\n\n\n\n<p>In cases where you need to access your accounts at a public computer, remember to always sign out afterwards.<\/p>\n\n\n\n<h3>9. Permanently delete all files you downloaded in public computers<\/h3>\n\n\n\n<p>And if you downloaded something to that computer, don’t forget to delete it permanently as well. Remember, when you delete something, it puts the file in the recycle bin (Windows) or Trash (Mac).<\/p>\n\n\n\n<ul><li>To delete a file permanently in Windows, select the file(s) then press <strong>shift + delete<\/strong>.<\/li><li>To delete a file permanently in Mac, select the file(s) then press <strong>option + command + delete<\/strong>.<\/li><\/ul>\n\n\n\n<p>In both cases, you’ll be asked if you want to delete the file permanently. Go ahead and choose yes.<\/p>\n\n\n\n<p>Of course, you can always go inside the recycle bin\/trash and delete it there yourself, but that route takes longer because you have to search for the file first before you can delete it.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/traveling-with-devices-1024x576.jpg\" alt=\"protect yourself from being hacked while traveling\" title=\"\"><\/figure>\n\n\n\n<h2 id=\"travel\">While traveling<\/h2>\n\n\n\n<p>When you’re traveling, especially to a different country, remember to follow the same guidelines as above. Below are a few additional tips to avoid getting your information stolen.<\/p>\n\n\n\n<h3>10. Avoid online banking<\/h3>\n\n\n\n<p>As much as possible, avoid logging in to your bank’s accounts. Make sure you <strong>bring enough cash<\/strong> with you so you don’t have to keep using your credit cards then end up having to check your transactions.<\/p>\n\n\n\n<h3>11. Connect only to trusted networks, if possible<\/h3>\n\n\n\n<p>If you absolutely must, only connect to networks that you trust. If you have data roaming, you can use that. This reduces your risk of anyone spying on what you do.<\/p>\n\n\n\n<p>Of course, if you’re using a VPN already, then you don’t have to worry about any of this. Just make sure no one can view what you’re typing on your screen.<\/p>\n\n\n\n<h3>12. Use your own internet connection, like your phone’s data\/pocket wifi vs a public wifi<\/h3>\n\n\n\n<p>If you don’t have data roaming, an option you might want to go for is get a pocket wi-fi so you can access the internet.<\/p>\n\n\n\n<h2 id=\"home\">At home<\/h2>\n\n\n\n<p>One of the biggest mistakes you can do is to think that you are not at risk at home. While we hear big named brands in the news getting hacked or information stolen, you may not think that that affects you. But in reality, the data that gets stolen are information about consumers and end-users — that’s you.<\/p>\n\n\n\n<p>So, the next time you get back home, follow these simple tips to protect yourself.<\/p>\n\n\n\n<h3>13. Use a strong password<\/h3>\n\n\n\n<p>While we mentioned passwords earlier, this one bears repeating.<\/p>\n\n\n\n<p>Often, home wifi passwords use a person’s mobile phone number or birthday. While it’s relatively better than using the worst passwords of all time — “password” or “12345678” — it’s still not enough.<\/p>\n\n\n\n<p>And while we’re on the topic of passwords, make sure you actually do have a password. We strongly recommend a unique password so people can’t just access your internet.<\/p>\n\n\n\n<h3>14. Upgrade your router’s firmware<\/h3>\n\n\n\n<p>Did you know that <a href=\"https:\/\/threatpost.com\/threatlist-83-of-routers-contain-vulnerable-code\/137966\/\" target=\"_blank\" rel=\"noopener\">83% of routers contain vulnerabilities<\/a>?<\/p>\n\n\n\n<p>In other words, you’re most likely using a router at home that can be easily hacked. If you have CCTVs or speakers connected to it, the hacker can easily watch and listen to you.<\/p>\n\n\n\n<p>Just like any other technological device, your home router runs on some sort of software\/firmware. Occasionally, manufacturers release an update that either makes your connection better or provide further security.<\/p>\n\n\n\n<p>Whatever that reason is, if there’s a new update available, you should go ahead and install it.<\/p>\n\n\n\n<h3>15. Upgrade any IoT device (Google Home, Alexa, Home Pod, etc)<\/h3>\n\n\n\n<p>This falls under the same risks and concerns as upgrading your router. For every smart device, you give it permission to access your home router. If there are vulnerabilities in the device, hackers can get in your network and steal your information.<\/p>\n\n\n\n<h3>16. Change the credentials of your router’s admin section<\/h3>\n\n\n\n<p>Lastly, the most important thing you need to do at home is to change the credentials of your router’s admin settings. It’s the area where you can change your wifi password,<\/p>\n\n\n\n<p>If you do a quick Google search, the most common username\/password combinations your router is public. For example, Linksys routers usually have an “blank”\/admin combination.<\/p>\n\n\n\n<p>If you don’t change this, the least damaging thing that can happen to you is your neighbor can get access to your internet — for free. But if someone with malicious intent gets in your network, they can potentially steal your credit card information, copy your data, monitor your usage, watch you on your webcam, listen to you on your devices, and many more.<\/p>\n\n\n\n<h2 id=\"ecommerce\">Buying something on the internet<\/h2>\n\n\n\n<p>Buying something on the internet is becoming one of the most common activity we do online. According to NZHerald, <a href=\"https:\/\/www.nzherald.co.nz\/retailing\/news\/article.cfm?c_id=77&amp;objectid=12042091&amp;ref=rss\" target=\"_blank\" rel=\"noopener\">NZ spends $3.724b annually in online retail<\/a>. So, it’s only fitting that we include specific tips for for Ecommerce.<\/p>\n\n\n\n<h3>17. Look for the SSL icon (green lock icon at the top of your browser)<\/h3>\n\n\n\n<p>When you buy from a website, always look for the SSL icon at the top of your browser. SSL stands for Secure Sockets Layer.<\/p>\n\n\n\n<p>There’s no need to go into the technical details of how SSL works. What matters is that SSL protects you by hiding(encrypting) the information you enter on your web browsers like credit card details and your address before it gets sent to the website itself.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/ssl-on-website.gif\" alt=\"\" title=\"\"><\/figure>\n\n\n\n<h3>18. Buy only from trusted sites<\/h3>\n\n\n\n<p>Even if a website has SSL installed (that green padlock), it can still lead to someone trying to steal your information. According to PhishLabs, a phishing research and defense firm, about <a href=\"https:\/\/info.phishlabs.com\/blog\/quarter-phishing-attacks-hosted-https-domains\" target=\"_blank\" rel=\"noopener\">25% of phishing sites have SSL installed<\/a>.<\/p>\n\n\n\n<p>Continuing from above, if a site has SSL, anyone who might try to steal your information while being transmitted from your browser to the website won’t be able to.<\/p>\n\n\n\n<p>But, if that data you entered goes directly to someone who plans to use it for their personal gain, then you still won’t be protected.<\/p>\n\n\n\n<p>Remember, a green padlock indicating a site is secured doesn’t mean the person\/brand behind it will respect and protect your privacy and data. So, only buy from trusted sites.<\/p>\n\n\n\n<h2 id=\"email\">Using email<\/h2>\n\n\n\n<p>Email is still the most frequently used communication around the world. It’s also where majority of scams and viruses happen. Follow these tips to avoid getting hacked or scammed.<\/p>\n\n\n\n<h3>19. If someone asks you to wire some money to a certain account, run away the other direction<\/h3>\n\n\n\n<p>If anyone sends you an email asking for money, this should raise a red flag, especially if it’s someone you don’t know.<\/p>\n\n\n\n<p>It’s one of the ways hackers trick people into sending them sensitive information or getting money directly.<\/p>\n\n\n\n<h3>20. If the email asks you to click on a link and asks for your username AND password, don’t do it.<\/h3>\n\n\n\n<p>Think about it. Why would a friend, a big corporation, or a family member ask you for your username and password? Unless you’re really helping out someone with their account, no one will ask you for these credentials. So, if you receive an email asking for these (or SMS, or from one of the hundreds of messaging apps out there), don’t do it.<\/p>\n\n\n\n<h3>21. Check if the person\/company who sent the email is really who they are<\/h3>\n\n\n\n<p>If you think that email might actually come from someone you know or from an organization, there are a lot of ways to verify if the person requesting for information from you is someone you know or someone pretending to be them.<\/p>\n\n\n\n<h4>1. Click on their name to display their email address<\/h4>\n\n\n\n<p>Doing this will display their email address. If it looks something like sdgfhkbjsdkjfs@hotmail.com vs johnsmith@gmail.com, then it’s someone just trying to pretend to be them.<\/p>\n\n\n\n<p>Don’t reply, nor engage with the email. Mark it as spam\/junk, or delete it altogether.<\/p>\n\n\n\n<p>Unless, of course, you know what you’re doing.<\/p>\n\n\n\n<h4>2. Open the browser URL directly, not click on the link<\/h4>\n\n\n\n<p>If it came from a brand\/organization, it’s best to open a browser directly and type in the URL instead of clicking on the link.<\/p>\n\n\n\n<p>If the link in the email is different from the one where you typed the address directly on your browser, then that email is most likely a scam. You can check the link in the email by hovering your mouse on it and the URL will be displayed.<\/p>\n\n\n\n<p>Cyber security doesn’t have to be daunting. The more we rely on the internet, the more we have to protect ourselves from people who try to take advantage of others.<\/p>\n\n\n\n<p>Don’t be a victim.<\/p>\n\n\n\n<p>Follow these simple tips when using the internet, while travelling, at home, at work, and when using email.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Let’s take a look at some disturbing facts: In 2016, 3 billion Yahoo accounts were hacked. Also in the same year, Uber reported that hackers stop information of over 57 million riders and drivers. The Equifax Breach in 2017 affected 147.9 million consumers Last year, 2018, Under Armor reported its My Fitness Pal was hacked, [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2578,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,47],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2566"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2566"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2566\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2578"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2566"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2566"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2566"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}