{"id":2602,"date":"2019-02-12T09:28:47","date_gmt":"2019-02-11T21:28:47","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2602"},"modified":"2022-06-12T11:11:06","modified_gmt":"2022-06-11T23:11:06","slug":"mounting-security-complexity","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/mounting-security-complexity\/","title":{"rendered":"Mounting Security Complexity"},"content":{"rendered":"\n<p>Have you ever imagined going through one day without internet?<\/p>\n\n\n\n<p>From the moment you wake up until you go back to sleep, you don’t have an internet connection. You can’t check your email and social media accounts. You can’t chat with your colleagues. You can’t do a video conference with them. You can’t even access all your files and important documents because they are all stored in the cloud.<\/p>\n\n\n\n<p>As a business owner, it’s almost impossible to go through one day without connecting to the internet. Apart from your email and social media accounts, you also have your work apps and tools that helps with efficiency and productivity.<\/p>\n\n\n\n<p>For example, a retailer will have the POS software connected to the eCommerce site. If the POS can’t connect to the eCommerce site, a customer might order an item that is out of stock because someone already bought it in the store.<\/p>\n\n\n\n<p>Or let’s say you want to log\/track\/manage your expenses, how can you do that when your data is in the cloud? How would you check if your bank has enough cash to pay off a vendor? How can you disburse payroll? All these are real-world scenarios and <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">why cyber security is important for your business<\/a>.&nbsp;<\/p>\n\n\n\n<p>As you might have already realized, the internet (or the ability to connect to it) is essential to modern businesses like yours.<\/p>\n\n\n\n<h2>The Internet Makes Businesses More Efficient and Productive<\/h2>\n\n\n\n<p>One of the ways the internet helps businesses be more efficient is the ability to store files in the cloud. With this, anyone on your team can access them whenever and wherever they are.<\/p>\n\n\n\n<p>And as the modern workforce is becoming more mobile (and even global in some cases), businesses will continue relying on the internet (or software or tools or apps that connects to the internet).<\/p>\n\n\n\n<p>This includes storing data (Dropbox, Google Drive, OneDrive), collaborating with each other through a variety of apps\/software (Google Docs, Trello, Asana), and communication software (Skype, MS Teams, Slack).<\/p>\n\n\n\n<p>All these rely on the internet to work. It may still work while offline, but it will only have limited functionality.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/coworking-space-1024x683.jpg\" alt=\"coworking space\" title=\"\"><\/figure>\n\n\n\n<h3>Hyperconnectivity Is Causing Problems for Businesses<\/h3>\n\n\n\n<p>However, this hyperconnectivity has brought about a lot of problems. Before going through these problems, take a look at this brief history of businesses.<\/p>\n\n\n\n<h3>Brief history of business<\/h3>\n\n\n\n<p>As you may probably know, modern society has gone through three distinct eras or periods of time: agriculture, industrial, and knowledge.<\/p>\n\n\n\n<p>Now is the age of knowledge — where what you know matters more than anything else. Knowledge has become the global currency of 21st century economies.<\/p>\n\n\n\n<p>Knowledge workers (people whose output of work is based on what they know) are the 3rd wave of human socio-economic development.<\/p>\n\n\n\n<p>According to <a href=\"https:\/\/en.wikipedia.org\/wiki\/Knowledge_worker#cite_note-15\" target=\"_blank\" rel=\"noopener\">Charles Savage<\/a>, most of the world’s population will be distributed by the type of work they do:<\/p>\n\n\n\n<ul><li>2% of working population will work on land (agriculture)<\/li><li>10% will work in industry<\/li><li>Rest will be knowledge workers<\/li><\/ul>\n\n\n\n<h3>Why and how this is important<\/h3>\n\n\n\n<p>The glue that holds modern businesses is its <strong>ability to connect with each other <\/strong>and parts of the business through the internet. This has led to the modern workforce scattered across the country (or the world) and created an army of on-the-go entrepreneurs.<\/p>\n\n\n\n<p>These “knowledge workers” often use the internet to get their work done. Just like the examples earlier, if you cannot connect to the internet, it’s almost impossible to get work done.<\/p>\n\n\n\n<p>This makes the internet paramount to the productivity and success of modern businesses. But this has also created a wide range of problems.<\/p>\n\n\n\n<p>Given that the internet is public — no one “owns” it — there’s a growing need for businesses and individuals alike to to protect your data and other sensitive information.<\/p>\n\n\n\n<h2>Statistics and Reality of Cyber Crimes<\/h2>\n\n\n\n<p>According to a report by HP, <a href=\"https:\/\/securitybrief.co.nz\/story\/almost-half-of-nz-businesses-unprepared-for-data-breaches\" target=\"_blank\" rel=\"noopener\">nearly half of New Zealand Businesses aren’t prepared for a Cyber Attack<\/a>. If that doesn’t scare you, did you know that <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">70% small and medium businesses have been targeted a cyber attack<\/a>?<\/p>\n\n\n\n<p>&#8220;The consequences of a data breach are severe; from financial to brand and reputation damage,” says Grant Hopkins, managing director at HP New Zealand.<\/p>\n\n\n\n<p>There are a lot of different kinds of cyber attacks. According to Hiscox, an insurance company, the most common cyber attacks are the following:<\/p>\n\n\n\n<ol><li><strong>IP theft<\/strong> &#8212; robbing companies of their ideas and inventions<\/li><li><strong>Phishing<\/strong> &#8212; fraudulently pretending to be someone else<\/li><li><strong>Denial of service<\/strong> &#8212; flooding the target with traffic triggering a crash<\/li><li><strong>Ransomware<\/strong> &#8212; locking a computer system until a ransom is paid<\/li><\/ol>\n\n\n\n<p>If you don’t think this affects you, take a look at this video where they replicated how a cyber attack would happen in real-life.<\/p>\n\n\n\n<figure><iframe src=\"https:\/\/www.youtube.com\/embed\/Y1b8865GOHU\" allowfullscreen=\"allowfullscreen\" width=\"560\" height=\"315\" frameborder=\"0\"><\/iframe><\/figure>\n\n\n\n<h2>Top Two Problems When You Can’t Access Your Organization’s Data<\/h2>\n\n\n\n<h3>Problem 1: Without the ability to access your data, your organization stops working<\/h3>\n\n\n\n<p>If you and your employees can’t connect to the internet or access your data, your organization stops working.<\/p>\n\n\n\n<p>Denial of service — one of the most common cybercrime. It can be as “simple” as not being able to access your website (i.e. they changed some files and redirected it to a page that says you’ve been hacked); or causing your web host (and therefore your website) to crash; or not being able to access any files from your servers (ransomware, where you need to pay a certain amount to get the decryption key).<\/p>\n\n\n\n<h3>Problem 2: If organizational data gets breached\/stolen, it can cost a huge amount of money and create animosity in the eyes of your customers<\/h3>\n\n\n\n<p>Getting hacked or getting your data breached\/leaked is one of the things that seems to keep resurfacing in the news every week.<\/p>\n\n\n\n<p>Last January, one of the biggest Cryptocurrency wallet Cryptopia was hacked which led them to lose an estimated $2.5m to 3.5m. A few days later, the <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">Collection #1 breach<\/a> was leaked to the public.<\/p>\n\n\n\n<p>It’s just a few weeks in 2019, these types of news won’t stop soon. With estimates that cyber attacks this year will only increase.<\/p>\n\n\n\n<h3>Costs of Cyber Attacks You’re Probably Not Aware Of<\/h3>\n\n\n\n<p>Two things happen when your business in involved in a data breach:<\/p>\n\n\n\n<ol><li>You lose revenues<\/li><li>You spend more<\/li><\/ol>\n\n\n\n<p>The first downside of getting breached is you lose the trust of your customers (and would-be customers). This leads to lost revenues for your business. Apart from that, you’d have to spend more to recover what was lost in terms of salaries and fees, not to mention the penalties you may pay.<\/p>\n\n\n\n<p>Remember the Equifax Breach of 2017? After a few months, <a href=\"https:\/\/www.reuters.com\/article\/us-equifax-cyber-idUSKCN1GE257\" target=\"_blank\" rel=\"noopener\">Reuters reported that breach-related costs will reach $439M by the end of 2018<\/a>. And this still doesn’t involve money they lost from drops in their stocks, or lost of revenues from their customers.<\/p>\n\n\n\n<p>According to the 2018 Cost of a Data Breach Study, the <a href=\"https:\/\/www.ibm.com\/security\/data-breach\" target=\"_blank\" rel=\"noopener\">average cost for each lost or stolen record<\/a> containing sensitive and confidential information is $148. But with organizations storing thousands (or millions of data), that could add up quickly.<\/p>\n\n\n\n<p>The other cost of a cyber attack is that you spend more to recover the data\/information that were stolen. If you’re not prepared, this means hiring security experts that charge you a higher fee because of the urgency\/emergency situation.<\/p>\n\n\n\n<p>With lost revenues and added costs, that puts a big dent on your company’s profits. And if you’re a small business without deep pockets, a cyber attack might put you out of business.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/multi-factor-authroization-with-physical-key-1024x683.jpg\" alt=\"multi factor authroization with physical key\" title=\"\"><\/figure>\n\n\n\n<h2>Solution: Extra Vigilance and Continuous Education<\/h2>\n\n\n\n<h3>1. Educate yourself and your organization in online security<\/h3>\n\n\n\n<p>The only way to prevent and avoid getting hacked is to educate not only yourself, but also your employees.<\/p>\n\n\n\n<p>First, as a business owner, you should <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">stop believing in these 15 myths about cyber security<\/a>. Next, don’t assume that your employees are aware and familiar with cyber security. Here are <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">21 cyber security tips<\/a> you and your employees can read to avoid getting hacked.<\/p>\n\n\n\n<p>And that’s just the start.<\/p>\n\n\n\n<p>Cyber criminals are becoming smarter. They can bypass any software and go undetected for long periods of time — allowing them time to inflict real damage to your business. According to the same IBM report, it takes an average of 197 days to detect\/identify a data breach.<\/p>\n\n\n\n<p>The longer the time it takes for an organization to identify and contain the breach, the higher the costs associated with it.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“If the average time to identify a breach (MTTI) was under 100 days, the estimated average total cost of a data breach was $3.11 million. If it was over 100, the estimated cost was $4.21 million, representing $1.1 million additional cost.”<\/p><p>&#8211; 2018 Cost of a Data Breach Report<\/p><\/blockquote>\n\n\n\n<p>The best way to avoid a data breach is to educate yourself and your organization about it. We came up with a free 4-day email bootcamp on passwords. You can click here to enroll (or ask your employees to enroll in them too).<\/p>\n\n\n\n<h3>2. Implement a cyber security program\/policy that covers prevention\/cure (i.e. what to do to avoid getting hacked and what to do when you get hacked)<\/h3>\n\n\n\n<p>As businesses rely more on the internet, it’s important that everyone in your company is aware of its risks — both personally and professionally.<\/p>\n\n\n\n<p>Below are some steps you can do to ensure that your business will remain vigilant of cybercrime:<\/p>\n\n\n\n<h4>Tip #1: Include cyber security as part of onboarding new employees<\/h4>\n\n\n\n<p>Never assume that your employees — especially new ones — are aware of the risks of using the internet.<\/p>\n\n\n\n<p>Remember that <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">47% company breaches are caused by employees<\/a>; and people have a contribution to 96% of all data breaches. So, make sure you educate your new employees on best practices and ways to avoid getting hacked.<\/p>\n\n\n\n<h4>Tip #2: Frequent training \/ education for current employees<\/h4>\n\n\n\n<p>One of the best way to ensure your employees don’t forget about the risks of using the internet, or retain their knowledge in cyber security, it’s best to include frequent reminders about the topic.<\/p>\n\n\n\n<p>You can start with a simple company newsletter every month, then some sort of quiz, or a company webinar that you can conduct live then store it in a company site for employees to watch later on.<\/p>\n\n\n\n<p>Here are some topics you can cover:<\/p>\n\n\n\n<ul><li>Common scams\/phishing methods<\/li><li>New developments<\/li><li>Protection of personal devices (esp. at home)<\/li><\/ul>\n\n\n\n<p>An example of this <a href=\"https:\/\/it360.co.nz\/blog\/5-ways-to-communicate-cyber-security-with-staff\/\">continuous education<\/a> is the email series on passwords. We’re coming up with more topics like those in the future. If you want to receive or more information about that, just let us know here.<\/p>\n\n\n\n<p>One important reminder as you think of topics and content for your organization is to make sure the individual can relate to it.<\/p>\n\n\n\n<p>Instead of just talking about potentially losing millions of $, you can talk about losing their entire savings account; or in the case of privacy concerns, their private photos or messages can be leaked.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever imagined going through one day without internet? From the moment you wake up until you go back to sleep, you don’t have an internet connection. You can’t check your email and social media accounts. You can’t chat with your colleagues. You can’t do a video conference with them. You can’t even access [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2604,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,33],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2602"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2602"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2602\/revisions"}],"predecessor-version":[{"id":9190,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2602\/revisions\/9190"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2604"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2602"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2602"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}