{"id":2621,"date":"2019-02-19T09:02:00","date_gmt":"2019-02-18T21:02:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=2621"},"modified":"2022-06-12T11:12:36","modified_gmt":"2022-06-11T23:12:36","slug":"protect-yourself-online-by-focusing-on-these-two-things","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/protect-yourself-online-by-focusing-on-these-two-things\/","title":{"rendered":"Protect Yourself Online by Focusing on These Two Things"},"content":{"rendered":"\n<p><a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">Protecting yourself on the internet<\/a> is important now more than ever. With just a few weeks in 2019, there are already dozens of news on different kinds of cyber crimes — from data breaches, ransomware, theft, and many more. And don’t expect these things to stop anytime soon.<\/p>\n\n\n\n<p>As we rely more on the internet on a daily basis, it’s paramount that we know how to protect ourselves from people who are looking to exploit others.<\/p>\n\n\n\n<p>If you care about protecting your privacy and other sensitive information, this article is for you.<\/p>\n\n\n\n<h2>Relying on Technology Alone Isn’t Enough to Protect You Online<\/h2>\n\n\n\n<p>First thing’s first, let’s define what technology means.<\/p>\n\n\n\n<p>To keep things simple, technology means both hardware (physical products) and software.<\/p>\n\n\n\n<p>Remember, no piece of technology will be 100% perfect. All of these are made by humans that’s why they cannot be without fault.<\/p>\n\n\n\n<h3>Example 1: When Hardware Fails<\/h3>\n\n\n\n<p>Home and business routers get slammed on a regular basis for exploits that get discovered. Because routers are not patched (or even secure, they keep the default username and password of Admin \/ Admin), they are vulnerable to hacks. Home routers more than business routers, but both if they are not constantly patched and checked.<\/p>\n\n\n\n<p>Below is a screenshot from one of our engineer’s home network. Take note that he does have his own business-grade firewall at home which is more secure. It also gives reports on what’s happening behind the scenes (i.e. someone trying to hack your router).<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/home-router-exploit-1024x318.png\" alt=\"home router exploits\" title=\"\"><\/figure>\n\n\n\n<p>As you can see in the highlighted example, port 7547 was tried over 137 times which is <a href=\"https:\/\/securityintelligence.com\/mirai-evolving-new-attack-reveals-use-of-port-7547\/\" target=\"_blank\" rel=\"noopener\">this exploit<\/a>.<\/p>\n\n\n\n<p>You will also notice other ports that were tried within a time span of 4 minutes.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The sad part to this is that my ISP (which normally provides your home or default business router) doesn’t assist me in preventing any of these attacks. Even reporting back to them and giving them my logs, nothing is done. They do not feature in the security side of it all, so if you as the home or business owner don’t secure yourself &#8211; no one will.<em>&nbsp;<\/em><\/p><cite><a href=\"https:\/\/www.linkedin.com\/in\/pieter-van-zyl-97855947\/\" target=\"_blank\" rel=\"noopener\">Pieter van Zyl<\/a><\/cite><\/blockquote>\n\n\n\n<h3>Example 2: When Software Fails<\/h3>\n\n\n\n<p>A common example where software fails us is on email. Just take a look at your junk\/spam folder. Our email provider’s spam filters catch most of these emails, but sometimes some come through our inboxes.<\/p>\n\n\n\n<p>And if you aren’t aware of these phishing scams, you might accidentally install some malware on your computer, or fill-out a form with your information (like username\/password).<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/apple-id-phishing-email-1024x758.png\" alt=\"apple id email phishing\" title=\"\"><\/figure>\n\n\n\n<h2>You’re the Last Line of Defense<\/h2>\n\n\n\n<p>When technology fails to protect us, the last line of defence against cyber criminals is yourself.<\/p>\n\n\n\n<p>Remember the saying, “if there’s a will, there’s a way”? What that means is these cyber criminals are constantly trying to find ways to navigate around known security protocols to get your information and private data.<\/p>\n\n\n\n<p>If you see an email in your inbox like the one above, what would you do?<\/p>\n\n\n\n<p>Would you panic, click on the link, and enter your credentials? Or would you simply ignore it and mark the email as spam\/junk?<\/p>\n\n\n\n<h3>When Ignorance Isn’t Bliss<\/h3>\n\n\n\n<p>We’re a huge advocate of multi-factor authentication (MFA). Basically, after entering your password, you get asked for a code to enter.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/02\/MFA-in-action-1024x491.png\" alt=\"MFA in action\" title=\"\"><\/figure>\n\n\n\n<p>The example above uses an app to generate the code required in the right-hand image. There’s another type where an SMS is sent to your mobile number and that’s what you use instead.<\/p>\n\n\n\n<p>But, did you know that <a href=\"https:\/\/www.zdnet.com\/article\/new-tool-automates-phishing-attacks-that-bypass-2fa\/\" target=\"_blank\" rel=\"noopener\">two-factor authentication (2FA) via SMS is not as secure<\/a> as you think?<\/p>\n\n\n\n<p>Polish researcher <a href=\"https:\/\/twitter.com\/drk1wi\" target=\"_blank\" rel=\"noopener\">Piotr Duszyński<\/a> just published a program <a href=\"https:\/\/github.com\/drk1wi\/Modlishka\" target=\"_blank\" rel=\"noopener\">named Modlishka on GitHub<\/a> where a hacker can potentially gain access to your account despite having 2FA enabled?<\/p>\n\n\n\n<p>When asked why the programmer made the program public, his answer might surprise you.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;We have to face the fact that without a working proof of concept, that really proves the point, the risk is treated as theoretical, and no real measures are taken to address it properly,&#8221; he said. &#8220;This status quo, and lack of awareness about the risk, is a perfect situation for malicious actors that will happily exploit it.&#8221;<\/p><cite>Piotr Duszyński<\/cite><\/blockquote>\n\n\n\n<h3>Awareness and Continuous Education Is the Answer<\/h3>\n\n\n\n<p>In cases where technology fails us, you’re the only one who can prevent your data and other sensitive information from getting stolen.<\/p>\n\n\n\n<p>Read up on <a href=\"https:\/\/it360.co.nz\/blog\/mounting-security-complexity\/\">common cyber security threats<\/a> that you may face in your daily lives. Here’s a list of the most common ones:<\/p>\n\n\n\n<ol><li><strong>IP theft<\/strong>&nbsp;— when individuals\/organizations steal your ideas then launch products\/services before you do<\/li><li><strong>Phishing<\/strong>&nbsp;— this is where you receive an email that asks you to go to a link, download and install something, or fill-up a form. Also, remember that this isn’t limited to email. It can happen via SMS, a tweet, or any communication channel.<\/li><li><strong>Denial of service<\/strong>&nbsp;— where you can&#8217;t access your website\/server<\/li><li><strong>Ransomware<\/strong>&nbsp;— locking a computer system until a ransom is paid<\/li><\/ol>\n\n\n\n<p>Or the easiest way to stay updated on these things is to enrol in our special email series where we discuss these topics and how you can protect yourself online.<\/p>\n\n\n\n<p>The first one we released is on the topic of passwords. If you want to learn more about <a href=\"https:\/\/info.it360.co.nz\/lp\/anti-password-nirvana\/\">using passwords in all your accounts<\/a> — email, social media, work and productivity apps — to avoid getting hacked, just head on over here.<\/p>\n\n\n\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Protecting yourself on the internet is important now more than ever. With just a few weeks in 2019, there are already dozens of news on different kinds of cyber crimes — from data breaches, ransomware, theft, and many more. And don’t expect these things to stop anytime soon. As we rely more on the internet [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2635,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,55,56,36],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2621"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=2621"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2621\/revisions"}],"predecessor-version":[{"id":9192,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/2621\/revisions\/9192"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/2635"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=2621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=2621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=2621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}