{"id":285,"date":"2018-10-07T00:31:21","date_gmt":"2018-10-06T12:31:21","guid":{"rendered":"http:\/\/it360.marcomworks.com\/?p=285"},"modified":"2022-06-12T11:36:06","modified_gmt":"2022-06-11T23:36:06","slug":"icloud-hacking-not-just-for-celebrities","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/icloud-hacking-not-just-for-celebrities\/","title":{"rendered":"iCloud Hacking: Not Just for Celebrities"},"content":{"rendered":"\n<p>In&nbsp;<a href=\"https:\/\/www.wired.com\/2016\/01\/apple-sold-a-record-number-of-iphones-but-just-barely\/\" target=\"_blank\" rel=\"noopener\">January 2016<\/a>, Apple revealed that 1 billion people are using its services, such as iTunes and the App store. This statistic includes iPhone, iPad, Apple TV, Mac, and Apple Watch users. Think about that number for a second. 1 billion people. That’s an enormous amount of the world’s population.<\/p>\n\n\n\n<p>Over the years Apple has earned a reputation for being less vulnerable to hacks and <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a> threats when compared to other products, but security breaches do happen from time to time.<\/p>\n\n\n\n<p>iCloud hacking is a real threat and can have real consequences.<\/p>\n\n\n\n<p>In 2014, this lesson was learned the hard way by celebrities such as Jennifer Lawrence and Kate Upton, whose photos were leaked by an anonymous iCloud hacker. If a celebrity’s account can be breached, so can yours.<\/p>\n\n\n\n<h3>So what can you do to avoid an iCloud hack?<\/h3>\n\n\n\n<p>The most important thing is to <strong>protect your Apple ID<\/strong>. <\/p>\n\n\n\n<p>As Apple users will know, your Apple ID is essentially your own personal identification code when using Apple products. It allows you to make purchases, send messages, access iCloud data, and more. <\/p>\n\n\n\n<p>If your Apple ID is compromised, hackers will have access to your personal information, not to mention they may shop up a storm in iTunes or the App Store.<\/p>\n\n\n\n<h2>4 Ways a Hacker Could Obtain Your Apple ID:<\/h2>\n\n\n\n<h3>1. Password hack<\/h3>\n\n\n\n<p><strong>Weak or obvious passwords<\/strong> are more susceptible to attacks. Be sure to use a unique password and do not reveal it to anyone. It’s also worth noting that if you use the same password across multiple accounts, and one of your accounts is compromised, then the hacker could go after your Apple ID next.<\/p>\n\n\n\n<p>Want to find out if your password is weak or strong? Try <a href=\"https:\/\/howsecureismypassword.net\/\" target=\"_blank\" rel=\"noopener\">entering it here<\/a>. <\/p>\n\n\n\n<p>Now, what did it say? <\/p>\n\n\n\n<p>How long will it take for a computer to crack your password? Seconds? months? years? <\/p>\n\n\n\n<p>Try entering a couple more of your passwords to find out which ones are easy for hackers to crack. If the password you use is easy to crack, please change it now. Most likely, that password has been <a href=\"https:\/\/it360.co.nz\/blog\/discover-email-addresses-used-in-dark-web\/\">circulating the dark web<\/a> already. <\/p>\n\n\n\n<div class=\"toc\">\n<p>Want to learn how you can protect your passwords? Enroll in our free 4-day email series where we shared everything you need to know to protect your passwords from hackers. <\/p>\n<script async data-uid=\"ae70475494\" src=\"https:\/\/it360-limited.ck.page\/ae70475494\/index.js\"><\/script>\n<\/div>\n\n\n\n<h3>2. Phishing scam<\/h3>\n\n\n\n<p>A <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/#phishing\">phishing<\/a> scam is when someone contacts you, usually via email, appearing to be an Apple employee or representative. Often these emails will direct you towards a fake website. <\/p>\n\n\n\n<p>If you enter your details on this fake website, then your Apple ID will likely be hacked.<\/p>\n\n\n\n<h3>3. Someone you know<\/h3>\n\n\n\n<p>It’s easier to think of hackers as mysterious enemies on the internet, but sometimes people in your network may be the culprit. If someone has physical access to your Apple device, they could install malicious software. <\/p>\n\n\n\n<p>Try to limit the number of people who can access your phone (ideally, you should be the only one using it), and be careful not to leave it unattended in public spaces).<\/p>\n\n\n\n<p>We went through this briefly in another article: <a href=\"https:\/\/it360.co.nz\/blog\/what-happens-when-you-get-hacked\/\">what exactly happens when you get hacked<\/a>.<\/p>\n\n\n\n<h3>4. Theft<\/h3>\n\n\n\n<p>Of course, another major risk is theft. If your Apple product is stolen, take steps to lock down or deactivate the advice as soon as possible. There’s always a chance that it could have been stolen by a hacker who is using it to access your personal information.<\/p>\n\n\n\n<p>As you can see, there are several incidences where your Apple ID – and therefore your iCloud – could be vulnerable to attack. <\/p>\n\n\n\n<p>The key thing to remember is: <strong>don’t be complacent<\/strong>. <\/p>\n\n\n\n<p>Just because your Apple product isn’t susceptible to the same viruses as your Windows products doesn’t mean it can’t be breached.<\/p>\n\n\n\n<p>Make sure you take advantage of all the security features Apple provides, such as two-step verification and lock codes. Apple releases these security features for a reason – follow security best practice to protect your privacy and avoid iCloud hacks.<\/p>\n\n\n\n<p><strong>Business leaders need to realise that cyber security is a big deal. It affects reputation, internal communication and even company culture.&nbsp;Keen to understand more about Online Security Protection for New Zealand businesses? <a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\" target=\"_blank\" rel=\"noreferrer noopener\" label=\" (opens in a new tab)\">Download our latest eBook &#8211; it&#8217;s FREE!<\/a><\/strong><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/11\/6c40c185-709f-4f9a-ba8b-8c975714a1d9-300x150.png\" alt=\"\" class=\"wp-image-2259\" width=\"400\" height=\"200\" title=\"\"><\/a><\/figure><\/div>\n","protected":false},"excerpt":{"rendered":"<p>In&nbsp;January 2016, Apple revealed that 1 billion people are using its services, such as iTunes and the App store. This statistic includes iPhone, iPad, Apple TV, Mac, and Apple Watch users. Think about that number for a second. 1 billion people. That’s an enormous amount of the world’s population. Over the years Apple has earned [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":286,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,26,41,42,43],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/285"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=285"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/285\/revisions"}],"predecessor-version":[{"id":9196,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/285\/revisions\/9196"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/286"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=285"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=285"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=285"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}