{"id":288,"date":"2018-10-07T00:35:20","date_gmt":"2018-10-06T12:35:20","guid":{"rendered":"http:\/\/it360.marcomworks.com\/?p=288"},"modified":"2022-06-12T11:36:06","modified_gmt":"2022-06-11T23:36:06","slug":"cyber-security-threats-dont-let-lack-of-knowledge-hurt-your-business","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/cyber-security-threats-dont-let-lack-of-knowledge-hurt-your-business\/","title":{"rendered":"Cyber Security Threats: Don&#8217;t Let Lack of Knowledge Hurt Your Business"},"content":{"rendered":"\n<p><a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">Cyber security<\/a> is just as important as the physical locks and alarms around your home – if not more so. A hacker can do untold damage to your business and brand, resulting in far more stress than a stolen TV or missing jewellery. So how can you protect yourself against online threats?<\/p>\n\n\n\n<h2>How to Avoid Cyber Security Threats<\/h2>\n\n\n\n<h3>Stay up-to-date with the latest news and knowledge<\/h3>\n\n\n\n<p>Many savvy business owners inform themselves about&nbsp;<a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\">cyber security<\/a>&nbsp;by attending courses (or sending employees on their behalf) and reading the latest cyber security news. While these courses are often extremely helpful and informative, the problem is that the <strong>knowledge gained only lasts so long<\/strong>.<\/p>\n\n\n\n<p>Just as technology itself evolves every week, cyber security does too. This means that once the course finishes, you will be missing out on the latest news and information from the industry. Staying informed about threats is like keeping up with the latest viral social media trends – you have to be watching it every single day (or at the very least, every week).<\/p>\n\n\n\n<h3>How to keep up with the latest cyber security threats<\/h3>\n\n\n\n<p>There are a few great ways to keep yourself informed about the latest updates. For example, you can sign up to thought leaders in the field of cyber security.&nbsp;<a href=\"https:\/\/www.darkreading.com\/\" target=\"_blank\" rel=\"noopener\">Dark Reading<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.securityweek.com\/\" target=\"_blank\" rel=\"noopener\">Security Week<\/a>&nbsp;are both good online sources of regular news and commentary. Many of these sources even offer regular email updates so you can access the most important news straight from your inbox.<\/p>\n\n\n\n<p>Another good option is to check to see if your IT security company offers regular newsletters, reports, or other resources. The&nbsp;<a href=\"https:\/\/www.watchguard.com\/wgrd-resource-center\" target=\"_blank\" rel=\"noopener\">WatchGuard resource centre<\/a>&nbsp;is a perfect example of where you can find webinars, whitepapers, and other up-to-date pieces of information that will help keep you and your team on top of security. These options are great for the latest news, but they can also help fill any gaps in your knowledge that you may not have already covered, or that you may have forgotten.<\/p>\n\n\n\n<p>Or, if you just want to receive these topics directly, you can enroll in our cyber security email series. The first topic we covered is on passwords. Just enter your email in the form below and you&#8217;ll start receiving the first email right away!&nbsp;<\/p>\n\n\n\n<h3>The importance of having a ‘plan B’<\/h3>\n\n\n\n<p>While keeping yourself, or your IT staff, as informed as possible about cyber security, threats, trends, and the latest news, it’s vital to have a ‘plan B’. After all, it’s extremely tough to stay on top of everything when you have countless other areas to keep on top of, such as marketing and customer service.<\/p>\n\n\n\n<p>That plan B should be a cyber security company in which you have total confidence when it comes to keeping you informed, and being proactive about existing and new cyber security threats or concerns. This way, should your sales targets, busy periods and personal hurdles come in between you and staying on top of IT issues, you know your business’ assets and information are still as safe as houses (or indeed, safer).<\/p>\n\n\n\n<p><strong>Business leaders need to realise that cyber security is a big deal. It affects reputation, internal communication and even company culture. Keen to understand more about Online Security Protection for New Zealand businesses? <a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\">Download our latest eBook &#8211; it&#8217;s FREE!<\/a><\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/online-security-CTA-1024x512.png\" alt=\"Download the Online Security for New Zealand Businesses eBook\" class=\"wp-image-6707\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Cyber security is just as important as the physical locks and alarms around your home – if not more so. A hacker can do untold damage to your business and brand, resulting in far more stress than a stolen TV or missing jewellery. So how can you protect yourself against online threats? How to Avoid [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":289,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,32],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/288"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=288"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/288\/revisions"}],"predecessor-version":[{"id":9197,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/288\/revisions\/9197"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/289"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=288"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=288"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=288"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}