{"id":294,"date":"2018-10-07T00:39:07","date_gmt":"2018-10-06T12:39:07","guid":{"rendered":"http:\/\/it360.marcomworks.com\/?p=294"},"modified":"2022-06-12T11:36:08","modified_gmt":"2022-06-11T23:36:08","slug":"5-ways-to-communicate-cyber-security-with-staff","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/5-ways-to-communicate-cyber-security-with-staff\/","title":{"rendered":"5 Ways to Communicate Cyber Security with Staff"},"content":{"rendered":"\n<p>With security threats evolving at a rapid place, organisations must regularly communicate with their employees about potential risks, and educate them about cyber security best practices.<\/p>\n\n\n\n<p>Whether they mean to or not, employees pose a huge threat to <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a>. According to <a href=\"https:\/\/media.scmagazine.com\/documents\/82\/ibm_cyber_security_intelligenc_20450.pdf\" target=\"_blank\" rel=\"noopener\">research by IBM<\/a>, an astounding <strong>95% of cyber security incidents<\/strong> can be traced back to human error. An organisation’s best line of defence is to address this ‘human factor’, rather than to rely solely on technology to safeguard against hackers.<\/p>\n\n\n\n<p>WIth that in mind here are five ways to keep the lines of communication open.<\/p>\n\n\n\n<h2>5 Ways to Communicate Cyber Security to Employees<\/h2>\n\n\n\n<h3>1. Send regular cyber security updates (via email)<\/h3>\n\n\n\n<p>Ensure security is at the forefront of your employee’s minds by sending cyber security emails on a regular basis. Try to make these interesting and informative, with <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">practical tips<\/a> for staying secure. If possible, these emails should be informed by your IT department, but written by your marketing team (to ensure they are clear, concise and easy-to-read).<\/p>\n\n\n\n<p>Another tip is to send these emails at the same time every week, month or quarter. This way, your employees will know when to expect them (and hopefully set some time aside in their schedule to bring themselves up to speed).<\/p>\n\n\n\n<p>Have team leaders quiz staff about the contents of each email, to make sure everyone is reading them, not just moving them to the trash folder.<\/p>\n\n\n\n<h3>2. Create cyber security KPIs<\/h3>\n\n\n\n<p>Incorporate cyber security into employee performance reviews. Staff will likely be more motivated to abide by cyber security rules if they know it will have a direct impact on their performance.<\/p>\n\n\n\n<p>This strategy is&nbsp;<a href=\"https:\/\/www.itnews.com.au\/news\/put-cybersecurity-on-staff-kpis-former-cia-tech-boss-418358\" target=\"_blank\" rel=\"noopener\">strongly supported by former CIA chief technology officer Bob Flores<\/a>. Speaking at an IT event in Melbourne earlier this year, he said:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“Everyone in the company should have, as part of their performance evaluation, how they treat security. Employees have to be educated about security, and they have to be educated again and again and again. You can’t do it once as they come into the organisation, they have to learn about it until they retire.”<\/p><cite>Bob Flores, former CIA CTO<\/cite><\/blockquote>\n\n\n\n<p>Some examples of cyber security KPIs include the number of websites blocked, percentage of virus incidents, and the percentage of spam emails detected.<\/p>\n\n\n\n<h3>3. Hold regular training sessions<\/h3>\n\n\n\n<p>Run regular workshops about <a href=\"https:\/\/info.it360.co.nz\/lp\/cyber-security-workplace\/\">cyber security in the workplace<\/a>. These could be facilitated by your IT department, or in smaller companies, by an external IT agency. Whether you have the budget for a 1-hour presentation or a 1-day interactive workshop, every effort counts.<\/p>\n\n\n\n<p>The aim is to keep cyber security top-of-mind for all your employees and to foster a culture of being informed and well-educated. Investing in training sessions is a way to show your employees that cyber security is more than just ‘talk’; that it’s a top priority within your organisation.<\/p>\n\n\n\n<h3>4. Encourage questions and feedback<\/h3>\n\n\n\n<p>There is a lot of fear surrounding cyber security, but try your best not to let this permeate your organisation. While your employees should take cyber security seriously, if they are too scared to ask questions this could cause them to make more mistakes.<\/p>\n\n\n\n<p>Cyber security is a challenging topic, and many people may find it tough to get their head around. Encourage people to ask questions and submit feedback. You could even create a system where people can submit anonymous enquiries. Try to develop a culture based on trust and communication as opposed to fear.<\/p>\n\n\n\n<h3>5. Make cyber security information impossible to ignore<\/h3>\n\n\n\n<p>When it comes to protecting your organisation from security threats, <strong>there’s no such thing as too much communication<\/strong>. Place visual reminders about important cyber security practices throughout the office. Add cyber security to meeting agendas on a monthly or quarterly basis. Randomly quiz employees about their knowledge to make sure the message is getting through.<\/p>\n\n\n\n<p>Although this might sound tedious, it will help you create a culture that takes cyber security seriously; and the cost savings of this can be enormous.<\/p>\n\n\n\n<p><strong>Keen to understand more about Online Security Protection for New Zealand businesses? <a rel=\"noopener noreferrer\" href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\" target=\"_blank\">Download our latest eBook &#8211; it&#8217;s FREE!<\/a><\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/info.it360.co.nz\/go\/online-security-for-nz-businesses\/ebook\/\"><img width=\"1024\" height=\"512\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2018\/10\/online-security-CTA-1024x512.png\" alt=\"Download the Online Security for New Zealand Businesses eBook\" class=\"wp-image-6707\" title=\"\"><\/a><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>With security threats evolving at a rapid place, organisations must regularly communicate with their employees about potential risks, and educate them about cyber security best practices. Whether they mean to or not, employees pose a huge threat to cyber security. According to research by IBM, an astounding 95% of cyber security incidents can be traced back [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":295,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[13,86],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/294"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=294"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/294\/revisions"}],"predecessor-version":[{"id":9199,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/294\/revisions\/9199"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/295"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=294"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=294"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=294"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}