{"id":3367,"date":"2019-04-11T08:49:37","date_gmt":"2019-04-10T20:49:37","guid":{"rendered":"https:\/\/it360.co.nz\/?p=3367"},"modified":"2020-12-25T07:36:26","modified_gmt":"2020-12-24T19:36:26","slug":"cyber-security-terms","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/","title":{"rendered":"21 Cyber Security Terms Business Owners Need to Know (Including Analogies to Help You Understand Them Better)"},"content":{"rendered":"\n<p><a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">Cyber security<\/a> is a complex topic a lot of non-technical people stay away from. One of the reasons for the aversion is it’s <em>difficult to understand<\/em>. <\/p>\n\n\n\n<p>Don’t worry. We’ve got you covered. <\/p>\n\n\n\n<p>If you’re not technically inclined, this article is for you. We covered 21 cyber security terms and provided real-world examples to help you understand them better. <\/p>\n\n\n\n<div class=\"toc\"> <h2>21 Cyber Security Terms Every Business Owner Needs to Know<\/h2>\n<ol>\n<li><a href=\"#malware\">Malware<\/a><\/li>\n<li><a href=\"#ransomware\">Ransomware<\/a><\/li>\n<li><a href=\"#social-engineering\">Social Engineering<\/a><\/li>\n<li><a href=\"#phishing\">Phishing<\/a><\/li>\n<li><a href=\"#vulnerability\">Vulnerability<\/a><\/li>\n<li><a href=\"#denial-of-service\">Denial-of-Service (DoS)<\/a><\/li>\n<li><a href=\"#spoofing\">Spoofing<\/a><\/li>\n<li><a href=\"#adware\">Adware<\/a><\/li>\n<li><a href=\"#spyware\">Spyware<\/a><\/li>\n<li><a href=\"#trojan\">Trojan<\/a><\/li>\n<li><a href=\"#keylogger\">Keylogger<\/a><\/li>\n<li><a href=\"#mfa\">Two-Factor Authentication\/Multi-Factor Authentication<\/a><\/li>\n<li><a href=\"#cloud\">Cloud<\/a><\/li>\n<li><a href=\"#software\">Software<\/a><\/li>\n<li><a href=\"#vpn\">Virtual Private Network(VPN)<\/a><\/li>\n<li><a href=\"#encryption\">Encryption<\/a><\/li>\n<li><a href=\"#data-breach\">Data Breach<\/a><\/li>\n<li><a href=\"#firewall\">Firewall<\/a><\/li>\n<li><a href=\"#ip\">IP Address<\/a><\/li>\n<li><a href=\"#virus\">Virus<\/a><\/li>\n<li><a href=\"#worm\">Worm<\/a><\/li>\n<\/ol>\n<\/div>\n\n\n<div id=\"rank-math-faq\" class=\"rank-math-block d-none\">\n<div class=\"rank-math-list \">\n<div id=\"faq-question-5fe4edba6cd1b\" class=\"rank-math-list-item\">\n<h3 class=\"rank-math-question \">What is malware?<\/h3>\n<div class=\"rank-math-answer \"><p>Malware comes from <strong>ma<\/strong>licious soft<strong>ware<\/strong>. It&#8217;s the generic term for viruses, worms, and other software designed to gain unauthorized access or cause damage to a computer. Think of it as whiskey and Scotch, or Champagne and sparkling wines. All Scotch are whiskey, but not all whiskey are Scotch.<\/p>\n<\/div>\n<\/div>\n<div id=\"faq-question-5fe4edba6cd1e\" class=\"rank-math-list-item\">\n<h3 class=\"rank-math-question \">What is ransomware?<\/h3>\n<div class=\"rank-math-answer \"><p>Ransomware is a type of malware that prevents you from accessing your files until a ransom is paid. They do this by encrypting your files and asking for money. What that means is they add passwords to them. Since you don’t know the password and you obviously need to access your files,  you’d be left with no choice but to pay the hacker.<\/p>\n<\/div>\n<\/div>\n<div id=\"faq-question-5fe4edba6cd20\" class=\"rank-math-list-item\">\n<h3 class=\"rank-math-question \">What is two-factor authentication (2FA) or multi-factor authentication (MFA)?<\/h3>\n<div class=\"rank-math-answer \"><p>2FA or MFA adds another layer of security to your accounts. That can be two (2FA) or more (MFA) depending on what you use. For example, before you can login your email, you need a password (first layer). If you have MFA enabled, it will also ask for a code (second layer) to be added. This code usually comes from an app or an SMS message. This means you need your phone with you (third layer). <\/p>\n<\/div>\n<\/div>\n<div id=\"faq-question-5fe4edba6cd21\" class=\"rank-math-list-item\">\n<h3 class=\"rank-math-question \">What is the difference between two-factor authentication (2FA) or multi-factor authentication (MFA)?<\/h3>\n<div class=\"rank-math-answer \"><p>Two Factor Authentication (2FA) is a form of Multi-Factor Authentication (MFA). The determining attribute here is that MFAs means two or more ways to protect your account. <\/p>\n<\/div>\n<\/div>\n<div id=\"faq-question-5fe4edba6cd22\" class=\"rank-math-list-item\">\n<h3 class=\"rank-math-question \">What is the cloud?<\/h3>\n<div class=\"rank-math-answer \"><p>The cloud is a technology that allows you to access our files and\/or services through the internet from anywhere in the world. Technically speaking, it’s a collection of computers with large storage capabilities that remotely serve requests. <\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n\n\n<h3 id=\"malware\">1. Malware<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/malware-definition-1024x512.png\" alt=\"malware definition\" class=\"wp-image-3368\" title=\"\"><\/figure>\n\n\n\n<p>Malware is short for <strong>mal<\/strong>icious soft<strong>ware<\/strong>. It is any software designed to gain unauthorized access or to cause damage to a computer. It’s also the <em>general<\/em> (umbrella) term for all forms of malicious software. <\/p>\n\n\n\n<p>Think of it as whiskey and Scotch, or Champagne and sparkling wines. <\/p>\n\n\n\n<ul><li>All Scotch are whiskeys, but not all whiskeys are Scotch. <\/li><li>All Champagne is sparkling wines, but not all sparkling wines are Champagne. <\/li><\/ul>\n\n\n\n<p>For it to be called Scotch or Champagne, they have to come from Scotland and Champagne, France directly. <\/p>\n\n\n\n<p>It’s the same way for malware. These viruses and worms are all malware. <\/p>\n\n\n\n<h3 id=\"ransomware\">2. Ransomware<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/ransomware-definition-1024x512.png\" alt=\"ransomware definition\" class=\"wp-image-3369\" title=\"\"><\/figure>\n\n\n\n<p>Ransomware is a type of malware that prevents you from accessing files on your computer until a ransom is paid. They do this by <em>encrypting<\/em> your files. What that means is they add passwords to it. Hacker then asks for money in exchange for the decryption key (password). Since you don’t know the password and you obviously need to access your files, you’d be left with no choice but to pay the hacker. <\/p>\n\n\n\n<p>It’s like your typical hostage situation where the hostage taker is holding someone hostage. The demands are to pay the ransom to release the hostage. Once you pay, they release the person. <\/p>\n\n\n\n<p>Here, the hacker is holding your data hostage. Once you pay the ransom, they’ll give you back your data (by giving the password to access it).<\/p>\n\n\n\n<h3 id=\"social-engineering\">3. Social Engineering<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/social-engineering-definition-1024x512.png\" alt=\"Social Engineering Definition\" class=\"wp-image-3388\" title=\"\"><\/figure>\n\n\n\n<p>Social engineering is a tactic that aims to convince a user to disclose sensitive information such as passwords and credit card numbers by impersonating other people. The most common social engineering example involves someone posing as the CEO and sends an email to the accounting\/finance department to transfer money to a “supplier.” <\/p>\n\n\n\n<p>For more information on this and how you can prevent your business from being targeted, download this free eBook on<a href=\"https:\/\/info.it360.co.nz\/lp\/organisation-phishing-targets\/\"> Who Are Your Organisation’s Top Targets?<\/a><\/p>\n\n\n\n<h3 id=\"phishing\">4. Phishing<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/phishing-definition-1024x512.png\" alt=\"Phishing Definition\" class=\"wp-image-3389\" title=\"\"><\/figure>\n\n\n\n<p>Phishing is the practice of sending fraudulent emails (or any other communication platform like SMS or calls) that resemble messages coming from reputable sources with the intention of stealing sensitive data like credit card numbers and login information. <\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/qD50Nl-S3TsXGjBLWDFOBig-Nycbxa70lXj4rxlboD--Gpz3XA46zRyhcb530uWa499FHJ9H7zkMOTC8PuvF6Nzzk37II6wq510cyx0FpA6t_cH2fNzuqXq8qyJnfLdUZS4KP76UkQl4DHvNPA\" alt=\"sample phishing email\" title=\"\"><\/figure>\n\n\n\n<p>Here’s an example of a phishing email where someone is pretending to be Apple. But if you look closely, you’d notice there are signs these are fake. For example, the email address contains a string of letters. Their domain is from akicintaopan.com, and not apple.com. And what might be the biggest factor, at least for me, is that Apple ID isn’t using this email address. <\/p>\n\n\n\n<h3 id=\"vulnerability\">5. Vulnerability<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/vulnerability-definition-1024x512.png\" alt=\"Vulnerability Definition\" class=\"wp-image-3391\" title=\"\"><\/figure>\n\n\n\n<p>A vulnerability is a weakness in design, implementation, operation or internal control. What this means is if one of the <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">three pillars of cyber security<\/a> is not addressed, your business is vulnerable. <\/p>\n\n\n\n<p>You can think of vulnerabilities as weaknesses that you can take advantage of. For example, in football, you generally attack where there’s no defense present. If everyone is on the right side of the field, make a cross towards the left side and you have better chances of scoring a goal. <\/p>\n\n\n\n<h3 id=\"denial-of-service\">6. Denial-of-service (DoS)<\/h3>\n\n\n\n<p>DoS attacks are designed to make a computer or network resource unavailable to its intended users. This is usually done by one computer. There’s a version of this called Distributed Denial-of-Service (DDoS) which uses multiple computers to do the same thing. <\/p>\n\n\n\n<p>Watch this quick video to show you what this might look like in real life. For more context, you can watch the entire clip. <\/p>\n\n\n\n<p><iframe src=\"https:\/\/www.youtube.com\/embed\/Y1b8865GOHU?start=82\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"560\" height=\"315\" frameborder=\"0\"><\/iframe><\/p>\n\n\n\n<h3 id=\"spoofing\">7. Spoofing<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/spoofing-definition-1024x512.png\" alt=\"Spoofing Definition\" class=\"wp-image-3392\" title=\"\"><\/figure>\n\n\n\n<p>Spoofing is the act of masquerading as a valid entity through falsification of data in order to gain access to information or resources that one is otherwise unauthorized to obtain. <\/p>\n\n\n\n<p>This is similar to phishing in the sense that hackers try to deceive the person receiving it, but the main difference is that spoofing is for delivery whereas phishing is for retrieval. <\/p>\n\n\n\n<p>You won’t knowingly download a malware, right? But if someone tricked you into clicking a link, say about your business getting sued, you will most likely click on it. That will then lead to a download of some sort of malware.<\/p>\n\n\n\n<h3 id=\"adware\">8. Adware<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/adware-definition-1024x512.png\" alt=\"Adware Definition\" class=\"wp-image-3393\" title=\"\"><\/figure>\n\n\n\n<p>Adware is a form of malware that hides on your device and serves you advertisements. Some adware also monitors your behavior online so it can target you with specific ads.<\/p>\n\n\n\n<p>Kaspersky recently wrote an article about a <a href=\"https:\/\/www.kaspersky.com\/blog\/adware-in-chrome-extensions\/25668\/\" target=\"_blank\" rel=\"noopener\">now-removed Chrome extension<\/a> that started out as a regular plugin but became an adware — delivering unwanted ads every now and then. <\/p>\n\n\n\n<p>While not outright malicious, meaning it doesn’t corrupt your date (like ransomware) or steal it (spyware), it’s very annoying. And the ads that appear might lead you to eventually download other types of malware. <\/p>\n\n\n\n<h3 id=\"spyware\">9. Spyware<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/spyware-definition-1024x512.png\" alt=\"Spyware Definition\" class=\"wp-image-3394\" title=\"\"><\/figure>\n\n\n\n<p>Spyware is a form of malware that hides on your device, monitors your activity, and steals sensitive information like bank details and passwords.<\/p>\n\n\n\n<p>You can think of this as “Big Brother” but in a bad way. Everything you do — what you watch and what you type — gets monitored. If you login your bank and didn’t have multi-factor authentication, someone can easily access your money. <\/p>\n\n\n\n<h3 id=\"trojan\">10. Trojan<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/trojan-definition-1024x512.png\" alt=\"Trojan Definition\" class=\"wp-image-3395\" title=\"\"><\/figure>\n\n\n\n<p>Trojans are programs that claim to perform one function but actually do another, typically malicious. Trojans can take the form of attachments, downloads, and fake videos\/programs.<\/p>\n\n\n\n<p>While there are <a href=\"https:\/\/us.norton.com\/internetsecurity-malware-what-is-a-trojan.html\" target=\"_blank\" rel=\"noopener\">many types of trojans<\/a>, the concept is simple. Hackers try to get in your computers by promising to do something (fake program), but later does something else (give them access to your system). <\/p>\n\n\n\n<p>Remember the story of Troy and how the Greeks lay ruin to the walled city? <\/p>\n\n\n\n<p>After years of war, the Greeks created the Trojan Horse, sailed away, and left one man behind. This man convinced the people of Troy that they abandoned him and left the horse as an offering to the goddess Athena. The Trojans pulled the horse back into Troy. Later that night, a small Greek army emerged from inside the horse and opened the gates for the rest of the Greek army (which sailed back under during the night) to enter; thus, destroying the city of Troy and ending the war. <\/p>\n\n\n\n<h3 id=\"keylogger\">11. Keylogger<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/keylogger-definition-1024x512.png\" alt=\"Keylogger Definition\" class=\"wp-image-3396\" title=\"\"><\/figure>\n\n\n\n<p>Keyloggers secretly record what you see, say and do on your computer. Employers use keyloggers to watch employees, but cybercriminals use them too.<\/p>\n\n\n\n<p>Keyloggers lies on the border of a productivity tool and a spyware. The main difference is where the data is used. Take, for example, this <a href=\"https:\/\/nakedsecurity.sophos.com\/2017\/08\/03\/fired-employee-caught-by-keylogger-wins-case\/\" target=\"_blank\" rel=\"noopener\">employee who sued his employer for illegal dismissal<\/a>. <\/p>\n\n\n\n<h3 id=\"mfa\">12. Two-Factor Authentication \/ Multi-Factor Authentication <\/h3>\n\n\n\n<p>Two Factor Authentication (2FA) is a form of Multi-Factor Authentication (MFA). The determining attribute here is that MFAs mean two or more ways to protect your account. <\/p>\n\n\n\n<p>Do you use an ATM to access your cash? If you do, then you’re already using a form of multi-factor authentication. <\/p>\n\n\n\n<p>In order to withdraw your cash, you would need the following:<\/p>\n\n\n\n<ol><li>Your ATM card<\/li><li>Your PIN<\/li><\/ol>\n\n\n\n<p>That’s an added layer of security banks (and other services you use) to protect you. If you lost your wallet, someone can easily withdraw from your account if you don’t have a PIN. <\/p>\n\n\n\n<h3 id=\"cloud\">13. Cloud<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/cloud-definition-1024x512.png\" alt=\"Cloud  Definition\" class=\"wp-image-3397\" title=\"\"><\/figure>\n\n\n\n<p>A technology that allows us to access our files and\/or services through the internet from anywhere in the world. Technically speaking, it’s a collection of computers with large storage capabilities that remotely serve requests.<\/p>\n\n\n\n<p>Steve Jobs said in a 2011 Keynote, “Some people think the cloud is just a hard drive in the sky. We think it&#8217;s way more than that…everything happens automatically and there’s nothing new to learn…it just works.” <\/p>\n\n\n\n<p>You can watch the video below…<\/p>\n\n\n\n<p><iframe src=\"https:\/\/www.youtube.com\/embed\/3zNgPQCH8UA\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"560\" height=\"315\" frameborder=\"0\"><\/iframe><\/p>\n\n\n\n<p>While he talked about their product, iCloud, the <em>cloud<\/em> works in the same way. It works in the background to help you do what you need to do. <\/p>\n\n\n\n<h3 id=\"software\">14. Software<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/software-definition-1024x512.png\" alt=\"Software Definition\" class=\"wp-image-3398\" title=\"\"><\/figure>\n\n\n\n<p>A set of programs that tell a computer to perform a task. These instructions are compiled into a package that users can install and use. For example, Microsoft Office is an application software.<\/p>\n\n\n\n<p>A simple way to think of software is it’s what you interact with on your devices. The apps on your phone are all software. The <em>programs<\/em> you are using on your laptops and computers are software. <\/p>\n\n\n\n<h3 id=\"vpn\">15. Virtual Private Network (VPN)<\/h3>\n\n\n\n<p>A virtual private network (VPN) is a tool that allows you to remain anonymous while using the internet. It does this by masking your location and encrypting your traffic. <\/p>\n\n\n\n<p>Take a look at this image…<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/a4Cl4hQsWat74a8MOSnUdyyomU3Inayf1wWUF2g0R5wGUzeINAfqndvc6KFmNuTFLW_TLBIrUaEwXg1F6SY2ZyuM-1OZQmdM8LMVmncfCcyiI25UxOm8WTUWh8siAuHRzlJnKKbRFTtuGrd-oQ\" alt=\"How VPN Works\" title=\"\"><\/figure>\n\n\n\n<p>When you connect to the internet, it goes through a series of steps that happens behind the scenes. <\/p>\n\n\n\n<ul><li>From your device, it goes to a router (whether public or private)<\/li><li>From that router, it heads to your internet service provider (ISP)<\/li><li>From your ISP, it reaches the <em>internet<\/em><\/li><\/ul>\n\n\n\n<p>As the image depicts, with VPN, the <em>data<\/em> gets encrypted the moment it leaves your device. No one can snoop around wherever they are. <\/p>\n\n\n\n<h3 id=\"encryption\">16. Encryption<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/encryption-definition-1024x512.png\" alt=\"Encryption Definition\" class=\"wp-image-3399\" title=\"\"><\/figure>\n\n\n\n<p>Encryption, in its simplest form, is to add a password to your data so that anyone who doesn’t know the password (called the decryption key), can’t view it. This doesn’t mean that the encrypted data can’t be stolen, though. <\/p>\n\n\n\n<p>One example of this is adding a passcode to your phone. Without that passcode, your phone (and all data in it) is encrypted. Even if your phone is stolen, without them knowing that code, they won’t be able to access the contents. <\/p>\n\n\n\n<h3 id=\"data-breach\">17. Data Breach<\/h3>\n\n\n\n<p>A data breach is the moment information is accessed without authorization. This includes both external and internal actors (yes, these are employees). <\/p>\n\n\n\n<p>For example, the biggest data breach that welcomed the 2019 is called <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">Collection #1<\/a>, where over 1.2 billion unique combination of email addresses and passwords were leaked to the public. <\/p>\n\n\n\n<h3 id=\"firewall\">18. Firewall<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/04\/firewall-definition-1024x512.png\" alt=\"Firewall Definition\" class=\"wp-image-3400\" title=\"\"><\/figure>\n\n\n\n<p>A firewall is a hardware or software designed to filter traffic coming in and out of your network or computer. That filter is based on a set of security rules. <\/p>\n\n\n\n<p>You can think of the firewall as similar to the immigration services. People coming in\/out of the country passes through a set of protocols. They can’t just allow people to come in without visas or going through a certain process. <\/p>\n\n\n\n<h3 id=\"ip\">19. IP Address<\/h3>\n\n\n\n<p>An IP address, short for internet protocol address, is an internet version of a home address for your computer, which is identified when it communicates over a network. <\/p>\n\n\n\n<p>There are two versions of IP addresses used today: IPv4 and IPv6. Here are examples for each version, respectively: 172.16.254.1 and 2001:db8:0:1234:0:567:8:1. <\/p>\n\n\n\n<p>Again, you can think of this as your home address. Your address allows people to go to your home. Or, it allows maps to determine your location and come up with the best driving route. <\/p>\n\n\n\n<p>This is why a VPN is important because without it, you and your location will be sent to anyone who knows your IP address. <\/p>\n\n\n\n<h3 id=\"virus\">20. Virus<\/h3>\n\n\n\n<p>A virus is a type of malware aimed to corrupt, erase or modify information on a computer before spreading to others. <\/p>\n\n\n\n<p><em>See also worm below<\/em><\/p>\n\n\n\n<h3 id=\"worm\">21. Worm<\/h3>\n\n\n\n<p>A worm is piece of malware that can replicate itself in order to spread the infection to other connected computers. It’s also a type of a virus. <\/p>\n\n\n\n<p>Viruses and worms both have the ability to propagate and spread to other devices. The main difference between them is that a virus needs a a program (e.g. a word document) to cause damage whereas a worm doesn’t. <\/p>\n\n\n\n<p>Do you remember the Friends episode where Chandler borrows Ross’ laptop to check his email? After clicking on the ‘photo’ that was sent by someone he didn’t know, it erased the laptop’s entire hard drive. That’s an <a href=\"https:\/\/en.wikipedia.org\/wiki\/Anna_Kournikova_(computer_virus)\" target=\"_blank\" rel=\"noopener\">example of a worm<\/a>. <\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>There are a lot more cyber security terms out there. Some organizations even have their own A to Z dictionary of these. Here, we only listed the most common terms you will moist likely encounter. <\/p>\n\n\n\n<p>Did the analogies help you understand them better? Did we miss anything? Let us know in the comments below. <br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cyber security is a complex topic a lot of non-technical people stay away from. One of the reasons for the aversion is it’s difficult to understand. Don’t worry. We’ve got you covered. If you’re not technically inclined, this article is for you. We covered 21 cyber security terms and provided real-world examples to help you [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":4850,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,85,91],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/3367"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=3367"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/3367\/revisions"}],"predecessor-version":[{"id":8259,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/3367\/revisions\/8259"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/4850"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=3367"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=3367"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=3367"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}