{"id":3419,"date":"2019-04-30T08:53:52","date_gmt":"2019-04-29T20:53:52","guid":{"rendered":"https:\/\/it360.co.nz\/?p=3419"},"modified":"2020-01-05T13:33:38","modified_gmt":"2020-01-05T01:33:38","slug":"what-happens-when-you-get-hacked","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/what-happens-when-you-get-hacked\/","title":{"rendered":"What Happens When You Get Hacked"},"content":{"rendered":"\n<p>Getting hacked is one of the things you often hear in <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">cyber security<\/a>. According to a <a href=\"https:\/\/www.hiscox.co.uk\/sites\/uk\/files\/documents\/2018-02\/Hiscox_Cyber_Readiness_Report_2018_FINAL.PDF\" target=\"_blank\" rel=\"noopener\">2018 report<\/a>, 73% of businesses are not ready to respond to a cyber attack. <\/p>\n\n\n\n<p>That means getting hacked is now a matter of <em>when<\/em>, not if.<\/p>\n\n\n\n<p>But it doesn’t have to come to that. <\/p>\n\n\n\n<p>There are a lot of things you can do to <a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">protect yourself from getting hacked<\/a>. You have to equip yourself with <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/\">basic cyber security terminologies<\/a>. Then, when you’re familiar, dive right in into our <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">non-technical guide to protecting your business online<\/a>. <\/p>\n\n\n\n<p>But you may be asking… <\/p>\n\n\n\n<h2>What Happens When You Get Hacked<\/h2>\n\n\n\n<p>Getting hacked can mean a lot of things for different people. That’s why a lot of people still don’t take their online security seriously. <\/p>\n\n\n\n<p>In this article, we’ve broken it down according to the levels of severity\/effect on the victim.<\/p>\n\n\n\n<p>Below are the five levels of hacking and what you can do to prevent it from happening. <\/p>\n\n\n\n<h3>Level 1: Harmless Snooping <\/h3>\n\n\n\n<p>The first level of hacking is when someone gains access to your data or information and does nothing about it. <\/p>\n\n\n\n<p>For example, someone behind you at the train is ‘reading’ your email at the same time as you. Or someone who heard a private conversation you had with your spouse. Or a person who visited your office and saw some documents lying around…<\/p>\n\n\n\n<p>This level doesn’t do any harm because the <em>unauthorized person<\/em> doesn’t do anything with the information. They just kept it to themselves and went about their regular day. Maybe they just used it as an interesting conversation over dinner with their spouse later that day. <\/p>\n\n\n\n<h4>How to prevent level 1 hacking<\/h4>\n\n\n\n<p>This level won’t cause much harm, but if the person has some evil intentions, then it’s worth taking extra precautions. <\/p>\n\n\n\n<p>If you’re worried about someone snooping around reading your phone or your computer in a cafe, the best way to avoid that is to <strong>position yourself with your back against the wall<\/strong>. That way, no one can see what’s on your screen. <\/p>\n\n\n\n<p>Or if that’s not possible, use one of those screen filters that block viewing from certain angles. Meaning, only the person who is directly in front can see what’s on the screen. <\/p>\n\n\n\n<p>Still can’t visualize this? Next time you go to the ATM, step a little to the left\/right and try looking at it from the side instead of the front. You should not see anything on the screen. It&#8217;s going to be the same thing but for your devices. <\/p>\n\n\n\n<h3>Level 2: The Prank<\/h3>\n\n\n\n<p>The second level of hacking is when your data is used against you but in a harmless, light-hearted way. You know, the one you just laugh and tell stories about later.<\/p>\n\n\n\n<p>Imagine drinking out with your buddies. You tell stories. You laugh. After a while, you go to the bathroom. Then, when you come back, you notice everyone chuckling. You keep asking why and they won’t tell you. You let it go. <\/p>\n\n\n\n<p>Then, you check your phone. You saw Facebook has a ton of notifications. When you looked at it, everyone at the table suddenly burst into laughter. You then looked at it and one of your buddies posted something. <\/p>\n\n\n\n<p>No harm done. Just your drunk buddies playing a prank on you. <\/p>\n\n\n\n<h4>How to prevent level 2 hacking<\/h4>\n\n\n\n<p>If you haven’t already, <strong>add a passcode to your devices<\/strong>. Make it a habit to <em>lock<\/em> it before leaving it — whether that’s your phone or your computer. <\/p>\n\n\n\n<p>Your password is useless if the device is already open. <\/p>\n\n\n\n<p>For Mac users running on the latest OS (Mojave), simply press ‘command + ctrl + Q’ at the same time to lock your screen. If you’re using Windows 10, just press the ‘windows button + L’ to lock your screen. <\/p>\n\n\n\n<p>And this goes without saying, if it’s portable enough, like your phone or tablet, and you’re in a public place like a cafe, please don’t leave it at the table when you go to the restroom, or order your drink. <\/p>\n\n\n\n<h3>Level 3: Fraud<\/h3>\n\n\n\n<p>Level 3 hacking is when the information accessed\/stolen is used against you. This is the typical hacking you hear on the news where the hacker used the credit card of another person, or through other methods such as <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/#phishing\">phishing<\/a> or <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/#ransomware\">ransomware<\/a>. <\/p>\n\n\n\n<p>Remember, <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">70% of small and medium businesses have been targeted by a cyber attack<\/a>. So, don’t take this for granted. <\/p>\n\n\n\n<h4>How to prevent level 3 hacking<\/h4>\n\n\n\n<p><a href=\"https:\/\/it360.co.nz\/blog\/dont-want-to-get-hacked-follow-these-21-cyber-security-tips\/\">General rules for protecting yourself online<\/a> applies here:<\/p>\n\n\n\n<ul><li>Don’t open emails\/links from someone you don’t know<\/li><li>Use strong and unique passwords<\/li><li>Use a multi-factor authentication<\/li><li>Use a VPN<\/li><li>Don’t connect to public Wi-Fis (if possible) <\/li><\/ul>\n\n\n\n<p>Remember that <a href=\"https:\/\/it360.co.nz\/blog\/protect-yourself-online-by-focusing-on-these-two-things\/\">technology<\/a> such as antivirus software can only protect you to an extent. You also have to do your part. <\/p>\n\n\n\n<h3>Level 4: Breach<\/h3>\n\n\n\n<p>Level 4 hacking goes beyond financial harm. Usually, the victim’s reputation takes a hit. It’s when other people are also affected in some way. <\/p>\n\n\n\n<p>Remember the <a href=\"https:\/\/it360.co.nz\/blog\/icloud-hacking-not-just-for-celebrities\/\">iCloud hacking of celebrities<\/a> that happened before? This can also happen to you. <\/p>\n\n\n\n<p>Or if you’re a business, this will be the data breaches where your customers’ sensitive information is leaked to the public — leading to the<a href=\"https:\/\/it360.co.nz\/blog\/mounting-security-complexity\/\"> loss of trust of your customers<\/a>. <\/p>\n\n\n\n<h4>How to prevent level 4 hacking<\/h4>\n\n\n\n<p>Preventing a level 4 hack starts at the <a href=\"https:\/\/info.it360.co.nz\/lp\/organisation-phishing-targets\/\">top of your organization<\/a>. You have to know who are the most common targets and how to spot them in their tracks. <\/p>\n\n\n\n<p>Then, a <a href=\"https:\/\/it360.co.nz\/blog\/how-to-create-an-it-policy\/\">cyber security policy<\/a> is also key. You can’t expect your employees to know what you know, or even think about their online habits and how it may affect the entire organization. It’s up to you to <a href=\"https:\/\/it360.co.nz\/blog\/5-ways-to-communicate-cyber-security-with-staff\/\">communicate cyber security with your staff<\/a>. <\/p>\n\n\n\n<h3>Level 5: Physical Harm<\/h3>\n\n\n\n<p>Level 5 hacking is the most severe type because it causes physical harm to people. Unlike money which you can earn back later or reputational harm which you can repair over time, this type of hacking can lead to irreversible consequences such as injuries or death. <\/p>\n\n\n\n<p>This is the type that you often see on movies where hackers cause sudden blackouts leading to chaos or hack into your cars to control them. <\/p>\n\n\n\n<p>Still not convinced? Here’s a<a href=\"https:\/\/www.infosecurity-magazine.com\/opinions\/physical-damage-cyber-attacks\/\" target=\"_blank\" rel=\"noopener\"> list of cyber security attacks<\/a> that happened already resulting to physical harm, including tampering of HVAC systems in a hospital and the main control software of a German plant that resulted to a physical blast. <\/p>\n\n\n\n<h4>How to prevent level 5 hacking<\/h4>\n\n\n\n<p>Preventing this level of hacking is similar to the ones described above. It takes just one mistake (a single infected USB thumb drive or an innocent click on an email) to allow hackers to get in your system. <\/p>\n\n\n\n<p>If your organization doesn’t have the necessary skills or manpower to handle your cyber security, your best course of action is to <a href=\"https:\/\/info.it360.co.nz\/lp\/free-consult-booking\/\">hire an external IT partner<\/a> to assess your current state and work together to ensure you are ready for a cyber attack. <\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>There’s a lot you can do to protect yourself from getting hacked. <\/p>\n\n\n\n<p><strong>Remember, if something can connect to the internet, it can be hacked. <\/strong><\/p>\n\n\n\n<p>No technology is 100% hack-proof. <\/p>\n\n\n\n<p>You (and your employees) are the last line of defence when it comes to not getting hacked. <\/p>\n\n\n\n<p>So, the question is, are you ready when that happens?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Getting hacked is one of the things you often hear in cyber security. According to a 2018 report, 73% of businesses are not ready to respond to a cyber attack. That means getting hacked is now a matter of when, not if. But it doesn’t have to come to that. There are a lot of [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":4849,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,26],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/3419"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=3419"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/3419\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/4849"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=3419"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=3419"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=3419"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}