{"id":5342,"date":"2019-06-04T13:21:13","date_gmt":"2019-06-04T01:21:13","guid":{"rendered":"https:\/\/it360.co.nz\/?p=5342"},"modified":"2020-01-05T00:43:27","modified_gmt":"2020-01-04T12:43:27","slug":"no-such-thing-as-it-projects-only-business-projects","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/no-such-thing-as-it-projects-only-business-projects\/","title":{"rendered":"No Such Thing as IT Projects – Only Business Projects"},"content":{"rendered":"\n<p><strong>We can remember a time when IT was an internal-facing support organisation, maintaining – and occasionally creating – large monolithic applications which support the major operational initiatives of the business. That view of IT has largely fallen by the wayside.<\/strong><\/p>\n\n\n\n<p>The emergence of cloud, mobile and social media have forever <a href=\"https:\/\/it360.co.nz\/blog\/blurring-between-social-and-work-life-requires-new-cyber-security-monitoring\/\">changed much of how we live our personal lives.<\/a> These changes have now begun to move into the business world.<\/p>\n\n\n\n<p>Add to that the concepts of big data and the Internet of Things and we begin to see massive changes in what is possible when all these things operate in concert.<\/p>\n\n\n\n<p>There is an insidious nature to the potential impacts of cloud, social, mobile, big data and IoT. On the one hand, these things are creating fertile ground for business disruption.<\/p>\n\n\n\n<p>Any business including your business is a target for a new breed of corporate raider who can establish a foothold in a market very, very quickly. How ready is your business to repel these modern-day pirates?<\/p>\n\n\n\n<p>Could you have imagined a time a few years ago when a fintech startup could challenge the big established banks? Without any bricks and mortar corner bank branches? That is now entirely possible.<\/p>\n\n\n\n<p>This scenario has forced CIOs to re-evaluate IT priorities.<\/p>\n\n\n\n<p>Where IT was once a <a href=\"https:\/\/it360.co.nz\/blog\/automation-is-changing-everything\/\">catalyst for efficiencies<\/a> inside the organisation, it is now an avenue for innovation, seeking competitive advantage for the business and enabling sustainable, profitable growth. What a reversal of roles.<\/p>\n\n\n\n<p>Now, rather than expending 80% of IT budget and human resources simply supporting legacy applications, <strong>IT has to pivot towards a whole new challenge,<\/strong> leveraging the same new technologies that threaten the business, to create new opportunities to grow the business.<\/p>\n\n\n\n<h2><strong>Digital and Business Transformation<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img width=\"300\" height=\"200\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/06\/business-decisions-300x200.jpg\" alt=\"\" class=\"wp-image-5472\" title=\"\"><\/figure>\n\n\n\n<p>IT has been consumed in the past by supporting the systems and infrastructure that run legacy systems. <strong>IT must be released from those restrictions.<\/strong><\/p>\n\n\n\n<p>One way to achieve that is by leveraging external public and private <a href=\"https:\/\/it360.co.nz\/services\/cloud-solutions\/\">cloud services<\/a>, and other external managed services provided by vendors.<\/p>\n\n\n\n<p>The CIO and the IT organisation can exit the role of being custodians of the data centre – a support function that perpetuates the view of IT as a cost centre – and turn their skills towards creating new business value.<\/p>\n\n\n\n<p>The value of new technology investments related to digital transformation are now measured by how they relate to long-term revenue growth, rather than a short-term technology ROI.<\/p>\n\n\n\n<p>Clearly, as the business moves forward with digital transformation as an enabler for a fundamental business transformation, collaboration becomes key. Internal teams need to work cohesively to embrace innovation and change.<\/p>\n\n\n\n<p>Externally, the business and IT need to <a href=\"https:\/\/it360.co.nz\/blog\/it-support-company-who-to-choose\/\">partner with the right technology and consulting providers<\/a> to enable a more seamless and efficient digital transformation journey.<\/p>\n\n\n\n<p>iT360 can provide great value as that provider and as a company that helps you leverage technology to grow your business and discover your opportunities.<\/p>\n\n\n\n<h2><strong>Agility and Speed<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img width=\"300\" height=\"270\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/06\/adult-analyzing-brainstorming-1483907-300x270.jpg\" alt=\"\" class=\"wp-image-5471\" title=\"\"><\/figure>\n\n\n\n<p>Once IT has been relieved of the time-consuming day-to-day operational complexity of maintaining legacy systems, the focus can now turn towards establishing the collaboration between internal teams representing both the broader C-suite, other business leaders, and IT.<\/p>\n\n\n\n<p>And the focus of those teams needs to turn to their collective knowledge of the market, the business and most of all the customers. That knowledge will inform the business going forward about opportunities and also inform IT about rapid development of capabilities and applications to target those opportunities.<\/p>\n\n\n\n<p>Probably the most important quality for both the business and IT in the age of disruption and transformation is agility.<\/p>\n\n\n\n<p><strong>Competitive threats must be met rapidly.<\/strong><\/p>\n\n\n\n<p>The business must be able to adapt to changing circumstances and opportunities quickly. IT needs to be able to analyse data and develop with speed. DevOps isn’t a theory – it needs to be how IT operates.<\/p>\n\n\n\n<p>Provisioning of compute, storage and network resources in minutes, not weeks or months. Paying for those resources from OpEx, not CapEx and long lead times.<\/p>\n\n\n\n<p>It is in this phase of transformation that IT is no longer seen as the low-value cost centre.<\/p>\n\n\n\n<p>IT has become a strategic partner to the business. In this phase the CEO and CIO have the same kind of synergistic relationship that is enjoyed between the CEO and the COO in pre-disruption businesses.<\/p>\n\n\n\n<h2><strong>Next Move<\/strong><\/h2>\n\n\n\n<p>Are you ready to move legacy applications to a hosted private cloud provider?<\/p>\n\n\n\n<p>Are you ready to re-purpose IT budgets and resources towards transformational outcomes?<\/p>\n\n\n\n<p>The insightful &amp; passionate team at iT360 have great advice and experience that we’d be keen to share with you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We can remember a time when IT was an internal-facing support organisation, maintaining – and occasionally creating – large monolithic applications which support the major operational initiatives of the business. That view of IT has largely fallen by the wayside. The emergence of cloud, mobile and social media have forever changed much of how we [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":5349,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5342"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=5342"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5342\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/5349"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=5342"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=5342"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=5342"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}