{"id":5421,"date":"2019-06-25T08:09:07","date_gmt":"2019-06-24T20:09:07","guid":{"rendered":"https:\/\/it360.co.nz\/?p=5421"},"modified":"2019-12-21T02:56:19","modified_gmt":"2019-12-20T14:56:19","slug":"it-support-company-who-to-choose","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/it-support-company-who-to-choose\/","title":{"rendered":"IT Support Company: Who to Choose?"},"content":{"rendered":"\n<p>Weeding out the right IT support company is an important decision for any business. You don&#8217;t just randomly select tech service providers from Google search. You want to feel comfortable with your choice since they will help keep your business operating without a glitch. You will need a reliable provider to make sure that your network&#8217;s up all the time and that your computers are working.&nbsp;<\/p>\n\n\n\n<p>But, which company should you pick to address your IT needs? This is the proverbial question, or so it seems. No one can predict the&nbsp;future, but&nbsp;knowing that you&#8217;ve entrusted your network infrastructure to the right managed network service provider is close enough to doing just that.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Lucky for you, we&#8217;ve narrowed down the criteria so you can choose the right partner for your long-term success. <em>Stuck in a rut?<\/em> We&#8217;ve got you covered!&nbsp;<\/p>\n\n\n\n<h2><strong>9 Things to Look&nbsp;For&nbsp;in an IT Support Company<\/strong>&nbsp;<\/h2>\n\n\n\n<p>We&#8217;ve narrowed down your search to finding the right IT support with these criteria:&nbsp;<\/p>\n\n\n\n<h3><strong>1. Longevity&nbsp;<\/strong>&nbsp;<\/h3>\n\n\n\n<p>The IT industry is tough; many companies come and go. Finding tech support with a decade of experience is like searching for the holy grail since it&#8217;s a rarity. Those who have been serving their customers this long are surely doing something right for their customers, or they wouldn’t have survived in such a cutthroat world.&nbsp;<\/p>\n\n\n\n<h3><strong>2. Availability<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Which is almost as synonymous with speed of delivery. When you&nbsp;want to keep your technology and infrastructure running at all times, it&#8217;s imperative that your IT support company will be there when you need them. No excuses! It helps to know how responsive they are when issues arise, or if they get the job done right and fast. But, if you&#8217;ve never done business with them, how can you know other than checking out customer testimonials and reviews online? Simple. You can check out their SLA (service level agreement) for you to know what the service metrics are.&nbsp;<\/p>\n\n\n\n<h3><strong>3. Local<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Don&#8217;t get us wrong; we&#8217;ve got nothing against offshoring. In fact, we&#8217;ve got a couple of remote support helping us deliver five-star services to our clients. But, having someone onsite when your firewall fails, for example, will take faster than getting a third-party vendor which could take days. It helps if your chosen IT solutions provider is nearby when emergencies arise.&nbsp;<\/p>\n\n\n\n<h3><strong>4. Certifications and Partnerships<\/strong>&nbsp;<\/h3>\n\n\n\n<p>No one goes to combat alone, unless one&#8217;s on a suicide mission. Just like your chosen IT support company, they come with credentials and reputable partners to tackle your most-pressing technology needs. This ensures that you will only get top-of-the-line service, nothing less.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>iT360 and&nbsp;Kordia&nbsp;actually have some personal routes that go a long way back. Our fathers work together back in the technology age, way back in the 80s and 90s.&nbsp; I&#8217;m extremely&nbsp;proud that&nbsp;I can work alongside someone whom my father worked along the side. We&#8217;re both very passionate about what we do, we both share a lot of the same values, and we&#8217;re both driven to get the same outcomes for our customers<\/em><\/p><cite>Brent La Franchie, Account Director, Kordia. <\/cite><\/blockquote>\n\n\n\n<figure class=\"wp-block-embed-wordpress wp-block-embed is-type-wp-embed is-provider-wistia-inc\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"iT360 - Kordia &amp; Farro Secure Network Case Study Video\" class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/fast.wistia.net\/embed\/iframe\/pvqi12mkpo?dnt=1#?secret=a9B3P8cYdu\" data-secret=\"a9B3P8cYdu\" frameborder=\"0\" scrolling=\"no\" width=\"960\" height=\"540\"><\/iframe>\n<\/div><\/figure>\n\n\n\n<p><\/p>\n\n\n\n<h3><strong>5. Industry Experience<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Not just in what they do, but in &#8216;Your&#8217; industry as well. It helps to check if they have served other companies in your niche or much better, earned awards in your industry. This means they know the ins and outs of your business, even with eyes shut close, and they can provide a one-and-done solution for your problems.&nbsp;<\/p>\n\n\n\n<h3><strong>6. Diversity&nbsp;<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Related to the previous item, having a wide client base means that the tech support company have went through a jungle of issues so vast you can&#8217;t even navigate your way in it. This means that when a weird problem pops up, chances are, they&#8217;ve seen it before and can fix it in a snap. Unless you&#8217;re in a highly-specialised&nbsp;niche needing specialists for it, you&#8217;re better off working with those who made the impossible&#8230; a possibility.&nbsp;<\/p>\n\n\n\n<h3><strong>7. Reliability<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Everyone promises a 100% customer satisfaction guarantee, but only a few live up to the promise. It never hurts to ask if they offer any guarantees on uptime, or if your system will remain up for something close to 100% of the time. It doesn&#8217;t stop there though. You need to know that you can count on them around the clock so ask if they offer remote troubleshooting and for how many hours\/days in a week.&nbsp;<\/p>\n\n\n\n<h3><strong>8. Fully Managed<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Other than finding out what services your chosen IT company&nbsp;specialises&nbsp;in, you can ask if they offer fully-managed services that can provide you a network with excellent Quality of Service (QoS) and a reliable infrastructure to ensure business continuity. Check out what packages they offer to help you&nbsp;on a daily basis, other than their retainer deals.&nbsp;<\/p>\n\n\n\n<h3><strong>9. Custom-Fit<\/strong>&nbsp;<\/h3>\n\n\n\n<p>At the end of the day, you want to work with someone who truly understands your&nbsp;needs.&nbsp;It helps if you, or someone in your company, have already worked with your chosen managed services provider. Do you know anyone who has a good experience and relationship with them?&nbsp;&nbsp;<\/p>\n\n\n\n<p>Back in 2017, we were asked to put up a secure infrastructure that would help transition&nbsp;Farro&nbsp;Fresh.&nbsp; Our good relationship with&nbsp;<a href=\"https:\/\/www.kordia.co.nz\/\" target=\"_blank\" rel=\"noreferrer noopener\">Kordia<\/a>, that goes a generation back, helped us work together in bringing better outcomes for our client.&nbsp;<\/p>\n\n\n\n<div style=\"height:28px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:42px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Listening is the key driver to succeed as a solutions provider and be trusted enough to bring about results that matter. As Simon Foley, Data &amp; IT Manager of&nbsp;<a href=\"https:\/\/www.farro.co.nz\/\" target=\"_blank\" rel=\"noreferrer noopener\">Farro Fresh<\/a>, said, &#8221; throughout the whole process we felt like we were listened to and the focus of my job has changed from fire-fighting and repair&#8230; to planning and future projects.&nbsp; If I had to describe the relationship with iT360 and the partners &#8211; productive, honest, open and to a certain degree &#8211;&nbsp;absolutely invisible, the next of its kind. &#8221;&nbsp;<\/p>\n\n\n\n<p>To wrap it up, selecting the <a href=\"https:\/\/it360.co.nz\/blog\/5-ways-to-get-the-right-it-partner-for-your-business\/\">right IT partner for your business<\/a> is all about doing your homework. Use these tips to narrow down your search, or to put it more openly,&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/it360.co.nz\/contact\/\" target=\"_blank\">how can we help<\/a>?&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Weeding out the right IT support company is an important decision for any business. You don&#8217;t just randomly select tech service providers from Google search. You want to feel comfortable with your choice since they will help keep your business operating without a glitch. You will need a reliable provider to make sure that your [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":5423,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[12],"tags":[],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5421"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=5421"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5421\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/5423"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=5421"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=5421"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=5421"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}