{"id":5614,"date":"2019-07-16T13:00:00","date_gmt":"2019-07-16T01:00:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=5614"},"modified":"2021-06-25T09:01:23","modified_gmt":"2021-06-24T21:01:23","slug":"case-study-farro-fresh-focus-on-customers-instead-of-security-issues-causing-inefficiencies","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/case-study-farro-fresh-focus-on-customers-instead-of-security-issues-causing-inefficiencies\/","title":{"rendered":"[Case Study] How We Helped Farro Fresh Focus More on Their Customers Instead of Worrying About Security Issues Causing Inefficiencies"},"content":{"rendered":"\n<p><a href=\"https:\/\/it360.co.nz\/cases\/farro-fresh-grows-without-worrying-about-it-issues\/\">Farro Fresh<\/a>, a boutique supermarket chain, was experiencing security issues in their business. This prevented them from serving their customers fully. <\/p>\n\n\n\n<p>Watch the video below&#8230;<\/p>\n\n\n\n<p><script src=\"https:\/\/fast.wistia.com\/embed\/medias\/uj7yqel9q7.jsonp\" async=\"\"><\/script><script src=\"https:\/\/fast.wistia.com\/assets\/external\/E-v1.js\" async=\"\"><\/script><\/p>\n\n\n\n<div class=\"wistia_responsive_padding\" style=\"padding: 56.25% 0 0 0; position: relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height: 100%; left: 0; position: absolute; top: 0; width: 100%;\">\n<div class=\"wistia_embed wistia_async_uj7yqel9q7 videoFoam=true\" style=\"height: 100%; position: relative; width: 100%;\">\n<div class=\"wistia_swatch\" style=\"height: 100%; left: 0; opacity: 0; overflow: hidden; position: absolute; top: 0; transition: opacity 200ms; width: 100%;\"><figure><img style=\"filter: blur(5px); height: 100%; object-fit: contain; width: 100%;\" src=\"https:\/\/fast.wistia.com\/embed\/medias\/uj7yqel9q7\/swatch\" alt=\"\" aria-hidden=\"true\" title=\"\"><\/figure><\/div>\n<\/div>\n<\/div>\n<\/div>\n\n\n\n<p>Earlier this year, we interviewed Bryce Howard, CEO of Farro Fresh, about the challenges they were facing and where they are now after working with us. <\/p>\n\n\n\n<h2>Farro Fresh Background<\/h2>\n\n\n\n<p>“So we&#8217;re a boutique supermarket chain that has been set up in Auckland starting about 2006. And starting from one store, small beginning, 10 people, and from there we&#8217;ve grown to six supermarkets, have about 350 full-timers, and we&#8217;re covering most of Auckland.”  <\/p>\n\n\n\n<p>Bryce then goes to explain the importance of digital technology to their business&#8230;<\/p>\n\n\n\n<p>“The digital technology for Farro is imperative for our business. We need a system that is both stable and operational seven days a week, 12 hours a day, and without that, we won&#8217;t have a business.” <\/p>\n\n\n\n<p>And as is often the case with most New Zealand businesses, they don’t think about protecting their data and other information&#8230;until something happens. <\/p>\n\n\n\n<p>“The security aspect is quite interesting. You don&#8217;t realize how important it is until you have an incursion. We&#8217;ve certainly learned the hard way, learned a couple of times that the security of the network is of utmost importance.”<\/p>\n\n\n\n<p>In fact, that’s <a href=\"https:\/\/it360.co.nz\/blog\/15-cybersecurity-myths-business-owners-should-leave-behind\/\">one of the most common myths<\/a> SMB owners came to believe in — “I’m a small business, no one would target me.” But as you may already know by now, <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-101-guide-to-protecting-your-business-online\/\">most cyber attacks aren’t targeted<\/a>. <\/p>\n\n\n\n<p>For example, the most common type of attack, email phishing, isn’t sent to a single person or a company. It’s sent to pretty much everyone in the cyber criminal’s database — which <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">most likely would include yours<\/a>. <\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>We come in in the morning, we focus on making great products, selling to our customers, and we&#8217;re not having to worry about whether we&#8217;re having an incursion or a security issue. <\/p><cite>Bryce Howard, CEO<\/cite><\/blockquote>\n\n\n\n<h2>Importance of Relationships<\/h2>\n\n\n\n<p>One of the feedback we often get from our customers is that we don’t treat them as clients; rather, treat them as family. But don’t just take our word for it. Check out our <a href=\"https:\/\/g.page\/iT360\" target=\"_blank\">reviews on Google<\/a>.<\/p>\n\n\n\n<p>David Wilson, iT360’s General Manager, talks about this relationship more. <\/p>\n\n\n\n<p>“We came to work with Farro actually because of relationships. My father had been working with Bryce for many, many years back at Tasti Products, actually. He realized the situation of IT in the business at the time and reached out to us to help. Because of that relationship and the fact that Dad had built trust with Bryce over so many years, it just meant that Bryce could say to us, &#8220;I know you can take care of this job, and I trust you.&#8221; <\/p>\n\n\n\n<h2>Systems Thinking vs Bandaid Solution<\/h2>\n\n\n\n<p>We’ve been in the business for <a href=\"https:\/\/it360.co.nz\/about\/\">over 25 years<\/a>. We’ve had our share of comments and feedback from various customers across different industries. <\/p>\n\n\n\n<p>One of the most common issue we often hear is service providers (like us) often recommend solutions to fix the symptoms. And as you already know, targeting the symptoms vs the underlying solutions isn’t a good strategy. While it does seem ok in the short-term, eventually, this creates more problems for the business. <\/p>\n\n\n\n<p>That’s why we always make sure we understand the situation fully before recommending something. <\/p>\n\n\n\n<p>And that was the same thing with Farro. <\/p>\n\n\n\n<p>Dave goes on to continue, “it was a business that actually needed something done in almost every area of IT, and we managed to achieve the entire project in a very, very short window of time, without impacting any operations.” <\/p>\n\n\n\n<p>Recommending one thing might make the problem go away temporarily. But without a systemic approach, that problem will continue to rear its ugly head. <\/p>\n\n\n\n<h2>Focus on Customers Instead of Internal Issues<\/h2>\n\n\n\n<p>When asked about the results of working with iT360, Bryce said “For me, the key proof in the pudding is the fact that we don&#8217;t have to keep on thinking about the safety, security, or access of our computers.”<\/p>\n\n\n\n<p>And that’s one of the criteria every supplier or vendor should be weighed against — do they allow you to focus on your core business instead of constantly putting out fires? Are the systems running and working the way they should? Or do these issues continue coming up? <\/p>\n\n\n\n<p>Bryce continues, “We come in in the morning, we focus on making great products, selling to our customers, and we&#8217;re not having to worry about whether we&#8217;re having an incursion or a security issue. We&#8217;re continuing to have a great relationship and a great outcome from working with iT360.”<\/p>\n\n\n\n<p>To learn more about the details of how we helped Farro and other businesses like them, <a href=\"https:\/\/it360.co.nz\/success-stories\/\">check out our case studies here<\/a>. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Farro Fresh, a boutique supermarket chain, was experiencing security issues in their business. This prevented them from serving their customers fully. Watch the video below&#8230; Earlier this year, we interviewed Bryce Howard, CEO of Farro Fresh, about the challenges they were facing and where they are now after working with us. Farro Fresh Background “So [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":4786,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,10,11],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5614"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=5614"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5614\/revisions"}],"predecessor-version":[{"id":8372,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5614\/revisions\/8372"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/4786"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=5614"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=5614"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=5614"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}