{"id":5618,"date":"2019-08-06T09:00:00","date_gmt":"2019-08-05T21:00:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=5618"},"modified":"2019-12-29T17:48:39","modified_gmt":"2019-12-29T05:48:39","slug":"farro-fresh-implements-new-network-solution-partners-with-kordia","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/farro-fresh-implements-new-network-solution-partners-with-kordia\/","title":{"rendered":"Farro Fresh Implements New Network Solution, Partners with Kordia"},"content":{"rendered":"\n<p>Earlier last year, <a href=\"https:\/\/it360.co.nz\/cases\/farro-fresh-grows-without-worrying-about-it-issues\/\">Farro Fresh<\/a> implemented a new network solution to improve their security architecture. As a solutions provider, we also partner with other companies who can supplement us with the services we need to  deliver value to our customers. <\/p>\n\n\n\n<p>Enter Kordia. <\/p>\n\n\n\n<p>Upon our recommendation, Farro partnered with Kordia to deploy a new wide area network (WAN). The project also included a new internet connectivity and a new phone system. Watch this interview as Brent La Franchie of Kordia and Simon Foley, Data and IT Manager of Farro Fresh, as they talk about the project. <\/p>\n\n\n\n<div class=\"wistia_responsive_padding\" style=\"padding: 56.25% 0 0 0; position: relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height: 100%; left: 0; position: absolute; top: 0; width: 100%;\">\n<div class=\"wistia_embed wistia_async_pvqi12mkpo videoFoam=true\" style=\"height: 100%; position: relative; width: 100%;\">&nbsp;<\/div>\n<\/div>\n<\/div>\n\n\n\n<div style=\"height:50px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2>Kordia Background<\/h2>\n\n\n\n<p>Brent starts off by saying, “Kordia has been around for 70 years. Kordia is known for its broadcasting capabilities, that&#8217;s where our pedigree is, and that&#8217;s where we came from.” <\/p>\n\n\n\n<p>He then emphasizes the relationship Kordia and iT360 has in the past. It’s a <a href=\"https:\/\/it360.co.nz\/blog\/case-study-farro-fresh-focus-on-customers-instead-of-security-issues-causing-inefficiencies\/\">recurring theme<\/a> that we often emphasize ourselves. <\/p>\n\n\n\n<p>“iT360 Kordia actually have some personal roots that go a long way back. Our fathers worked together back in the technology age, way back in the 80s and 90s. I&#8217;m extremely proud that I can work alongside someone who my father worked alongside. We&#8217;re both very passionate about what we do. Both share a lot of the same values and we are both driven to get the same outcomes for our customers.”<\/p>\n\n\n\n<h2>Security Issues That Need to Be Addressed<\/h2>\n\n\n\n<p>Simon starts off by describing the security issues they were experiencing at Farro. <\/p>\n\n\n\n<p>“In late 2017, we had some security issues, and our CEO, Bryce Howard had worked with iT360.” <\/p>\n\n\n\n<p>The security issues faced by Farro hundred them from doing their work. As noted by Simon in <a href=\"https:\/\/it360.co.nz\/blog\/farro-fresh-protects-digital-technologies-using-watchguard\/\">another video<\/a>, nothing’s ever been compromised, but the incursions were preventing their staff to do their job properly. <\/p>\n\n\n\n<p>He goes on to continue by sharing his impressions of us during the early stages of the relationship. <\/p>\n\n\n\n<p>“There was an immediate level of confidence just from meeting with the guys and talking to them about what we wanted out of the relationship and what they could bring to the table.” <\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>If I had to describe the relationship with IT360 and the partners; productive, honest, open and to a certain degree absolutely invisible, and that&#8217;s the best kind.<\/p><cite>Simon Foley, Data and IT Manager<\/cite><\/blockquote>\n\n\n\n<h2>The Solution<\/h2>\n\n\n\n<p>Brent talks more about the solution and how it was implemented&#8230;<\/p>\n\n\n\n<p>“So that solution was a new wide area network, Awareness we call it. New internet connectivity, new phone system, and also some new security architecture.”<\/p>\n\n\n\n<p>“One of the clear directives was how do we transition them, to this new fantastic network, without disrupting their everyday business? So between iT360 and Kordia, we implemented a network, which sat alongside their existing network infrastructure. And then once ready, we cut that network over to the new network.” <\/p>\n\n\n\n<p>While this may sound simple on the surface, this involved a lot of moving parts from three different parties. Despite this, the switch was successful and didn’t create any disturbance in the operations of Farro Fresh. <\/p>\n\n\n\n<h2>The Results: Simon Looks Back at the Partnership<\/h2>\n\n\n\n<p>“The choice IT360 had made to partner with Kordia for us was the right one,” said Simon. “And the expertise Kordia had available was phenomenal. Throughout the whole process, we always felt that we were listened to. And the focus of my job has changed from fire fighting and repair to planning and future projects.” <\/p>\n\n\n\n<p>“If I had to describe the relationship with IT360 and the partners; productive, honest, open and to a certain degree absolutely invisible, and that&#8217;s the best kind.”<\/p>\n\n\n\n<p>To learn more about the details of how we helped Farro and other businesses like them <a href=\"https:\/\/it360.co.nz\/success-stories\/\">check out our case studies here<\/a>. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Earlier last year, Farro Fresh implemented a new network solution to improve their security architecture. As a solutions provider, we also partner with other companies who can supplement us with the services we need to deliver value to our customers. Enter Kordia. Upon our recommendation, Farro partnered with Kordia to deploy a new wide area [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":5742,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[86,6,102,10,11],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5618"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=5618"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/5618\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/5742"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=5618"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=5618"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=5618"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}