{"id":6652,"date":"2019-12-06T06:26:00","date_gmt":"2019-12-05T18:26:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=6652"},"modified":"2020-01-19T19:47:26","modified_gmt":"2020-01-19T07:47:26","slug":"microsoft-2008-end-of-support","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/microsoft-2008-end-of-support\/","title":{"rendered":"Microsoft 2008 End of Support"},"content":{"rendered":"\n<p>Is your business still running on Windows Server 2008 and 2008 R2? Or maybe even Windows SQL 2008? If you are, you’re putting your business and your data at great risk.&nbsp;<\/p>\n\n\n\n<p>As you probably already know, using outdated software has a lot of risks associated with it. While the mantra of “if it ain’t broke, don’t fix it” sounds reasonable, that only works if nothing is really broken. But in this case, Microsoft is officially ending its support for the software.&nbsp;<\/p>\n\n\n\n<iframe src=\"https:\/\/www.youtube.com\/embed\/7fr2CtmaVmI\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"560\" height=\"315\" frameborder=\"0\"><\/iframe>\n\n\n\n<h2>What End of Support Means for Your Business<\/h2>\n\n\n\n<p>If you’re still using these operating systems on your servers, it’s imperative that you remember these important dates.&nbsp;<\/p>\n\n\n\n<p>On&nbsp;<strong>January 14, 2020<\/strong>, Microsoft will end their support for both Windows Server 2008 and R2. And if you’re still using Window SQL 2008, Microsoft already ended their support last&nbsp;<strong>July 2019<\/strong>.&nbsp;<\/p>\n\n\n\n<p>End of Support (EOS) often means that the technology has lived its useful life. That means new, better, and often less expensive technology is available.&nbsp;<\/p>\n\n\n\n<p>In today’s world, using outdated technology means you can’t quickly adapt to changes in the market nor serve our customers exceptionally.&nbsp;<\/p>\n\n\n\n<p>This is important because without support from Microsoft, that means you won’t be receiving any security updates from them. And that puts your entire business at risk.&nbsp;<\/p>\n\n\n\n<h3>Problem or Opportunity<\/h3>\n\n\n\n<p>You can take a look at this end of support from two different perspectives and why you should use this time to modernise your business and migrate to Azure.&nbsp;<\/p>\n\n\n\n<p>First, it’s a way for you to avoid security breaches and compliance issues in the future. It’s also a way to lower your costs as maintaining these old\/legacy technologies is going to be more expensive.&nbsp;<\/p>\n\n\n\n<p>As their name implies, these operating systems came out in 2008. As you already know, 10 years (or more) is a very long time in the technology world.&nbsp;<\/p>\n\n\n\n<p>Just take a look at how often big tech consumer brands introduce new products. Every single year, these brands hold events and unveil the latest technological developments they have made in the past year.&nbsp;<\/p>\n\n\n\n<p>Apple, Microsoft, and Samsung — all of them made introducing new products and services yearly that it has become a widely anticipated event.&nbsp;<\/p>\n\n\n\n<h3>2008 Was Over a Decade Ago<\/h3>\n\n\n\n<p>To give you an idea of how far along we’ve come, below are some of the most&nbsp;<a href=\"https:\/\/www.wired.com\/2008\/12\/top-technology-breakthroughs-of-2008\/\" target=\"_blank\" rel=\"noopener\">well-known technological breakthroughs in 2008<\/a>:&nbsp;<\/p>\n\n\n\n<ol><li>USB 3.0<\/li><li>Apple’s App Store<\/li><li>Android<\/li><li>Flash memory\/flash drives<\/li><li>GPS on mobile devices<\/li><\/ol>\n\n\n\n<p>Today, these technologies are the standard or have already been replaced by newer versions (like USB 4.0).&nbsp;<\/p>\n\n\n\n<p>Back in 2008, on-premise and upfront licensing costs were still the norm. If you want to get a server, you’d have to pay for it upfront. If you want to buy a&nbsp;<a href=\"https:\/\/it360.co.nz\/services\/microsoft-365\/\">Microsoft Office<\/a>&nbsp;license for your computers, you’d have to buy the licenses upfront.&nbsp;<\/p>\n\n\n\n<p>Today, the&nbsp;<a href=\"https:\/\/it360.co.nz\/services\/cloud-solutions\/\">cloud<\/a>&nbsp;and pay-as-you-use models are more prevalent. Most options provide you a monthly payment scheme that scales up or down depending on your usage.&nbsp;<\/p>\n\n\n\n<h3>Future Proof Your Business<\/h3>\n\n\n\n<p>Another way to look at this is to use this event to propel your organisation into the future. By&nbsp;<a href=\"https:\/\/it360.co.nz\/futureproof\/\">updating the technology<\/a>&nbsp;you use in your business, you’re keeping up with the times and joining the digital transformation revolution.&nbsp;<\/p>\n\n\n\n<p>Digital transformation means&nbsp;<strong>relying less&nbsp;<\/strong>on on-premise, user-owned devices to a cloud-based one. This allows you to save up on costs and helps you with scalability.&nbsp;<\/p>\n\n\n\n<h2>What Are My Options As a Business<\/h2>\n\n\n\n<p>With the end of support coming soon, your business really has three options:<\/p>\n\n\n\n<ol><li>100% cloud migration<\/li><li>Hybrid configuration&nbsp;<\/li><li>Status quo<\/li><\/ol>\n\n\n\n<p>If you don’t know which option you should take, we’ll help you determine the best one for your specific situation.&nbsp;<\/p>\n\n\n\n<p>From our experience, most businesses will benefit greatly from option 1. Some will be best suited for option 2. However, doing nothing (option 3) especially with the end of support coming soon is definitely is not an option you can choose.&nbsp;<\/p>\n\n\n\n<h2>Over to you<\/h2>\n\n\n\n<p>IT is no longer a cost centre.&nbsp;<\/p>\n\n\n\n<p>In modern and successful businesses in New Zealand and all around the world, IT is treated as a business partner, as an enabler of the workforce. It’s one of the critical departments you need in order to create a strong competitive advantage.&nbsp;<\/p>\n\n\n\n<p>If you are still using Windows Server 2008\/R8, or even if you don’t know what you’re using but want to transform your business, let us know.&nbsp;<\/p>\n\n\n\n<p>You can <a href=\"tel:09 916 1180\">call us directly<\/a> or fill out the form below and someone from our team will reach out to you.&nbsp;<\/p>\n\n\n\n<script async=\"\" data-uid=\"a64123eca9\" src=\"https:\/\/it360-limited.ck.page\/a64123eca9\/index.js\"><\/script>\n\n\n\n<p>Even if you don’t know what option is the best one to take for your business, we’ll help you figure it out. The important part is you take a step towards protecting your business and securing your future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is your business still running on Windows Server 2008 and 2008 R2? Or maybe even Windows SQL 2008? If you are, you’re putting your business and your data at great risk.&nbsp; As you probably already know, using outdated software has a lot of risks associated with it. While the mantra of “if it ain’t broke, [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":6654,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[96,56,36],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/6652"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=6652"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/6652\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/6654"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=6652"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=6652"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=6652"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}