{"id":6663,"date":"2019-12-24T06:48:00","date_gmt":"2019-12-23T18:48:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=6663"},"modified":"2019-12-07T19:19:37","modified_gmt":"2019-12-07T07:19:37","slug":"build-strong-foundation","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/build-strong-foundation\/","title":{"rendered":"Build a Strong Foundation: A Prerequisite to a Successful Digital Transformation"},"content":{"rendered":"\n<p>If you want your business to undergo a successful <a href=\"https:\/\/it360.co.nz\/blog\/digital-transformation-modern-business-requirement\/\">digital transformation<\/a>, the first step you have to do is build a strong foundation. You’ll also learn why it’s critical to get this step right before anything else. <\/p>\n\n\n\n<p>Have you ever implemented a change initiative only to fail later on? No matter how big or small that change is, more often than not, you’ve experienced failure just like me and everyone else. <\/p>\n\n\n\n<p>Oftentimes, the reason for failure is <strong>not <\/strong>because the idea itself is bad. In fact, the reason you tried implementing it must mean it’s a great idea and has tons of benefits. Yet it still failed. <\/p>\n\n\n\n<p>Think back about the last change initiative you implemented that failed. Now think about\nthe one that succeeded.\n<\/p>\n\n\n\n<p>What if you could implement any change initiative, especially a big one such as digital\ntransformation, and make sure that your entire organisation accepts it?\n<\/p>\n\n\n\n<p>Some examples of these changes initiatives might be one of the following:\n<\/p>\n\n\n\n<ol><li> New\/additional reporting or meeting <\/li><li> New tech\/tool like <a href=\"https:\/\/it360.co.nz\/services\/microsoft-teams\/\">MS Teams<\/a> or Asana <\/li><li> New HR Policy<\/li><\/ol>\n\n\n\n<p>Here are three things you need to do to increase the chances of success of any change initiative&#8230; <\/p>\n\n\n\n<h2>3 Things You Need to Do to Make\nYour Change Initiative Successful\n<\/h2>\n\n\n\n<h3>1. Get real commitment from the top\n<\/h3>\n\n\n\n<p>Without a concrete commitment from the top — this includes the board, c-suite, and top management — your change initiative will most likely fail. <\/p>\n\n\n\n<p>Why?<\/p>\n\n\n\n<p>Because of accountability, or the lack of it. <\/p>\n\n\n\n<p>For example, in our own projects, oftentimes, the business owner is the one leading the\nproject. He stays on top of it, attends meetings, resolves issues, etc.\n<\/p>\n\n\n\n<p>If you recently tried to implement a change initiative (or a couple of them), your staff would\nmost likely be thinking the same thing — that this is just a fad and that no one will follow\nthrough. So, they’ll just do as little work as possible.\n<\/p>\n\n\n\n<p>Then that new initiative will fail.\n<\/p>\n\n\n\n<p>So, before implementing any change, <strong>get real commitment from the top<\/strong>. Find a sponsor who will take responsibility and accountability to the entire initiative. This person will <strong>oversee <\/strong>the entire implementation, even if he\/she will not be the one doing the implementation. This way, everyone knows that this change initiative is serious because someone from top management is overseeing it. <\/p>\n\n\n\n<h3>2. Ask input from all levels of the organisation\n<\/h3>\n\n\n\n<p>Organizational inertia is one of the things every business leader needs to overcome. What that means is your staff will <em>reject <\/em>anything that threatens the way they do things. Change does that, even if it’s beneficial for everyone.<br> The only way to combat this fear is to <strong>engage in a <a href=\"https:\/\/www.blueoceanstrategy.com\/tools\/fair-process\/\" target=\"_blank\" rel=\"noopener\">fair process<\/a><\/strong>. <\/p>\n\n\n\n<p>The key is to have an open discussion about why the adoption of the new idea is necessary. People want to know that their voices have been heard and that there are no surprises. <\/p>\n\n\n\n<p>The important part is to do this <em>before <\/em>you do anything.<\/p>\n\n\n\n<p>Avoiding this step might be easy for business owners and top management. But if you don’t do it, the chances for failure are higher. <\/p>\n\n\n\n<p>Your staff don’t want to get blindsided. Talk to them about the changes and why it’s important. Tell them what will happen if you and the entire organisation don’t succeed in this change. Discuss whether this change will affect how their jobs will change and whether this will be part of their evaluation. <\/p>\n\n\n\n<p>Resolving these questions before, during, and after the change initiative ensures that your\nentire organisation will see the real benefits of it, rather than fear the change initiative.\n<\/p>\n\n\n\n<h3>3. Shift your conversations to talk about the future\n<\/h3>\n\n\n\n<p>Out of sight, out of mind.\n<\/p>\n\n\n\n<p>That’s a phrase you’ve heard dozens of times, but might never think about it in the business context. <\/p>\n\n\n\n<p>The problem with focusing on the now is it doesn’t help you with the future. Oftentimes, the\n<em>now <\/em>is focused on <em>fire-fighting<\/em>.\n<\/p>\n\n\n\n<p>If you don’t talk and plan for the future, it means you are not prepared for when it arrives.\nRemember, what got you here won’t get you there.\n<\/p>\n\n\n\n<p>If you keep talking about the same things, doing the same things over and over, one day you will find yourself left behind by your competitors. <\/p>\n\n\n\n<h2>Over to You\n<\/h2>\n\n\n\n<p>Building a strong foundation is all about addressing the hidden\/soft issues in your organisation. <\/p>\n\n\n\n<p>If you don’t know where you’re going, or if people aren’t clear on where to go, implementing\nany change will only add to that confusion.\n<\/p>\n\n\n\n<p>That’s why it’s important to get commitment from the leadership team from the start before\nembarking on any change initiative.\n<\/p>\n\n\n\n<p>Asking for inputs from key stakeholders, even if they are ridiculous, even if the suggestions\ndon’t get implemented, that’s ok. Engaging in a discussion ensures that they get heard.\nThis is the most important part of any change initiative.\n<\/p>\n\n\n\n<p>This reduces the risk of them “sabotaging” the initiative later on.\n<\/p>\n\n\n\n<p>Lastly, shifting your conversations to the future will get everyone thinking about it. If the\nmarket is changing or heading in a certain direction, and you do nothing or continue doing\nwhat you have been doing 5 years ago, you will definitely get left behind.\n<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you want your business to undergo a successful digital transformation, the first step you have to do is build a strong foundation. You’ll also learn why it’s critical to get this step right before anything else. Have you ever implemented a change initiative only to fail later on? No matter how big or small [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":6671,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[115],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/6663"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=6663"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/6663\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/6671"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=6663"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=6663"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=6663"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}