{"id":7197,"date":"2019-12-31T06:25:00","date_gmt":"2019-12-30T18:25:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=7197"},"modified":"2020-03-30T06:10:21","modified_gmt":"2020-03-29T18:10:21","slug":"why-microsoft-teams","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/why-microsoft-teams\/","title":{"rendered":"Why Microsoft Teams"},"content":{"rendered":"\n<p>If there is a tool that helps you be more productive, would you use it? If there’s a tool that helps you collaborate with your teammates better and faster, would you use it? What if you’re already paying for it as part of some services, would you use it?&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/en.wikipedia.org\/wiki\/Usage_share_of_operating_systems\" target=\"_blank\" rel=\"noopener\">Most businesses use Windows<\/a>, capturing around 77% of the market on both laptops and desktop. With the introduction of <a href=\"https:\/\/it360.co.nz\/services\/microsoft-teams\/\">Microsoft Teams<\/a> , it’s only logical that you use this collaboration and messaging tool to increase your organisation&#8217;s productivity.&nbsp;<\/p>\n\n\n\n<div class=\"toc\"><strong>Table of Contents:<\/strong><br><em>Click on any of these to jump straight to that topic<\/em><br><br>\n<h2 class=\"d-none\">4 Reasons Why Your Business Should Use Microsoft Teams Today<\/h2>\n<ol>\n<li><a href=\"#multiplatform\">Available on all platforms<\/a><\/li>\n<li><a href=\"#privacy\">Enterprise-grade security<\/a><\/li>\n<li><a href=\"#manage\">Easily manage users — both internal and external<\/a><\/li>\n<li><a href=\"#cost\">Available at zero cost<\/a><\/li>\n<\/ol>\n<\/div>\n\n\n\n<h2>4 Reasons Your Business Should Use Microsoft Teams<\/h2>\n\n\n\n<p>Microsoft Teams is an app that allows you to communicate with your teammates anytime and anywhere. But it’s also more than just a tool that allows you to chat, call, or video conference.&nbsp;<\/p>\n\n\n\n<p>It meets all the criteria you need for choosing a collaboration software.&nbsp;<\/p>\n\n\n\n<h3 id=\"multiplatform\">1. Multi-platform to enable being on-the-go<\/h3>\n\n\n\n<p>First, it’s a multi-platform app. Whether you’re using a Mac or Windows, on-the-go on your mobile phone, or in the office, you can take MS Teams along with you.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\">\n<p>But that doesn’t mean you have to sacrifice your productivity and weekends by getting constant notifications when you’re not working.&nbsp;<\/p>\n\n\n\n<p>One of the great features of MS Teams is the ability to setup quiet hours and quiet days.&nbsp;<\/p>\n\n\n\n<p>Let’s say you work only on weekdays and from 9-5. You value your personal time so you don’t want work to “bleed” into your nights and weekends. You can set MS Teams to only send you notifications during those times. Or, to be more specific, you set what time you don’t want to be disturbed.&nbsp;<\/p>\n<\/div>\n\n\n\n<div class=\"wp-block-column\">\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img width=\"201\" height=\"399\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/ch2_quiet_hours.gif\" alt=\"Quiet Hours in Microsoft Teams\" class=\"wp-image-7198\" title=\"\"><\/figure><\/div>\n<\/div>\n<\/div>\n\n\n\n<h3 id=\"privacy\">2. Never worry about your privacy and security<\/h3>\n\n\n\n<p>Next, it’s built with privacy and security in mind. Everything is encrypted automatically, so you don’t have to worry about privacy issues.&nbsp;<\/p>\n\n\n\n<p>If you want to learn more about the technical aspect, you can visit&nbsp;<a href=\"https:\/\/docs.microsoft.com\/en-us\/microsoftteams\/security-compliance-overview\" target=\"_blank\" rel=\"noopener\">Microsoft’s compliance page<\/a>&nbsp;dedicated to this topic.&nbsp;<\/p>\n\n\n\n<h3 id=\"manage\">3. Manage your entire organisation easily&nbsp;<\/h3>\n\n\n\n<p>For business owners and IT administrators, user level access is simple and easy to do. It allows you easily add, remove, and manage access to certain teams and channels.&nbsp;<\/p>\n\n\n\n<p>One of the best things about MS Teams is its ability to add guests or external people to your account.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img width=\"408\" height=\"213\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/ch2_add_guests.png\" alt=\"How to Add Guests in MS Teams\" class=\"wp-image-7223\" title=\"\"><\/figure><\/div>\n\n\n\n<p>For most companies who want to remain small and agile, they hire or work with external freelancers and consultants. Because they are not “part” of the organisation, your company policy might not be able to grant them an email address (thus not allowing them access to your company’s MS Teams account).&nbsp;<\/p>\n\n\n\n<p>But that doesn’t mean you can’t work with people outside your organisation. On the contrary, you can invite them as guests to specific channels or teams so you can collaborate with them easily.&nbsp;<\/p>\n\n\n\n<p>This means you won’t have to switch between Teams and Skype (which is what’s used oftentimes) all the time. This means you won’t miss any important message or updates from each other.&nbsp;<\/p>\n\n\n\n<h3 id=\"cost\">4. No added cost for your organisation<\/h3>\n\n\n\n<p>Whether you’re running Windows or Mac, your business can use MS Teams for free. That’s right. For no added cost, you can gain all the benefits I just mentioned above.&nbsp;<\/p>\n\n\n\n<p>Of course, the free plan has its limitations. But for most businesses, it’s enough to get them started. If you want to learn more, you can&nbsp;<a href=\"https:\/\/products.office.com\/en\/microsoft-teams\/free\" target=\"_blank\" rel=\"noopener\">compare the different MS Teams plan here<\/a>.&nbsp;<\/p>\n\n\n\n<p>But, if you are already an Office 365 user, you don’t need to pay anything extra to take advantage of Teams. It’s also going to be easier to implement since every user will have their own email account already. That means they can simply “join” your company account using their email. No additional setup required.&nbsp;<\/p>\n\n\n\n<h2>What’s Next<\/h2>\n\n\n\n<p>Communication is vital to the success of any organisation.&nbsp;<\/p>\n\n\n\n<p>If you are constantly having trouble reaching your team and colleagues, you’re wasting a lot of time and effort. That means you’re not communicating fast enough. That means you’re not able to launch campaigns or new products faster. That means you’re not able to capitalize on opportunities in the market. <a href=\"https:\/\/it360.co.nz\/blog\/why-your-team-wants-teams\/\">Find out why your team wants Microsoft Teams<\/a>.<\/p>\n\n\n\n<p>Learn more about how Microsoft Teams is used by different organisations. Use them as an inspiration so you can transform your business. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>If there is a tool that helps you be more productive, would you use it? If there’s a tool that helps you collaborate with your teammates better and faster, would you use it? What if you’re already paying for it as part of some services, would you use it?&nbsp; Most businesses use Windows, capturing around [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":7240,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[109],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7197"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=7197"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7197\/revisions"}],"predecessor-version":[{"id":7968,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7197\/revisions\/7968"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/7240"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=7197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=7197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=7197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}