{"id":7828,"date":"2020-02-04T07:50:00","date_gmt":"2020-02-03T19:50:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=7828"},"modified":"2020-02-28T22:39:02","modified_gmt":"2020-02-28T10:39:02","slug":"work-better-implementing-hub-for-teamwork","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/work-better-implementing-hub-for-teamwork\/","title":{"rendered":"Work Better: Implementing a Hub for Teamwork"},"content":{"rendered":"\n<p>One of the signs your organisation has kept up with the&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/digital-transformation-modern-business-requirement\/\">digital age<\/a>&nbsp;is the use of a&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/top-collaboration-software-for-new-zealand-businesses\/\">collaboration tool or software<\/a>.&nbsp;<\/p>\n\n\n\n<p>Have you ever experienced any of these scenarios?&nbsp;<\/p>\n\n\n\n<ul><li>Sent numerous emails but don’t get replies<\/li><li>Can’t seem to find the conversation you had with a customer or colleague<\/li><li>Misunderstood each other from an email (or SMS) because of the lack of context&nbsp;<\/li><\/ul>\n\n\n\n<p>Now, think about the repercussions of these things in your business. If you can’t get a&nbsp;<em>timely<\/em>&nbsp;reply from your boss, colleague, or supplier, it would cause delays in any projects you are working on.&nbsp;<\/p>\n\n\n\n<p>If that’s related to a product launch, that would mean you’d be incurring additional expenses&nbsp;<em>and<\/em>&nbsp;losing potential revenues.&nbsp;<\/p>\n\n\n\n<p>What if you could avoid all these issues\/scenarios and instead focus on working collaboratively with your team?&nbsp;<\/p>\n\n\n\n<p>In this article, you will learn how you can use&nbsp;<a href=\"https:\/\/it360.co.nz\/services\/microsoft-teams\/\">Microsoft Teams<\/a>&nbsp;to overcome these kinds of issue, and take advantage of it so you can adapt to changes in the market faster.&nbsp;<\/p>\n\n\n\n<p>Microsoft Teams is an app that allows you to communicate with your teammates anytime and anywhere.&nbsp;<\/p>\n\n\n\n<p>Yes, it allows your organization to chat or message one another. But it goes beyond that. It also features calls, video conferencing, and screen sharing.&nbsp;<\/p>\n\n\n\n<h2>4 Reasons to Implement MS Teams&nbsp;<\/h2>\n\n\n\n<p>MS Teams meets all the&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/why-microsoft-teams\/\">criteria you need for choosing a collaboration software<\/a>.&nbsp;<\/p>\n\n\n\n<p>First, it’s a&nbsp;<strong>multi-platform app<\/strong>. Whether you’re using a Mac or Windows, on-the-go on your mobile phone, or in the office, you can take MS Teams along with you.&nbsp;<\/p>\n\n\n\n<p>Next, it’s&nbsp;<strong>built with privacy and security<\/strong>&nbsp;in mind. Everything is encrypted automatically, so you don’t have to worry about privacy issues.&nbsp;<\/p>\n\n\n\n<p>For business owners and IT administrators,&nbsp;<strong>user level access<\/strong>&nbsp;is simple and easy to do. You can easily create accounts for each member of the team, and even add guests or outsiders like your customers, partners, or other contractors.&nbsp;<\/p>\n\n\n\n<p>Lastly, if you’re already using Microsoft products, then you’re most likely paying for MS Teams already. That means you&nbsp;<strong>don’t have to pay<\/strong>for anything additional to increase your organization’s productivity.&nbsp;<\/p>\n\n\n\n<h2>How to Use Microsoft Teams: 3 Key Capabilities You Need to Know<\/h2>\n\n\n\n<p>In the previous article, we mentioned that the&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/build-strong-foundation\/\">success of any change initiative<\/a>&nbsp;lies in the commitment of leadership, gaining inputs from key stakeholders, and focusing on the future instead of the now.&nbsp;<\/p>\n\n\n\n<p>We won’t go into the technical details of how to implement MS Teams, rather, below are 3 key capabilities you need to know.&nbsp;<\/p>\n\n\n\n<h3>1. The Right Message for the Right Time (Context) <\/h3>\n\n\n\n<p>In MS Teams, you can chat\/message an individual or a group of people. You can also call, leave a voice message, or have a video meeting with them.&nbsp;<\/p>\n\n\n\n<p>Just think of the last time you read an email and thought your colleague was being rude to you only to find out later that he was just making a joke.&nbsp;<strong>Context is often lost<\/strong>&nbsp;in written communication, like email.&nbsp;<\/p>\n\n\n\n<p>Or just think of the last time you were emailing back-and-forth with a colleague only to find out later that you were talking about two different projects?&nbsp;<\/p>\n\n\n\n<p>While the best form of communication is still face-to-face, sometimes, that is impossible because of the nature of our work. Sometimes, our work requires us to travel or work with remote teammates.&nbsp;<\/p>\n\n\n\n<p>So, if you were to hop on a call together, that misunderstanding could have been avoided. In just a few clicks, you can do all of them inside MS Teams.&nbsp;<\/p>\n\n\n\n<h3>2. Recordings and Screen Sharing<\/h3>\n\n\n\n<p>Meetings are a fact of organizational life.&nbsp;<\/p>\n\n\n\n<p>As a professional, you meet with your boss, your peers, your subordinates (or staff). Outside the organisation, you meet with customers, partners and vendors.&nbsp;<\/p>\n\n\n\n<p>As we rely on more people to get our own work done, it’s imperative that we work smarter and avoid\/reduce misunderstandings.&nbsp;<\/p>\n\n\n\n<p>MS Teams allows you to use a different medium to communicate more effectively. You can use chat\/messaging, calls, or leave voice notes.&nbsp;<\/p>\n\n\n\n<p>See related:&nbsp;<a href=\"https:\/\/it360.co.nz\/blog\/microsoft-teams-vs-skype-for-business\/\">Microsoft Teams vs Skype for Business<\/a><\/p>\n\n\n\n<p>But one of the most-used feature of Teams is the ability to do video calls. It’s the&nbsp;<em>modern&nbsp;<\/em>way of meeting where it looks and feels like you are meeting face-to-face. During the call, you can also share your screen as if you were presenting in front of them.&nbsp;<\/p>\n\n\n\n<p>You can also record the call so that you can later go back to it, or if someone was late or couldn’t make it, they can review and watch the meeting itself. There’s no more need to spend time catching up your colleague.&nbsp;<\/p>\n\n\n\n<h3>3. Integrations<\/h3>\n\n\n\n<p>MS Teams also allow you to work together with your team more efficiently.&nbsp;<\/p>\n\n\n\n<p>Teams allow you to add integrations like embedding an Excel spreadsheet directly so you or anyone else who needs to update or view it can do so without opening Excel or leaving the Teams app.&nbsp;<\/p>\n\n\n\n<p>For channels dedicated to certain projects, you can add all the notes in one place (wiki). This can include a brief background on the project plus decisions made over time. This benefits everyone because the notes only exist in one place, guaranteeing that it’s the most up-to-date version.&nbsp;<\/p>\n\n\n\n<p>If you have a project management software that you’re using, like Asana, you can also add your projects directly. This way, everyone can stay on the same page and can add\/update\/modify\/know the status in real time.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the signs your organisation has kept up with the&nbsp;digital age&nbsp;is the use of a&nbsp;collaboration tool or software.&nbsp; Have you ever experienced any of these scenarios?&nbsp; Sent numerous emails but don’t get replies Can’t seem to find the conversation you had with a customer or colleague Misunderstood each other from an email (or SMS) [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":7848,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[13,109],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7828"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=7828"}],"version-history":[{"count":1,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7828\/revisions"}],"predecessor-version":[{"id":7829,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7828\/revisions\/7829"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/7848"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=7828"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=7828"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=7828"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}