{"id":7842,"date":"2020-02-11T10:00:00","date_gmt":"2020-02-10T22:00:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=7842"},"modified":"2020-02-28T22:35:15","modified_gmt":"2020-02-28T10:35:15","slug":"teams-vs-email-which-communication-medium-can-adapt-to-your-business-needs","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/teams-vs-email-which-communication-medium-can-adapt-to-your-business-needs\/","title":{"rendered":"Teams vs Email: Which Communication Medium Can Adapt to Your Business Needs?"},"content":{"rendered":"\n<p>Quick question — do you love email?&nbsp;<\/p>\n\n\n\n<p>If you’re like most people, you probably don’t. But, it’s a necessary evil. It’s still the most&nbsp;<a href=\"https:\/\/www.entrepreneur.com\/article\/314359\" target=\"_blank\" rel=\"noopener\">preferred medium of communication in business<\/a>.&nbsp;<\/p>\n\n\n\n<p>But did you know that email was invented in the 1970s? It’s almost 50 years since then. The way we use it has remained relatively the same — send one message to another, wait for their reply, read that reply some time in the future, and back all over again.&nbsp;<\/p>\n\n\n\n<p>But, the work we do today has evolved a lot. It requires faster communication and frequent collaboration. That’s why relying on email isn’t enough.&nbsp;That&#8217;s why tools like <a href=\"https:\/\/it360.co.nz\/services\/microsoft-teams\/\">Microsoft Teams<\/a> are being used by thousands of businesses around the world to transform their business. <\/p>\n\n\n\n<h2>4 Reasons Why Email Is Not Enough<\/h2>\n\n\n\n<p>Adobe conducted a <a href=\"https:\/\/www.slideshare.net\/adobe\/2019-adobe-email-usage-study\" target=\"_blank\" rel=\"noopener\">Consumer Email Study<\/a> last year. One of the biggest takeaways in that study is that we spend a lot of time sending emails and following up on the emails we just sent.&nbsp;<\/p>\n\n\n\n<p>Phrases like…<\/p>\n\n\n\n<ul><li>now sure if you saw my last email, or<\/li><li>per my last email, or&nbsp;<\/li><li>any updates on this, or&nbsp;<\/li><li>as discussed&nbsp;<\/li><\/ul>\n\n\n\n<p>…were at the top of the list of the most annoying phrases people use at work.&nbsp;<\/p>\n\n\n\n<p>As you have most likely experienced, email is easy to ignore.&nbsp;<\/p>\n\n\n\n<p>Plus, with multiple people and organizations constantly spamming our email accounts, it makes it difficult to focus on the important ones in our inbox.&nbsp;<\/p>\n\n\n\n<p>And if you’re like most people, you probably have multiple email accounts and receive hundreds of emails a day. This adds another layer of complexity and opens up a lot of other issues.&nbsp;<\/p>\n\n\n\n<p>But if you want to get ahead, there has got to be a better way, right?&nbsp;<\/p>\n\n\n\n<h3>1. Today’s Work Requires More Collaboration and Communication<\/h3>\n\n\n\n<p>The first reason why email is not enough is today’s work requires more collaboration and frequent communication with other people. More often than not, your work, including the work your entire organization does, rely on other people’s input.&nbsp;<\/p>\n\n\n\n<p>Imagine two businesses with the exact same resources, selling the exact same products. The only difference is the brand\/company name. They are both in the same starting position.&nbsp;<\/p>\n\n\n\n<p>Company A decided to adapt a modern approach to work — i.e. to use technology to communicate with each other faster and collaborate easier; while Company B remains status quo.&nbsp;<\/p>\n\n\n\n<p>Who do you think will get ahead in 3-, 6-, 12- months’ time? Who do you think can launch faster and better products? Which one will be able to resolve new issues that come up during the course of business?&nbsp;<\/p>\n\n\n\n<h3>2. Short One-Off Questions in Emails Are Prevalent<\/h3>\n\n\n\n<p>According to a report by the McKinsey Global Institute, the average employee&nbsp;<a href=\"https:\/\/fsd.servicemax.com\/2018\/01\/09\/8-reasons-email-is-ineffective-in-workplace\/\" target=\"_blank\" rel=\"noopener\">spends 13 hours a week<\/a>&nbsp;checking, reading, and responding to email. That’s over 30% of the entire work week.&nbsp;In the Adobe study, this number was 17 hours per week — or roughly 42% of the work week. <\/p>\n\n\n\n<p>Email isn’t meant for real-time communication and collaboration. If you emailed your boss asking a clarifying question and she doesn’t get back to until after 2 days, you’ve already lost those 2 days.&nbsp;<\/p>\n\n\n\n<p>And this can extend to your colleagues and teammates, suppliers and vendors, and even customers. Imagine how much time you will lose if that person doesn’t reply to your email.&nbsp;<\/p>\n\n\n\n<p>Now, think about the effect to these delays to your organisation? Product launches? Extended R&amp;Ds? Growing number of irritated customers?&nbsp;<\/p>\n\n\n\n<h3>3. Email Makes Remote Work Difficult <\/h3>\n\n\n\n<p>Third, with the advent of technology, specifically the internet, it allowed for people to be <a href=\"https:\/\/it360.co.nz\/blog\/modern-workforce\/\">more mobile<\/a>. The internet gave people and companies the ability to work from anywhere.&nbsp;<\/p>\n\n\n\n<p>For example, a team member might be working at a nearby cafe and get a lot more work done than being in the office.&nbsp;<\/p>\n\n\n\n<p>Unlike before the rise of the internet and technology, most work were tangible. You literally see, feel, count, and assess them. For example, a shoemaker produces shoes. A car manufacturer produces cars.&nbsp;<\/p>\n\n\n\n<p>But today, a programmer can write code for months or years before the something tangible comes out of it (e.g. the new iOS 13 of Apple, or a new game).&nbsp;<\/p>\n\n\n\n<p>That’s why frequent communication is essential in today’s competitive environment.&nbsp;<\/p>\n\n\n\n<h3>4. You Limit Yourself With Local Talent <\/h3>\n\n\n\n<p>One of the trends in the workplace right now is companies can take advantage of globalization. Organisations are no longer limited by the talent they find locally.&nbsp;<\/p>\n\n\n\n<p>With technology, you can tap the best talent you can find and work with them even if they are halfway across the globe.&nbsp;<\/p>\n\n\n\n<p>If you’re only using email, this will make it difficult for you to take advantage of their skills and talent. As mentioned earlier, frequent communication and constant collaboration is the hallmark of the today’s work.&nbsp;<\/p>\n\n\n\n<p>If the team member who is halfway around the world doesn’t get the chance to mingle and develop a good working relationship with the others, that remote member will most likely leave in a couple of weeks.&nbsp;<\/p>\n\n\n\n<h2>What’s Next<\/h2>\n\n\n\n<p>Microsoft dominates 72% of all desktop and laptop computers in the world with their operating system — Windows. And if you’re using Windows, you are most likely be using <a href=\"https:\/\/it360.co.nz\/blog\/empower-your-business-with-office-365\/\">Microsoft Office<\/a> suites — like Word, Excel, and PowerPoint.&nbsp;<\/p>\n\n\n\n<p>That means you are most likely paying (or paid) for MS Teams already.&nbsp;<\/p>\n\n\n\n<p>So, if you’re paying for it already, and you know that it will make your communications better, why not make use of it? And if not, MS Teams has a free version that you can take advantage of in your organisation.&nbsp;<\/p>\n\n\n\n<p>The world is constantly evolving. That means if you want to thrive, you also have to adapt to these changes. And that means providing your organisation with tools to make them more productive. It means enabling them so they can spend less time worrying about internal issues, and instead focus on what really matters — your customers.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Quick question — do you love email?&nbsp; If you’re like most people, you probably don’t. But, it’s a necessary evil. It’s still the most&nbsp;preferred medium of communication in business.&nbsp; But did you know that email was invented in the 1970s? It’s almost 50 years since then. The way we use it has remained relatively the [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":7845,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[13,121,109],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7842"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=7842"}],"version-history":[{"count":2,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7842\/revisions"}],"predecessor-version":[{"id":7846,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/7842\/revisions\/7846"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/7845"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=7842"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=7842"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=7842"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}