{"id":8041,"date":"2020-03-24T06:33:00","date_gmt":"2020-03-23T18:33:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=8041"},"modified":"2020-06-15T07:19:50","modified_gmt":"2020-06-14T19:19:50","slug":"using-ms-teams-for-internal-communication-5-different-options","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/using-ms-teams-for-internal-communication-5-different-options\/","title":{"rendered":"Using MS Teams for Internal Communication: 5 Different Options"},"content":{"rendered":"\n<p>In today’s world, we often have a plethora of available tools available for us to communicate with our friends, family, and colleagues in the workplace.&nbsp;<\/p>\n\n\n\n<p>While this is very convenient, this availability of single-use tools or apps makes it very confusing and time-consuming whenever we need to find that conversation again.&nbsp;<\/p>\n\n\n\n<p>This is very crucial, especially in the workplace. Imagine the inefficiency when you send an email back to your boss, customer, or colleague saying that you can’t find the data for the report they sent you last week.&nbsp;<\/p>\n\n\n\n<p>In this article, I’ll share the different ways you can communicate inside MS Teams and how you can use them to tailor your communication and be more effective.&nbsp;<\/p>\n\n\n\n<h2>5 Ways to Communicate Inside Microsoft Teams<\/h2>\n\n\n\n<p>Have you ever thought about communication in general?&nbsp;<\/p>\n\n\n\n<p>Think about the last time you sent a thank you card to someone you interviewed with in the mail, or a phone call to your spouse.&nbsp;<\/p>\n\n\n\n<p>Communication, at its simplest definition, is made up of someone sending a message using a medium to someone else.&nbsp;<\/p>\n\n\n\n<p>In our analogy above, you’d see the different aspects in play:&nbsp;<\/p>\n\n\n\n<ul><li>Thank You Card<ul><li>You — the sender<\/li><li>Card — includes both the message and the medium<\/li><li>Interviewer — recipient&nbsp;<\/li><\/ul><\/li><li>Phone Call<ul><li>You — sender (and recipient)&nbsp;<\/li><li>Phone — medium<\/li><li>Conversation — message<\/li><li>Spouse — recipient (and sender)&nbsp;<\/li><\/ul><\/li><\/ul>\n\n\n\n<p>At work, and life in general, we communicate with other people in a variety of ways. But, we often don’t think about the recipient and the best way to send our message across.&nbsp;<\/p>\n\n\n\n<p>Communicating effectively means using a different medium depending on the person (or people) you’re talking to and the type of message you’re trying to convey.&nbsp;<\/p>\n\n\n\n<p>For example, a short question or an update might do well in a written form, while a discussion on a topic or project will do better in a call.&nbsp;<\/p>\n\n\n\n<p>In Microsoft Teams, you can use different types of medium to communicate more effectively and avoid misunderstandings.&nbsp;<\/p>\n\n\n\n<h3>1. Chat: 1-on-1 or group chats<\/h3>\n\n\n\n<p>The most-used feature of Teams is chats. You can chat 1-on-1, or participate in group or team chats. It really depends on the topic or conversation.<\/p>\n\n\n\n<p>For example, let’s say you are working on a project with your team, or simply want to chat about relevant updates in the industry. There are 15 of you in the team. All topics and discussions about the project goes here. Everyone who is part of the channel gets to see and can participate in the chat.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"612\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/ch7_team_conversation-1024x612.png\" alt=\"1 on 1 Chats inside MS Teams\" class=\"wp-image-7206\" title=\"\"><\/figure>\n\n\n\n<p>But if you’re requesting for a leave from your boss, that conversation might be better using a private or 1:1 chat.&nbsp;<\/p>\n\n\n\n<h3>2. Voice notes<\/h3>\n\n\n\n<p>Sometimes, you’re on-the-go, or you’re doing something with your hands. Or simply want to send a quick update or message and don’t have time (or being lazy about it) to type on the keyboard.&nbsp;<\/p>\n\n\n\n<p>Teams offers the ability to leave voice notes\/messages.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"750\" height=\"1288\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/ch7_voice_memos.gif\" alt=\"How to leave voice notes in MS Teams\" class=\"wp-image-7208\" title=\"\"><\/figure>\n\n\n\n<p>Just like chats, this can be sent to a person (private chat) or to a group.&nbsp;<\/p>\n\n\n\n<h3>3. Calls<\/h3>\n\n\n\n<p>You already know that written messages can often be misinterpreted (and is often a big cause for misunderstandings). The main reason for this is written communication often lack an important part of communication like tone.&nbsp;<\/p>\n\n\n\n<p>So, for conversations that require back-and-forth discussion, it’s best to get on a call. It’s easier, faster, and helps avoid miscommunication.&nbsp;<\/p>\n\n\n\n<p>While you can do this with your phone, why not take advantage of “free” calls inside Teams directly?&nbsp;<\/p>\n\n\n\n<p>The best part is you can also call people outside your organisation.&nbsp;<\/p>\n\n\n\n<h3>4. Video calls<\/h3>\n\n\n\n<p>One of the best ways to meet with other people is face-to-face. No one can doubt that. Body language, or non-verbal communication, makes up over 50% of the communication and is lost on calls and chats and email.&nbsp;<\/p>\n\n\n\n<p>But because of the changing demands of work, it becomes necessary that we adapt as well.&nbsp;<\/p>\n\n\n\n<p>That’s how video conferencing comes in.&nbsp;<\/p>\n\n\n\n<p>We can meet with people who are across the globe, or at another location, or in the airport, as if we were meeting with them face-to-face.&nbsp;<\/p>\n\n\n\n<p>You’ll learn more about this in the next chapter.&nbsp;<\/p>\n\n\n\n<h3>5. Video recordings<\/h3>\n\n\n\n<p>This last type of media available in MS Teams is often used for people who can’t attend a meeting with their colleagues. It’s a great way to catch up on what happened as if you were there too.&nbsp;<\/p>\n\n\n\n<p>For example, you have a weekly recurring meeting with your team that discusses strategies, projects, and updates. For some reason, you have to be on a plane that exact time.&nbsp;<\/p>\n\n\n\n<p>Everyone is busy and can’t reschedule.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"912\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2019\/12\/ch7_video_recording-1024x912.png\" alt=\"video recordings in MS Teams\" class=\"wp-image-7207\" title=\"\"><\/figure>\n\n\n\n<p>If anyone from the team records the call, the recording will be available for everyone to see in just a few minutes. So, even if you were on a plane, you can catch up with the entire call after you land. This includes all discussions and even the presentations itself.&nbsp;<\/p>\n\n\n\n<h2>What’s Next<\/h2>\n\n\n\n<p>MS Teams allows you to communicate with your team in various forms\/ or media that allow you to send your message more effectively.&nbsp;<\/p>\n\n\n\n<p>You can use private chats and messages, conduct phone calls, and video calls.&nbsp;<\/p>\n\n\n\n<p>In the next chapter, you’ll learn more about how to use MS Teams to conduct instant meetings.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In today’s world, we often have a plethora of available tools available for us to communicate with our friends, family, and colleagues in the workplace.&nbsp; While this is very convenient, this availability of single-use tools or apps makes it very confusing and time-consuming whenever we need to find that conversation again.&nbsp; This is very crucial, [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":8054,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[81],"tags":[109],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8041"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=8041"}],"version-history":[{"count":2,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8041\/revisions"}],"predecessor-version":[{"id":8059,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8041\/revisions\/8059"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/8054"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=8041"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=8041"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=8041"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}