{"id":8076,"date":"2020-06-16T09:34:00","date_gmt":"2020-06-15T21:34:00","guid":{"rendered":"https:\/\/it360.co.nz\/?p=8076"},"modified":"2020-06-29T06:55:01","modified_gmt":"2020-06-28T18:55:01","slug":"implementing-teams-in-your-organization-how-to-implement-microsoft-teams","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/implementing-teams-in-your-organization-how-to-implement-microsoft-teams\/","title":{"rendered":"Implementing Teams in Your Organization: How to Implement Microsoft Teams"},"content":{"rendered":"\n<p>Implementing change is one of the most difficult things business leaders face in their organizations. Oftentimes, the main reason change efforts fail is there is not enough buy-in from end-users themselves.<\/p>\n\n\n\n<p>Why?<\/p>\n\n\n\n<p>Because they were left out in the decision-making process. In this article, we&#8217;ll show you how you can introduce new technology (or systems, or processes, or tools) in order to minimize failure and increase changes of adaption.<\/p>\n\n\n\n<script src=\"https:\/\/fast.wistia.com\/embed\/medias\/bxc0p2kf1c.jsonp\" async=\"\"><\/script><script src=\"https:\/\/fast.wistia.com\/assets\/external\/E-v1.js\" async=\"\"><\/script><span class=\"wistia_embed wistia_async_bxc0p2kf1c popover=true popoverAnimateThumbnail=true\" style=\"display:inline-block;height:338px;position:relative;width:600px\">&nbsp;<\/span> <br><br>\n\n\n\n<h2>3 Ways to Increase Success of Implementing MS Teams<\/h2>\n\n\n\n<p>At this point, you already know the benefits of using <a href=\"https:\/\/it360.co.nz\/services\/microsoft-teams\/\">MS Teams<\/a> and how you can use it to make yourself and everyone in your business more productive.<\/p>\n\n\n\n<p>But, your staff might not know that, nor believe in it. Below are 4 things you should consider when you want to implement some changes in your organisation.<\/p>\n\n\n\n<h3>1. Solve the Right Problems<\/h3>\n\n\n\n<p>The first thing you need to do is make sure that the solution you are proposing (in this case MS Teams) will really help your team solve their problems. This means taking the time to <strong>sit down with key people<\/strong> to learn about what’s happening in their day-to-day activities.<\/p>\n\n\n\n<p>Your people are busy, just like you.<\/p>\n\n\n\n<p>Simply adding more tools for them to use makes it difficult because of the learning curve and the organization inertia you need to overcome. If they are not invested in it, no one will use it.<\/p>\n\n\n\n<p>Getting clear on what problems you plan on solving and why people need to change is one of the first things you should deal with. <\/p>\n\n\n\n<p>For example, are people having problems about too much emails? Or are they emailing files to each other and end up with lots of versions of the same one? <\/p>\n\n\n\n<p>Or perhaps you want a new way to work with your customers by having a single portal for communication? <\/p>\n\n\n\n<p>Knowing which problems you plan on tackling is important if you want to succeed in introducing new technology to your business. <\/p>\n\n\n\n<p>And did I mention, Teams can help you with all those problems. <\/p>\n\n\n\n<h3>2. Find a Champion<\/h3>\n\n\n\n<p>In order to increase the chances for success of implementing Teams, you need to find a champion. This is someone who can help identify the most pressing needs and train other people if needed.<\/p>\n\n\n\n<p>This champion doesn&#8217;t necessarily have to be the business owner or a VP or head of IT. They just have to be someone who&#8217;ll be directly responsible for the implementation and making sure everyone uses it. <\/p>\n\n\n\n<h3>3. Just Get Started<\/h3>\n\n\n\n<p>The final tip is to just get started. Most people start off by using it for chat. It can be as simple as <a href=\"https:\/\/it360.co.nz\/blog\/using-ms-teams-for-internal-communication-5-different-options\/\">sending a message to a colleague<\/a>. It will grow from there. <\/p>\n\n\n\n<p>Once you get the hang of chats, you can move to talking about building your first <a href=\"https:\/\/it360.co.nz\/blog\/teams-and-channels\/\">channel<\/a>. <\/p>\n\n\n\n<h2>What&#8217;s Next?<\/h2>\n\n\n\n<p>These are just simple guidelines to help you implement MS Teams in your organisation.<\/p>\n\n\n\n<p>The main challenge for every change initiative is there is little buy-in from the end-users. Even if there is nothing to fear about, people respond negatively from change.<\/p>\n\n\n\n<p>That&#8217;s why it&#8217;s important to solve for the right problems. You don&#8217;t implement new technology just for the sake of using it. Having a champion in your organisation also helps reduce this risk of failure. <\/p>\n\n\n\n<p>If you and your team start using Microsoft Teams on a daily basis, people will find confidence in the tool. They get to experience first-hand what it&#8217;s like to be more productive. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Implementing change is one of the most difficult things business leaders face in their organizations. Oftentimes, the main reason change efforts fail is there is not enough buy-in from end-users themselves. Why? Because they were left out in the decision-making process. In this article, we&#8217;ll show you how you can introduce new technology (or systems, [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":8085,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[81],"tags":[],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8076"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=8076"}],"version-history":[{"count":4,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8076\/revisions"}],"predecessor-version":[{"id":8086,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8076\/revisions\/8086"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/8085"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=8076"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=8076"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=8076"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}