{"id":8215,"date":"2020-12-10T12:09:53","date_gmt":"2020-12-10T00:09:53","guid":{"rendered":"https:\/\/it360.co.nz\/?p=8215"},"modified":"2021-06-27T07:17:10","modified_gmt":"2021-06-26T19:17:10","slug":"notes-from-the-ceo-december-2020","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/notes-from-the-ceo-december-2020\/","title":{"rendered":"Notes from the CEO: December 2020"},"content":{"rendered":"\n<p>It has been a big year. A year for the books!<\/p>\n\n\n\n<p>My team and I are super excited to bring you the first edition of our iT360 Quarterly newsletter aptly called “Bytesize”. We hope you find this an interesting and exciting read and more so the story on how we came up with the name.<\/p>\n\n\n\n<p>As the team at iT360 close off the last calendar quarter and start winding down to spend quality time with our family and friends over this festive season, we reflect on our business and how we have operated amongst great challenges. We think back on how we have helped a couple thousand New Zealanders work from home remotely, in an incredibly short period of time, how we have helped and supported businesses with their technology and IT solutions, and to quickly adapt through what has been some of the toughest times we have all had to face as business owners, employees, and parents.<\/p>\n\n\n\n<p>As a soon-to-be dad during the pandemic, it also introduced a new dilemma and interesting challenge into my own personal life. The balancing act of running a business, and a sense of commitment to my team, and customers, and that of being a husband and father. Having a solid leadership team behind me has made that transition easier. Trusting in that leadership team even more so. I quickly realised that if we were to maintain this trajectory, we had to invest in resources and the right people with the skillsets needed to move the business forward. This required a dramatic shift in mindset especially as a small business owner, having highly qualified individuals heading up strategic areas such as Operations, Service, Sales and Marketing. I realised we needed to think bolder, smarter and be braver in our decisions, now more than ever if we wished to remain relevant for our customers.<\/p>\n\n\n\n<p>As a small business we have increased our headcount by six people since the first lockdown earlier this year, and it has been awesome and gratifying to know that we were in a position to provide jobs to those that have lost them because of the pandemic. We remained steadfast in our commitment to our team that salaries would remain intact, positions unaffected and it was important to the leadership team to continually reinforce this sense of reassurance during those uncertain months. And there was a lot of uncertainty, not just within our own company, but within the country and the rest of the world as well.<\/p>\n\n\n\n<p>As CEO I remain committed to continually listening to our customers, adapting, growing and partnering better with you to deliver business and technology solutions, so that you can continue to drive success in your own business and also ultimately best serve your end consumer.<\/p>\n\n\n\n<p>However, I am also always mindful that in any business that is growing in numbers, there is a chance for cracks to emerge, customer service to slip and things to change quickly. So, as we move forward into 2021, we do so with two primary goals; which are to lead with a ‘one team’ culture and to keep customer service and experience at the centre of everything that we do. This remains our core and is underpinned by having a capable team that is highly skilled in delivering great service, is aligned around a common vision, and shows up every day to serve our customers and deliver awesome customer experiences.<\/p>\n\n\n\n<p>On behalf of iT360 I would like to extend my gratitude for your continued support, partnership and belief in us as your technology solutions provider over the past year. From my iT360 family to yours, I wish you, your team and your loved ones a safe and happy festive season and a healthy, prosperous 2021. &nbsp;&nbsp; <\/p>\n\n\n\n<p>Have a merry Christmas<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It has been a big year. A year for the books! My team and I are super excited to bring you the first edition of our iT360 Quarterly newsletter aptly called “Bytesize”. We hope you find this an interesting and exciting read and more so the story on how we came up with the name. [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":4775,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[7],"tags":[],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8215"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=8215"}],"version-history":[{"count":2,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8215\/revisions"}],"predecessor-version":[{"id":8379,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/8215\/revisions\/8379"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/4775"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=8215"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=8215"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=8215"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}