{"id":9133,"date":"2022-04-10T11:49:42","date_gmt":"2022-04-09T23:49:42","guid":{"rendered":"https:\/\/it360.co.nz\/?p=9133"},"modified":"2022-04-15T01:49:21","modified_gmt":"2022-04-14T13:49:21","slug":"how-to-protect-your-company-from-cyber-attacks","status":"publish","type":"post","link":"https:\/\/it360.co.nz\/blog\/how-to-protect-your-company-from-cyber-attacks\/","title":{"rendered":"15 Ways to Protect Your Company from Cyber Attacks"},"content":{"rendered":"\n<p>As businesses become increasingly reliant on technology, they are also becoming more vulnerable to cyber-attacks.&nbsp;<\/p>\n\n\n\n<p>A cyber-attack can be a devastating event for a business, resulting in the loss of valuable data and impact on a company&#8217;s reputation and bottom line.<\/p>\n\n\n\n<p>Each quarter, CERT NZ releases a report of what has occurred across the NZ Business Community.&nbsp;<\/p>\n\n\n\n<p>Here are a few of the latest statistics from their 2021 Q4 report:<\/p>\n\n\n\n<ul><li>1030% increase in ransomware reports from Q3<\/li><li>$6.6 million in direct financial loss was reported in Q4. 100% increase from Q3<\/li><li>568 scams and frauds, up 16% from Q3<\/li><li>Recent DDoS attack on VOCUS, Kiwi Bank and ANZ<\/li><\/ul>\n\n\n\n<p>If you are unsure about what your business is doing in the <a href=\"https:\/\/it360.co.nz\/services\/cyber-security\/\">cyber security<\/a> arena, we recommend going through the list below and speaking to your IT Partner or your internal IT delegate to discuss and ask any questions you may have.<\/p>\n\n\n\n<p>At the end of the day, prevention is key.<\/p>\n\n\n\n<h2>15 Ways to Protect Your Company From Cyber Attacks<\/h2>\n\n\n\n<figure class=\"wp-block-embed is-type-rich is-provider-embed-handler wp-block-embed-embed-handler wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"15 Ways to Protect Your Business from a Cyber Attack\" width=\"1200\" height=\"675\" src=\"https:\/\/www.youtube.com\/embed\/a44Wfd0cgPQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<p><\/p>\n\n\n\n<h3>1. Perform a Cyber Security Audit<\/h3>\n\n\n\n<p>The first step in protecting your business from cyber-attacks is to identify your company&#8217;s <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-terms\/\">vulnerabilities<\/a>. This can be done through a <a href=\"https:\/\/it360.co.nz\/services\/cyber-security-audit\/\">cyber security audit<\/a>, which will help you to assess your current security posture and identify any areas that need improvement.<\/p>\n\n\n\n<p>This assessment need not be too cumbersome.<\/p>\n\n\n\n<p>It can be as simple as asking questions about your business&#8217; password policy, what your process looks like when employees are onboarded or leave the company, or what <a href=\"https:\/\/it360.co.nz\/blog\/backing-up-company-data-simple-as-3-2-1\/\">backups<\/a> you have in place and how they are being implemented.<\/p>\n\n\n\n<p>However, depending on your business size, cyber maturity, and appetite for risk, this could be at the scale of penetration testing and &#8216;white hacking&#8217; in order to make sure your network is robust and able to prevent external threats.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>By understanding your weaknesses, you can take steps to mitigate the risks and make it more difficult for attackers to exploit your vulnerabilities.&nbsp;<\/p>\n\n\n\n<p>Knowing where you are right now will help you determine your next steps.<\/p>\n\n\n\n<p>What is great about audits is that they are a snapshot of your cyber security position at that point in time. If you do this periodically, for example, every 6 months, you can see your progress over time.<\/p>\n\n\n\n<p>According to the latest statistics, <strong>71% of businesses that have been targeted by cyber-attacks have less than 100 staff members<\/strong>; identifying that just because you are a small business, it doesn&#8217;t mean you are immune to cyber-attacks or that you can continuously put a cyber-security audit on the backburner.<\/p>\n\n\n\n<h3>2. Check Your Spam Filters<strong><\/strong><\/h3>\n\n\n\n<p>One of the most common ways cyber criminals gain access to businesses is through phishing emails.&nbsp;<\/p>\n\n\n\n<p>Phishing is a type of email scam where criminals send fake emails that appear to be from a legitimate source in order to trick victims into clicking on a malicious link or attachment.<\/p>\n\n\n\n<p>Once the victim clicks on the link or attachment, they are taken to a malicious website, or their computer is infected with malware.<\/p>\n\n\n\n<p>To protect your business from phishing attacks, it is important to have strong spam filters in place to block these types of emails from reaching your inbox.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>According to the CERT NZ report, phishing and credential harvesting was the #2 cyber security threat for the quarter. In past reports, this was often #1, indicating just how big this threat really is.<\/p>\n\n\n\n<h3>3. Update Your Passwords<strong><\/strong><\/h3>\n\n\n\n<p>Another way to protect your business from cyber-attacks is to <a href=\"https:\/\/it360.co.nz\/blog\/change-your-passwords-now-collection-1-data-breach\/\">make sure all your passwords are strong and up to date<\/a>.<\/p>\n\n\n\n<p>According to CERT NZ, <strong>only 41% of Kiwis<\/strong> say they always make sure their passwords are distinct, long, and complex when signing up to new websites or online services.<\/p>\n\n\n\n<p>A strong password is one that is at least 8 characters long and includes a mix of upper and lowercase letters, numbers, and special characters.&nbsp;<\/p>\n\n\n\n<p>You should also avoid using easily guessed words like &#8216;password&#8217; or &#8216;123456&#8217;.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>If a cybercriminal gains access to your business&#8217; email account, they will be able to reset the password for any other accounts that use the same password.&nbsp;<\/p>\n\n\n\n<p>This is why it&#8217;s so important to have strong and unique passwords for all your accounts.<\/p>\n\n\n\n<p>It is also recommended to use a password manager. This is a tool that helps you generate and store strong passwords.<\/p>\n\n\n\n<p>A tip we often share is to stop thinking of passwords, rather, think of it as a passphrase.&nbsp;<\/p>\n\n\n\n<p>For example: BananaMouseChocolateTree.<\/p>\n\n\n\n<p>Want to see how long cyber criminals can &#8220;brute force&#8221; your accounts?&nbsp;<\/p>\n\n\n\n<p>Try<a href=\"https:\/\/www.passwordmonster.com\/\" target=\"_blank\" rel=\"noopener\">&nbsp;entering a few of your passwords here<\/a>.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"599\" src=\"https:\/\/it360.co.nz\/wp-content\/uploads\/2022\/04\/Screen-Shot-2022-04-09-at-4.20.19-PM-1024x599.png\" alt=\"\" class=\"wp-image-9137\" title=\"\"><\/figure>\n\n\n\n<p><\/p>\n\n\n\n<h3>4. Conduct Continuous and Frequent Cyber Security Awareness Training<strong><\/strong><\/h3>\n\n\n\n<p>One of the best ways to protect your business from cyber-attacks is to <a href=\"https:\/\/it360.co.nz\/services\/cyber-security-training\/\">educate your employees about cyber security<\/a>.<\/p>\n\n\n\n<p>While you can implement multiple layers of technology to protect your business, there is one component that you cannot neglect; that of human intervention.<\/p>\n\n\n\n<p>Let&#8217;s say your spam filter (#2 above) caught a phishing email.&nbsp;<\/p>\n\n\n\n<p>If your staff happens to still &#8220;approve&#8221; or click on these links, they can get hacked, making vulnerable sensitive business data.<\/p>\n\n\n\n<p><a href=\"https:\/\/it360.co.nz\/services\/cyber-security-training\/\">Cyber security awareness training<\/a> is important because it helps employees understand how to identify and avoid common cyber threats, such as phishing emails, social engineering attacks, and malware.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>According to an IBM report, &#8220;Human error was a major contributing cause in 95% of all breaches.&#8221; This means that even with the best security measures in place, your business is still at risk if your employees are not trained on a regular basis in best practice cyber security.<\/p>\n\n\n\n<p>As a company, do you include cyber security training courses for new and current staff members?&nbsp;<\/p>\n\n\n\n<p>Do you run phishing simulations?<\/p>\n\n\n\n<p>From a business standpoint, cyber security training is also something we are seeing an increasing demand for, often pushed by insurance requirements.<\/p>\n\n\n\n<h3>5. Implement Advanced Endpoint Detection and Response<strong><\/strong><\/h3>\n\n\n\n<p>Endpoint detection and response (EDR) is a type of security software that helps businesses detect, investigate, and respond to <a href=\"https:\/\/it360.co.nz\/blog\/cyber-security-threats-dont-let-lack-of-knowledge-hurt-your-business\/\">cyber threats<\/a>.<\/p>\n\n\n\n<p>Unlike traditional antivirus software, which only looks for known malware, EDR uses&nbsp;behavioural&nbsp;analytics to identify suspicious activity and potential threats.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>Think of EDR as the next evolution of the anti-virus.&nbsp;<\/p>\n\n\n\n<p>EDR agents protect against file-less and script-based threats and can even rollback a ransomware attack. It can detect attacks that have gone unnoticed.<\/p>\n\n\n\n<p>The significant difference between EDR and your standard security software is that the former is more proactive, while the latter is reactive.<\/p>\n\n\n\n<p>We recommend implementing an EDR solution if you haven&#8217;t already. If you need help choosing the right one for your business, get in touch with us and we can guide you.<\/p>\n\n\n\n<h3>6. Implement Multi-Factor Authentication<strong><\/strong><\/h3>\n\n\n\n<p>Multi-factor authentication (MFA) is an authentication method that requires two or more verification factors to login.<\/p>\n\n\n\n<p>The most common type of MFA is two-factor authentication (2FA), which combines something you know (for example, a password) with something you have (for example, a smartphone).<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>MFA adds an extra layer of security to your accounts and makes it more difficult for cyber criminals to gain access. For example, even if a cybercriminal knows your password, they will still need your phone to login.<\/p>\n\n\n\n<p>We recommend implementing MFA on all your business accounts, especially those that contain sensitive data.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>We understand MFA adds time when you&#8217;re logging in, but the unfortunate reality is, this is a necessary security step in today&#8217;s world that&#8217;s plagued by cybercriminals doing everything they can to get hold of your data.<\/p><cite>Craig Hudson, Managing Director of Xero<\/cite><\/blockquote>\n\n\n\n<h3>7. Have a Patch Management Policy in Place<strong><\/strong><\/h3>\n\n\n\n<p>Patch management is the process of identifying, testing, and deploying software updates (aka patches). Regular patch management fixes vulnerabilities on your software and applications that are susceptible to cyber-attacks.&nbsp;<\/p>\n\n\n\n<p>Think &#8211; servers, desktops, laptops, switches, phone, routers, etc.<\/p>\n\n\n\n<p>When it comes to patching, you need to strike a <a href=\"https:\/\/it360.co.nz\/blog\/5-ways-it-issues-are-reducing-your-businesss-productivity\/\">balance between security and productivity<\/a>. You don&#8217;t want to be constantly patching systems and disrupting workflows, but you also don&#8217;t want to wait too long and leave your business exposed.<\/p>\n\n\n\n<p>The key is to have a patch management policy in place that everyone understands and follows. This should include a schedule for when patches will be deployed and who is responsible for testing and deploying them.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>One of the most common ways cyber criminals gain access to systems is by exploiting vulnerabilities in software. By patching these vulnerabilities, you can close the door on potential attacks.<\/p>\n\n\n\n<p>Another reason you need to implement patch management is for compliance. This is becoming more necessary to adhere to internal standards and for insurance purposes.<\/p>\n\n\n\n<p>Lastly, updates usually come with feature improvements and reliability. In essence, you increase the benefits you get while reducing your risks by implementing a patch management policy.<\/p>\n\n\n\n<h3>8. Consider Dark Web Research<strong><\/strong><\/h3>\n\n\n\n<p>The dark web is a place where cyber criminals buy and sell stolen data, malware, and other illegal goods and services. It&#8217;s also where they share information about new exploits and ways to conduct cyber-attacks.<\/p>\n\n\n\n<p>Often when an organization like LinkedIn or <a href=\"https:\/\/it360.co.nz\/blog\/canva-and-pdl-data-breach-2019\/\" data-type=\"post\" data-id=\"6618\">Canva gets hacked<\/a>, credentials (usernames \/ passwords) get sold on the Dark Web for phishing purposes.&nbsp;<\/p>\n\n\n\n<p>Their hope is that the password ‘Ted’ uses for Canva is the same password he uses for his Microsoft 365. Now just imagine if &#8216;Ted’ also uses that same password for his banking and social media!&nbsp;<\/p>\n\n\n\n<p>The resulting damage has huge ramifications.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>Regular dark web research can help you stay ahead of the curve and protect your business from potential cyber-attacks.&nbsp;<\/p>\n\n\n\n<p>For example, if you <a href=\"https:\/\/it360.co.nz\/blog\/discover-email-addresses-used-in-dark-web\/\">discover that employee credentials have been compromised in a data breach<\/a>, you can take steps to prevent them from being used to login to your systems.<\/p>\n\n\n\n<p>If you do find that your data has been compromised, you can take steps to mitigate the risks.<\/p>\n\n\n\n<p>Start by talking to your IT provider about this.&nbsp;<\/p>\n\n\n\n<p>Oftentimes, they have tools available to find leaks. These services monitor the dark web for stolen data and notify you if your business is at risk.<\/p>\n\n\n\n<h3>9. Use Firewalls<\/h3>\n\n\n\n<p>A firewall is a network security system that controls the traffic allowed into and out of your network. It is a critical component of your cyber security strategy as it can help block malicious traffic and protect your data.<\/p>\n\n\n\n<p>There are two main types of firewalls: hardware and software.&nbsp;<\/p>\n\n\n\n<p><strong>Hardware firewalls<\/strong> are physical devices that sit between your network and the internet.&nbsp;<\/p>\n\n\n\n<p>They are usually used by larger businesses as they can be more expensive and require more maintenance.<\/p>\n\n\n\n<p><strong>Software firewalls<\/strong> are programs that run on your servers or workstations. They are less expensive and easier to maintain but cannot provide the same level of protection as hardware firewalls.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>Firewalls are important because they can help prevent cyber-attacks by filtering out malicious traffic. They can also be used to segment your network so that if one part of it is compromised, the rest of your network remains secure.<\/p>\n\n\n\n<p>The firewall we recommend is the <strong>Unified Threat Management (UTM) Firewall<\/strong>.<\/p>\n\n\n\n<p>The main difference between the UTM and regular firewalls is that UTM firewalls have services layered on top of it.<\/p>\n\n\n\n<p>This is even more important today as you have remote workers coming onto your network and accessing your business data.&nbsp;<\/p>\n\n\n\n<p>Inside your office building, this is not as much of an issue.&nbsp;<\/p>\n\n\n\n<p>But when you have staff accessing your network from their homes (which usually have a less secure network) or at a nearby café, your risk level increases dramatically.<\/p>\n\n\n\n<h3>10. Double Check Your Web Gateway Security<strong><\/strong><\/h3>\n\n\n\n<p>Your web gateway is the first line of defense against cyber-attacks. It is the gateway that controls traffic going in and out of your network.<\/p>\n\n\n\n<p><a href=\"https:\/\/it360.co.nz\/services\/cloud-solutions\/\">Cloud based security<\/a> detects web and email threats as they emerge on the internet and blocks them on your network within seconds – before they reach the user.<\/p>\n\n\n\n<p>Implementing a secure web gateway as the first line of defense, removes SSL blind spots, provides visibility into web traffic, allows for URL filtering, and DNS (Domain Name System) firewalling.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>This is important because if your web gateway security is not up to date, you are at risk of cyber-attacks. Make sure to double check that your web gateway security is up to date and that you have the latest version of your security software.<\/p>\n\n\n\n<p>If you don&#8217;t have one or don&#8217;t know the details, use this opportunity to start a discussion with your IT partner.<\/p>\n\n\n\n<h3>11. Don&#8217;t Forget Your Mobile Devices<strong><\/strong><\/h3>\n\n\n\n<p>Mobile devices are an increasingly popular target for cyber-attacks.&nbsp;<\/p>\n\n\n\n<p>These cybercriminals are counting on you to neglect this piece of the puzzle. This is why a <a href=\"https:\/\/it360.co.nz\/services\/mobile-device-management\/\" data-type=\"services\" data-id=\"5131\">Mobile Device Management<\/a> program is highly recommended for your business.<\/p>\n\n\n\n<p>Mobile Device Management (MDM) is a type of security software that gives you control over the mobile devices used to access your corporate data. It allows you to remotely manage and monitor devices, set up security policies, and wipe data if a device is lost or stolen.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>This is important because mobile devices are often used to access corporate data. If these devices are lost or stolen, the data on them could be compromised.&nbsp;<\/p>\n\n\n\n<p>With an MDM program in place, you can remotely wipe data from lost or stolen devices to help protect your company&#8217;s data.<\/p>\n\n\n\n<p>In fact, according to a<a href=\"https:\/\/www.symantec.com\/security-center\/threat-report\" target=\"_blank\" rel=\"noopener\">&nbsp;Symantec report<\/a>, 1 in 36 mobile devices have high-risk apps installed.&nbsp; That means that if you have 100 employees, at least 2 of them have a high-risk app installed on their phone right now.<\/p>\n\n\n\n<p>High-risk apps are those that violate one or more of the following:<\/p>\n\n\n\n<ul><li>Share sensitive data without permission<\/li><li>Have excessive privileges<\/li><li>Are from an unknown developer<\/li><li>Are outdated<\/li><\/ul>\n\n\n\n<p><a href=\"https:\/\/it360.co.nz\/blog\/growth-of-cyber-threats\/\">Without a policy or a way to manage these mobile devices<\/a>, especially if they are being used to access your network and important files, you are at elevated risk.<\/p>\n\n\n\n<h3>12. Implement SIEM\/Log Management<strong><\/strong><\/h3>\n\n\n\n<p>SIEM (Security Information and Event Management) and Log Management are tools that help you collect, monitor, and analyze data from various areas of your network.<\/p>\n\n\n\n<p>This data can be used to detect and investigate security incidents.<\/p>\n\n\n\n<p>It uses big data engines to review all events and security logs from connected devices to protect you against advanced threats and to meet compliance requirements.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>Having greater visibility across your historical log data is invaluable. It consolidates logged data into one location and helps you understand how users are spending their time and what they are trying to access as well.<\/p>\n\n\n\n<h3>13. Implement Encryption<strong><\/strong><\/h3>\n\n\n\n<p>Encryption is a process of transforming readable data into an unreadable format. This ensures that only authorised people can read the data.&nbsp;<\/p>\n\n\n\n<p>Encrypting files helps <a href=\"https:\/\/it360.co.nz\/blog\/protecting-critical-data-in-your-business\/\">prevent tampering or un-authorised access while files<\/a> are in transit and at rest.<\/p>\n\n\n\n<p>There are two types of encryption:<\/p>\n\n\n\n<ul><li><strong>Symmetric-key encryption<\/strong>: Uses the same key to encrypt and decrypt data.<\/li><li><strong>Asymmetric-key encryption<\/strong>: Uses a different key to encrypt and decrypt data. The keys are generated together and are mathematically related. Typically, using this type of technology solves this for you.&nbsp;<\/li><\/ul>\n\n\n\n<p>These proven safe tools can be found, as examples, on HP laptops and connected to Microsoft’s 365 software.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>This is important because encryption helps protect your data from being accessed by un-authorised people. If your data is encrypted, even if it is intercepted, the person who intercepts it will not be able to read it.<\/p>\n\n\n\n<p>As an example, think of this as sending a letter in an envelope via mail.&nbsp;<\/p>\n\n\n\n<p>There is no encryption other than the letter being inside the envelope. Anyone can simply open the envelope and by doing so, access and read the letter.<\/p>\n\n\n\n<p>But with encryption, you add a layer of protection so that even if someone gets access to that letter, they will not be able to understand it.<\/p>\n\n\n\n<h3>14. Create a Backup and Disaster Recovery Plan<strong><\/strong><\/h3>\n\n\n\n<p>A <a href=\"https:\/\/it360.co.nz\/blog\/is-your-business-data-backed-up-correctly\/\">backup<\/a> is a copy of your data that you can use to restore your files in the event that they are lost or corrupted. A disaster recovery plan is a plan that describes how you will recover from a disaster.<\/p>\n\n\n\n<p>Your backup and disaster recovery plan should include the following:<\/p>\n\n\n\n<ul><li>What data you need to backup<\/li><li>How often you will back up your data<\/li><li>Where you will store your backups<\/li><li>How you will recover your data in the event of a disaster<\/li><\/ul>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>This is important because it helps ensure that you can recover from a disaster. If your data is lost or corrupted, you can use your backups to restore your files and resume business almost immediately.<\/p>\n\n\n\n<p>We strongly recommend following this three-step plan:<\/p>\n\n\n\n<ol type=\"1\"><li>Backup local<\/li><li>Backup to the cloud<\/li><li>Test your backups often<\/li><\/ol>\n\n\n\n<p>Remember, replication is not a backup.&nbsp;<\/p>\n\n\n\n<p>For example, you have your files in OneDrive. You can access them on your phone, tablet, desktop, laptop in your office, during your vacation or where-ever you may be working.&nbsp;<\/p>\n\n\n\n<p>This is a replication of files, not a backup.&nbsp;<\/p>\n\n\n\n<p>Talk to your IT provider to gain a better understanding of backups and how you can implement it securely for your business.<\/p>\n\n\n\n<h3>15. Get Cyber Insurance<strong><\/strong><\/h3>\n\n\n\n<p>Cyber insurance is insurance that covers losses resulting from cyber-attacks. It can help cover the cost of data breaches, cyber extortion, and other types of attacks.<\/p>\n\n\n\n<p>At the end of the day, having multiple layers of protection can only reduce your risks. There is no 100% failsafe way to ensure that your systems or data will not be compromised. So, if all else fails, protect your income and business with cyber damage and recovery insurance policies.<\/p>\n\n\n\n<h4>Why Is This Important?<strong><\/strong><\/h4>\n\n\n\n<p>This is important because it can help reduce the financial impact of a cyber-attack. Cyber insurance can help cover the cost of restoring lost data, repairing damaged systems, and other expenses associated with an attack.<\/p>\n\n\n\n<p>When choosing a cyber insurance policy, be sure to read the fine print and understand what is covered and what is not. Some policies only cover certain types of attacks or losses, so it is important to know what you are buying.<\/p>\n\n\n\n<p>One thing we do know from talking to insurance brokers, it is getting more difficult to obtain cyber insurance without first making sure various practices (like the ones mentioned in this post) are implemented in your business.<\/p>\n\n\n\n<h2>Over to You<\/h2>\n\n\n\n<p>There are many ways that you can protect your company from cyber-attacks. Implementing these security related measures will help reduce your risk of being compromised.<\/p>\n\n\n\n<p>Simply your cyber security should concentrate on the big 3.<\/p>\n\n\n\n<p>Technology, Processes, and People.&nbsp;<\/p>\n\n\n\n<p>Neglecting one of these will leave your business at elevated risk. But by taking a comprehensive approach, you can build a strong defense against cyber-attacks.<\/p>\n\n\n\n<p>If you found this post helpful, please share it with your friends or colleagues.<\/p>\n\n\n\n<p>Do you have any other tips to share? Feel free to leave a comment below.<\/p>\n\n\n\n<p>If you need help with your cyber security, <a href=\"https:\/\/it360.co.nz\/contact\/\" data-type=\"page\" data-id=\"3725\">don&#8217;t hesitate to get in touch<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As businesses become increasingly reliant on technology, they are also becoming more vulnerable to cyber-attacks.&nbsp; A cyber-attack can be a devastating event for a business, resulting in the loss of valuable data and impact on a company&#8217;s reputation and bottom line. Each quarter, CERT NZ releases a report of what has occurred across the NZ [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":9147,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[82],"tags":[],"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/9133"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=9133"}],"version-history":[{"count":6,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/9133\/revisions"}],"predecessor-version":[{"id":9154,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/posts\/9133\/revisions\/9154"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media\/9147"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=9133"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/categories?post=9133"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/tags?post=9133"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}