{"id":4177,"date":"2019-04-08T08:48:19","date_gmt":"2019-04-08T08:48:19","guid":{"rendered":"http:\/\/iT360.co.nz\/?page_id=4177"},"modified":"2021-08-17T05:41:59","modified_gmt":"2021-08-16T17:41:59","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/it360.co.nz\/terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"\n<h3>1. Terms of Trade<\/h3>\n\n\n\n<p>iT360 Limited and any successor entity (“iT360”) will contract to sell and supply goods and services on these Terms and Conditions&nbsp;of Trade and the Credit Account Application only (together, the “Contract”). By placing or confirming an order with iT360, the client&nbsp;is accepting these Terms and Conditions of Trade, and anything to the contrary in the client’s’s enquiries, orders or confirmations&nbsp;will not apply. The Contract supersedes any prior negotiations, agreements or undertakings between the parties and any waivers&nbsp;or variations to the Contract are only effective if made in writing and signed on behalf of iT360.<\/p>\n\n\n\n<p>These Terms and Conditions of Trade apply to all “business customer” sales only. That is, sales to a client which acquires goods&nbsp;and services from iT360 for the purposes of business use.<\/p>\n\n\n\n<h3>2. Orders<\/h3>\n\n\n\n<p>Orders must be in writing and addressed to iT360. The client may not cancel or vary an order once it has been placed or confirmed&nbsp;without iT360’s written consent. iT360 has no obligation to enquire into the authority of any person placing orders on the client’s&nbsp;behalf.<\/p>\n\n\n\n<p>No order submitted by the client shall be deemed to be accepted by iT360 unless and until it is confirmed in writing by iT360’s&nbsp;authorised representative.<\/p>\n\n\n\n<h3>3. Prices<\/h3>\n\n\n\n<p>All prices quoted by iT360 are exclusive of GST unless specified otherwise. If GST is payable, it is payable by the client.&nbsp;iT360 reserves the right to alter the prices quoted in a quotation or tender provided to the client for the supply of goods or services&nbsp;(“Quotation”) to reflect increases or decreases in procurement costs which may have come to its notice after the date of the&nbsp;Quotation. In addition, iT360 reserves the right to withdraw or amend a Quotation unless the client has given written acceptance&nbsp;of the Quotation to iT360 within the time period specified in the Quotation. If no period for acceptance has been specified, the&nbsp;Quotation will be open for acceptance for thirty days from the date of the Quotation.<\/p>\n\n\n\n<p>In some instances prices provided by iT360 within a Quotation may be calculated on the basis of a project or package of items.&nbsp;Variations in the scope of a project or package, or to project timescales, may affect the pricing of individual components and&nbsp;iT360 reserves the right to adjust the prices contained within the Quotation accordingly.<\/p>\n\n\n\n<h3>4. Payment Terms<\/h3>\n\n\n\n<p>The client must pay the price indicated on the invoice or other document or statement issued by iT360.<\/p>\n\n\n\n<p>All freight, packaging and other relevant costs (if any) are charged to the client’s account as shown on the invoice.<\/p>\n\n\n\n<p>Payment for goods and services supplied by iT360 to the client is due in accordance with the terms stated on the relevant invoice,&nbsp;or as otherwise agreed in writing.<\/p>\n\n\n\n<p>Where no payment terms are stated on the invoice, payment will be due on delivery of the goods or the provision of the services&nbsp;being Cash On Delivery.<\/p>\n\n\n\n<p>If credit has been granted to the client by iT360 by opening a 7 day account, the said invoice is due on or before the 7th day&nbsp;following the date of the invoice.<\/p>\n\n\n\n<p>If a 20th of the month account, the said invoice is due for payment on or before the 20th of the month following the month the&nbsp;goods and\/or services are supplied.<\/p>\n\n\n\n<p>If at any time iT360 deems the credit of the client to be unsatisfactory, it may immediately terminate this contract or any other&nbsp;credit arrangements and require the client to pay the price on delivery of the goods or services. All costs and expenses of, or&nbsp;incurred by, iT360 as a result of the termination and recommencement of any credit arrangement are payable by the client upon demand.<\/p>\n\n\n\n<p>iT360 may charge interest on any moneys which are overdue under this Contract, commencing on the due date until the date of&nbsp;actual payment. The interest charged will be 2.5% per month calculated on a daily basis on the overdue amount until all amounts&nbsp;owed by the client are paid in full. The charging of interest does not imply the granting or an extension of credit. The client agrees&nbsp;to pay, on demand, all costs (including legal fees) incurred by iT360 or iT360’s agents relating to the recovery of any amounts&nbsp;payable by the client to iT360.<\/p>\n\n\n\n<p>All payments by the client must be made in full and without any deduction or right of set off or counterclaim. The client agrees,&nbsp;however, that all moneys which iT360 may owe the client on any account whatsoever may, at iT360’s option, be set off against&nbsp;payments due by the client to iT360.<\/p>\n\n\n\n<h3>5. Intellectual Property<\/h3>\n\n\n\n<p>The client acknowledges that iT360 (or its suppliers) are the sole owners or licensors of all intellectual property (including business&nbsp;know-how, methodologies, ideas, routines, systems and processes) relating or arising (directly or indirectly) to the client; or as&nbsp;otherwise developed or contributed to by iT360 (or its suppliers) in relation to any information, fault, repair or documentation that&nbsp;iT360 supplies to the client, or as a result of iT360 performing services or any other work for the client.<\/p>\n\n\n\n<p>The client covenants that any material provided by the client to iT360, and the use of it by iT360, for the purpose of supplying&nbsp;goods or services does not infringe any trade mark, copyright, patent, trade secret or any other proprietary right of any third party.<\/p>\n\n\n\n<h3>6. Delivery<\/h3>\n\n\n\n<p>Delivery of goods is deemed to be complete when made at the client’s premises or any other premises agreed to in writing by&nbsp;iT360. On delivery, the goods are at the client’s sole risk and with effect from the time of delivery, and in accordance with clause&nbsp;8 of these Terms and Conditions of Trade, the client will have in place all risks insurance to cover both its interest as bailee of the&nbsp;goods and iT360’s interest as owner of the goods.<\/p>\n\n\n\n<p>iT360 may choose the carrier and the method of transport, unless otherwise agreed by iT360 in writing, and it may choose to&nbsp;deliver by instalments and may treat each delivery as a separate Contract. Should iT360 fail to deliver or make defective delivery&nbsp;of one or more instalments, this will not entitle the client to repudiate the Contract.<\/p>\n\n\n\n<p>If iT360 believes that the client may not make any payment when due, then it may suspend or cancel any delivery and iT360 shall&nbsp;not be held liable for non-delivery or late delivery (however caused), or failure to deliver by any specific method, means or vehicle.<\/p>\n\n\n\n<h3>7. Guarantee<\/h3>\n\n\n\n<p>In consideration of iT360 supplying the Goods and Services on account, the Guarantor(s) PERSONALLY GUARANTEES jointly and&nbsp;severally payment upon demand of all monies owed by the client from time to time to iT360.<\/p>\n\n\n\n<p>The Guarantor(s) agrees to indemnify us at all times against all damages, claims, costs (including all legal costs), losses and&nbsp;expenses which we may suffer or incur as a breach by the client of their obligations under this Contract.<\/p>\n\n\n\n<p>The Guarantor(s) further agrees:<\/p>\n\n\n\n<p>(a) That they waive any right to require the client to proceed first against the Guarantor and agree that they are deemed to&nbsp;be liable as principal debtors under this Contract;<\/p>\n\n\n\n<p>(b) That their obligations as Guarantor continue, notwithstanding:<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; (i) Any variation of this Contract;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; (ii) The liquidation, insolvency or receivership of the client;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; (iii) Any judgment iT360 obtains against the client;<\/p>\n\n\n\n<p><br>(c) That the guarantee in this clause is a continuing security and will not be discharge while, in iT360’s opinion, any money&nbsp;is or may become owing under this Contract by the client or by the giving of time or any other act which would release&nbsp;the Guarantor’s liability as surety only.<\/p>\n\n\n\n<h3>8. Retention of Title<\/h3>\n\n\n\n<p>Title to ownership (both legal and equitable) in all goods delivered by iT360 to the client does not pass (and the client is a bailee&nbsp;only in respect of those goods) until payment in full is made for all such goods and other goods supplied by iT360 to the client.&nbsp;Until property has passed, the client will store all goods in such a way that they are clearly identifiable as the property of iT360.<\/p>\n\n\n\n<p>Until the client has paid iT360 in full for all goods supplied, the client may not sell (unless such sale is in the ordinary course of the&nbsp;client’s business), dispose of, or charge the goods and must hold or deal with the goods for and on behalf of iT360.&nbsp;However, if&nbsp;the goods are sold in the ordinary course of the client’s business, prior to property passing to the client, the proceeds of that sale&nbsp;are held by the client on trust for and on behalf of iT360.<\/p>\n\n\n\n<p>Prior to the client acquiring full property in the goods, iT360 or iT360’s agents may at any time enter upon any land, premises&nbsp;or property where it believes such goods may be to view and inspect them, and if the client has not paid for them in full retake&nbsp;possession of the goods.<\/p>\n\n\n\n<h3>9. Force Majeure<\/h3>\n\n\n\n<p>If iT360 is prevented, hindered or delayed from complying with this Contract, or supplying goods and services in accordance with&nbsp;this Contract, by a Force Majeure Event, iT360 may at its option:<\/p>\n\n\n\n<p>(a) Suspend deliveries while the Force Majeure Event continues;<br>(b) If iT360 has insufficient stocks to meet its commitments, apportion available stocks between its clients as it decides;&nbsp;and<br>(c) Terminate any orders placed by the client so affected, with immediate effect, by written notice to the client,&nbsp;and iT360 is not liable for any loss or damage suffered by the client as a result. In this clause “Force Majeure Event”&nbsp;means an event beyond the reasonable control of iT360 including, without limitation, strike, lock-out, labour dispute,&nbsp;act of God, war, riot, civil commotion, malicious damage, compliance with a law or governmental order, rule, regulation&nbsp;or direction, accident, breakdown of plant or machinery, fire, flood, storm, difficulty or increased expense in obtaining&nbsp;workers, materials or transport, or other circumstances affecting iT360’s source of supply or means of delivery.<\/p>\n\n\n\n<h3>10. Warranty and Liability<\/h3>\n\n\n\n<p>Except as set out in this clause 10, all terms, conditions, warranties and representations, expressed or implied by statute, common&nbsp;law or otherwise (including, without limitation, (i) those implied pursuant to the Sale of Goods Act 1908 and (ii) implied warranties&nbsp;of merchantability and fitness for a particular purpose with respect to hardware, software and written accompanying manuals),&nbsp;in relation to the goods are excluded to the fullest extent permitted by law.<\/p>\n\n\n\n<p>To the maximum extent permitted by the applicable laws of New Zealand, iT360 shall not be liable for any other damages&nbsp;whatsoever (including, without limitation, damages for loss of business profits, business interruption, loss of business information&nbsp;or other pecuniary loss, damage or injury) arising out of the use, or inability to use, any goods, services or accompanying&nbsp;documentation supplied by iT360.<\/p>\n\n\n\n<p>Notwithstanding any other clause in this Contract, the entire liability of iT360 under or in connection with the supply of the goods&nbsp;and services, whether for negligence, breach of contract, misrepresentation or otherwise, is limited, in respect of each event or&nbsp;series of connected events, to the cost of the defective, damaged or undelivered goods or services which give rise to such liability&nbsp;as determined by the price (net of GST) invoiced to the client.<\/p>\n\n\n\n<h3>11. Consumer Guarantees Act 1993 &amp; Fair Trading Act 1986<\/h3>\n\n\n\n<p>The client agrees that where they and iT360 are both in trade and that it is fair and reasonable that:<\/p>\n\n\n\n<p>(a) The provisions of the Consumer Guarantees Act 1993 do not apply; and<br>(b) Sections 9, 12A and 14(1) of the Fair Trading Act 1986 are contracted out of.<\/p>\n\n\n\n<h3>12. Client Indemnity<\/h3>\n\n\n\n<p>The client will indemnify us for any physical, direct and indirect damage, economic loss or other loss or cost or expenses (including&nbsp;legal expenses on a solicitor and client basis), and against any claims or proceedings against iT360 to the extent caused or&nbsp;contributed by the client (or any of its agents or employees) or arising from a breach of this Contract.<\/p>\n\n\n\n<h3>13. Export Terms<\/h3>\n\n\n\n<p>Where the goods are supplied for export outside New Zealand, the provisions of this clause 10 shall apply (subject to any special&nbsp;terms agreed in writing between the client and iT360), notwithstanding any other provision of this Contract. The client shall be responsible for complying with any legislation or regulations governing the importation of the goods into the&nbsp;country of destination and for the payment of any duties on them.&nbsp;The client shall be responsible for arranging for testing and inspection of the goods at iT360’s premises before shipment. iT360&nbsp;shall have no liability for any claim in respect of any defect in the goods which would be apparent on inspection and which is&nbsp;made after shipment, or in respect of any damage during transit.<\/p>\n\n\n\n<h3>14. PPSA: Personal Property Securities Act 1999<\/h3>\n\n\n\n<p>The client acknowledges that the Contract creates a security interest (as that term is defined in the Personal Properties Securities&nbsp;Act 1999 (“PPSA”)) in the goods (“security interest”). The client will, if requested by iT360, sign any documents (including any new&nbsp;agreements), provide all necessary information and do anything else required by iT360 to ensure that the security interest is a&nbsp;perfected security interest (as that term is defined in the PPSA).<\/p>\n\n\n\n<p>The client will not enter into any agreement which permits any other person to register any security interest under the PPSA in&nbsp;respect of the goods without iT360’s prior written consent.<\/p>\n\n\n\n<p>The client agrees, to the extent permitted under the PPSA and unless iT360 agrees by notifying the client in writing, that the client&nbsp;will have no rights under Part 9 (Enforcement) of the PPSA. For example, but without limitation, the client will have no rights under&nbsp;sections 114(1)(a) and 116 (to receive notice of sale and statement of account), sections 121(2) and 122 (to receive any proposal&nbsp;or object to any proposal to retain the goods), sections 125 and 129 (relating to removal of accessions), and sections 132 and&nbsp;133 (to redeem the goods or reinstate the contract).<\/p>\n\n\n\n<p>The client waives its right under the PPSA to receive a copy of any verification statement or financing change statement (as those&nbsp;terms are defined in the PPSA).<\/p>\n\n\n\n<h3>15. Privacy Information<\/h3>\n\n\n\n<p>The client and any Director(s) and\/or Guarantor(s) agree that any information about them provided to iT360 may be used by iT360 for purposes connected with our business including but not limited to direct marketing, debt collection and credit reporting or assessment. The client and the Director(s) and\/or Guarantor(s) authorise us, should it be required, to provide such information to any external agency or any party for credit information, debt collection and assessment purposes and that agency or party are hereby authorised to use and continue to use such information as part of their business services. Any personal information is held at the main business premise office of iT360 Limited and the client and the Director(s) and\/or Guarantor(s) have certain right of access and correction to their personal information under the Privacy Act 2020.<\/p>\n\n\n\n<h3>16. Unsolicited Electronic Messages Act 2007<\/h3>\n\n\n\n<p>The client and the Guarantor(s) consent to receiving electronic messages (including emails and text messages) from iT360 from&nbsp;time to time.<\/p>\n\n\n\n<p>iT360 will cease sending electronic messages on receipt of written confirmation from the client or the Guarantor(s) that they no&nbsp;longer wish to receive such messages or if they use the unsubscribe function in the electronic message.<\/p>\n\n\n\n<h3>17. Dispute Resolution<\/h3>\n\n\n\n<p>Unless otherwise provide in this Contract, if a party considers that there is a dispute in respect of any matters arising out of, or in&nbsp;connection with, this Contract then that party shall immediately give notice to the other party setting out details of the dispute.&nbsp;The parties will endeavour in good faith to resolve the dispute between themselves within 5 Working Days of the receipt of the&nbsp;notice, failing which the parties will endeavour in good faith within a further 10 Working Days to appoint a mediator and resolve&nbsp;the dispute, time being of the essence.<\/p>\n\n\n\n<p>Neither party will commence legal proceedings against the other except for injunctive relief before following the procedure set&nbsp;out above.<\/p>\n\n\n\n<h3>18. Non-Solicitation of Staff<\/h3>\n\n\n\n<p>During the term that iT360 provides goods and\/or services to the client pursuant to this Contract and for 6 months thereafter,&nbsp;the client will not, whether directly, indirectly through an associated company, or otherwise, solicit for employment any person&nbsp;iT360 has employed or contracted. The client and iT360 agree that this restraint of trade is reasonable in all the circumstances.&nbsp;However, if a court of competent jurisdiction finds it to be unenforceable, the client and iT360 agree to accept any modification of&nbsp;the duration of the restraint concerned which the court sees fit to impose, or if it does not see fit, which may be required to make&nbsp;the restraint enforceable.<\/p>\n\n\n\n<h3>19. General<\/h3>\n\n\n\n<p>The client may not assign all or any of its rights or obligations under this Contract without the prior written consent of iT360.&nbsp;iT360 is not bound by any error or omission on any invoice or other document or statement issued by iT360.<\/p>\n\n\n\n<p>From time to time, third parties and\/or subcontractors will be needed to preform work for clients on behalf of iT360 Limited. The&nbsp;client agrees that iT360 Limited may engage third parties to perform such work as iT360 Limited deems necessary.<\/p>\n\n\n\n<p>This Contract between iT360 and the client is governed by the laws of New Zealand and iT360 and the client each submit to the&nbsp;non-exclusive jurisdiction of the New Zealand courts.<\/p>\n\n\n\n<p>If a provision in this Contract is illegal, invalid or unenforceable, the validity and enforceability of the remaining provisions is not&nbsp;affected.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>1. Terms of Trade iT360 Limited and any successor entity (“iT360”) will contract to sell and supply goods and services on these Terms and Conditions&nbsp;of Trade and the Credit Account Application only (together, the “Contract”). By placing or confirming an order with iT360, the client&nbsp;is accepting these Terms and Conditions of Trade, and anything to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_links_to":"","_links_to_target":""},"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/pages\/4177"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=4177"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/pages\/4177\/revisions"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=4177"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}