{"id":8117,"date":"2020-08-13T09:13:52","date_gmt":"2020-08-12T21:13:52","guid":{"rendered":"https:\/\/it360.co.nz\/?page_id=8117"},"modified":"2021-11-18T12:35:00","modified_gmt":"2021-11-18T00:35:00","slug":"press","status":"publish","type":"page","link":"https:\/\/it360.co.nz\/press\/","title":{"rendered":"Press"},"content":{"rendered":"\n<h2>iT360 Enters Taranaki as Spark Partnership Deepens<\/h2>\n\n\n\n<p><em>17 November 2021<\/em><\/p>\n\n\n\n<p>Auckland-based managed IT service provider <a href=\"https:\/\/it360.co.nz\/\">iT360<\/a> has expanded into Taranaki in a further development of the company&#8217;s partnership with Spark.<\/p>\n\n\n\n<p>iT360 developed a relationship with Spark in Auckland over the last few years, becoming an official Spark IT partner for the North Shore and Waitakere Spark business hubs. This enabled Spark business customers in those areas to access IT services and to tie that into their existing Spark relationship and billing.&nbsp;<\/p>\n\n\n\n<p>Earlier this year, the opportunity arose to work with Spark further afield, in the Taranaki region.<\/p>\n\n\n\n<p>iT360 CEO Dave Wilson reached out to a long-time friend, Taranaki local and IT industry veteran James Robinson, to lead the new business, which has now opened and is serving customers both through the Spark partnership and directly.<\/p>\n\n\n\n<p>While that certainly has iT360 eyeing other regions, for the moment the company is focused on creating an operation in Taranaki that is as &#8220;successful and sustainable&#8221; as that in Auckland, Robinson said.<\/p>\n\n\n\n<p>A family-owned business, IT360 said every part of the business is championed by individuals whose focus is to deliver a &#8220;fantastic&#8221; customer experience.<\/p>\n\n\n\n<p>Robinson was excited to introduce new Taranaki customers to the team and enable them to experience what he described as the “white-glove” customer onboarding process led by customer service manager Chris Jordan. In accounts, director Ruth Wilson also happens to head up pastoral care of employees and even of customers.&nbsp;<\/p>\n\n\n\n<p>&#8220;Our ideal customers are those for whom this approach to business really matters,&#8221; Robinson said.<\/p>\n\n\n\n<p>iT360 said it backed this people-centric approach with technical expertise and a &#8220;strong strategic game&#8221;.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;Technical skills are the bare minimum requirement for any managed IT service provider and iT360 has plenty&#8230;where the organisation really strives to stand out however, is in their ability to help customers take a strategic approach to IT.&#8221;&nbsp;<\/p><cite>James Robinson<\/cite><\/blockquote>\n\n\n\n<p>This required lifting the focus from technical support onto uncovering where customers are trying to go with their business and creating a strategy for using technology to help them get there.<\/p>\n\n\n\n<p>iT360 is operating in the new region through a new company, <a href=\"https:\/\/it360.co.nz\/it-services-taranaki-lower-north\/\" data-type=\"page\" data-id=\"8469\">iT360 Lower North<\/a>, of which Robinson is a significant minority shareholder.<\/p>\n\n\n\n<p>iT360 is a partner of HPE, HP, Aruba, Microsoft, Veeam and Watchguard among others. It is also a&nbsp;<a href=\"https:\/\/www.reseller.co.nz\/article\/629719\/spark-acquire-kiwi-business-telco-provider\/\" target=\"_blank\" rel=\"noreferrer noopener\">partner<\/a>&nbsp;of specialist telco service provider Digital Island, which Spark acquired in 2017.<\/p>\n\n\n\n<h2>About iT360 Limited<\/h2>\n\n\n\n<p>iT360 designs and provides the highest quality, cloud-based, award-winning managed IT services and experiences for the New Zealand small to medium business (SME) landscape. A New Zealand owned company, founded in 1995 with a passion to empower valued business solutions, excellent customer service in the ever-evolving IT technology space. <\/p>\n\n\n\n<p>iT360 makes a positive impact for businesses by offering the right blend of smart solutions, expert delivery with a people-centric approach, to help New Zealand SME’s operate more efficiently and smoothly. The company is backed by, and partners with leading global partners such as Microsoft, Hewlett-Packard, Hewlett Packard Enterprise, Aruba, Kordia, and Veeam. <\/p>\n\n\n\n<p>The main company office is currently located in Wairau Valley, North Shore, Auckland, New Zealand, with an onsite and remote support team infrastructure. To learn more, visit <a href=\"https:\/\/it360.co.nz\">iT360.co.nz<\/a><\/p>\n\n\n\n<p>If you would like more information about this topic, please contact Callum Galloway at iT360 Limited, or email at <a href=\"mailto:Callum.Galloway@iT360.co.nz\">Callum.Galloway@iT360.co.nz<\/a><\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2>iT360 Gains Five New Clients<\/h2>\n\n\n\n<p><em>12 August 2020<\/em><\/p>\n\n\n\n<p>Leading Technology Solutions Provider iT360 welcomes the following companies into its credible fold of client portfolio.<\/p>\n\n\n\n<ul><li>AIM Valuation<\/li><li>Hughes Judd Accounting<\/li><li>Norling Law<\/li><li>Pipeline &amp; Civil<\/li><li>Crossfire <\/li><\/ul>\n\n\n\n<p>Auckland, New Zealand, 12th August 2020 – iT360 Limited is pleased to announce that we have been appointed as the sole Technology Solutions Provider for AIM Valuation, Hughes Judd Accounting, Norling Law, Pipeline &amp; Civil and Crossfire. <\/p>\n\n\n\n<p>The onboarding of these high profiled and credible companie\u0017s into the iT360 stable marks a huge leap forward for the business, which is growing leaps and bounds despite the recent economic landscape. This is testament to the company’s aggressive focus on customer centricity, dedicated IT support and the ability to create bespoke solutions tailored to our clients’ specific business needs.<\/p>\n\n\n\n<p>The onboarding of our new clients is aligned to the iT360 vision of providing New Zealand SME’s with only the best and leading Technology Solutions to help them not only operate more efficiently but to remove the complexities of their daily IT struggles, so that they can get on with their core business”, says Dave Wilson, GM iT360<\/p>\n\n\n\n<p>iT360’s new clients had the following to say on what made iT360 stand out from the rest of the market.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p>iT360 came highly recommended and they have not disappointed.<\/p><cite>Geoffrey Hughes, Hughes Judd Accounting<\/cite><\/blockquote>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p>We were told iT360 do what they say, and they have.<\/p><cite>Matt Tooman, Managing Director, AIM Valuation<\/cite><\/blockquote>\n\n\n\n<h2>About iT360 Limited<\/h2>\n\n\n\n<p>iT360 designs and provides the highest quality, cloud-based, award-winning managed IT services and experiences for the New Zealand small to medium business (SME) landscape. A New Zealand owned company, founded in 1995 with a passion to empower valued business solutions, excellent customer service in the ever-evolving IT technology space. <\/p>\n\n\n\n<p>iT360 makes a positive impact for businesses by offering the right blend of smart solutions, expert delivery with a people-centric approach, to help New Zealand SME’s operate more efficiently and smoothly. The company is backed by, and partners with leading global partners such as Microsoft, Hewlett-Packard, Hewlett Packard Enterprise, Aruba, Kordia, and Veeam. <\/p>\n\n\n\n<p>The main company office is currently located in Wairau Valley, North Shore, Auckland, New Zealand, with an onsite and remote support team infrastructure. To learn more, visit <a href=\"https:\/\/it360.co.nz\">iT360.co.nz<\/a><\/p>\n\n\n\n<p>If you would like more information about this topic, please contact Callum Galloway at iT360 Limited, or email at Callum.Galloway@iT360.co.nz<\/p>\n","protected":false},"excerpt":{"rendered":"<p>iT360 Enters Taranaki as Spark Partnership Deepens 17 November 2021 Auckland-based managed IT service provider iT360 has expanded into Taranaki in a further development of the company&#8217;s partnership with Spark. iT360 developed a relationship with Spark in Auckland over the last few years, becoming an official Spark IT partner for the North Shore and Waitakere [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_links_to":"","_links_to_target":""},"_links":{"self":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/pages\/8117"}],"collection":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/comments?post=8117"}],"version-history":[{"count":0,"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/pages\/8117\/revisions"}],"wp:attachment":[{"href":"https:\/\/it360.co.nz\/wp-json\/wp\/v2\/media?parent=8117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}